[
	{
		"id": "e143dcf9-e7d9-42a5-b18e-0ea35c307cf6",
		"lastname": "Masson",
		"firstname": "Benoît",
		"imageProfilURL": "https://sessionize.com/image/6020-400o400o1-arPQiiVr4xr7U41qyT11vZ.jpg",
		"bio": "Tombé dans la potion quand j'étais petit, je m'intéresse depuis toujours à l'informatique : d'abord joueur, bidouilleur et développeur sur calculatrice, puis professionnellement en tant que chercheur et formateur, et finalement de retour au développement depuis quelques années.\n\nPassionné par les langages modernes, de bas niveau (Go, Rust) ou fonctionnels (Caml, Elm) permettant par leur conception de limiter les risques d'erreur humaine, je m'implique dans les communautés locales pour partager mes expériences et améliorer mes pratiques.\n\nActuellement Team Leader dans l'équipe Noms de Domaines chez OVHcloud.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "be291234-34e1-424f-8b4a-528ffd6c5338",
		"lastname": "Seddiki",
		"firstname": "Sonia",
		"imageProfilURL": "https://sessionize.com/image/cc4a-400o400o1-WTdq9aQxZxJeKZgQXZsuv4.jpg",
		"bio": "Sonia has been in the tech industry for about 5 years now, navigating between backend, ops and cloud. \n\nShe has a (not so secret) passion about cybersecurity, a (maybe more secret) one about tidy Git repositories, and will ramble about them at any given chance, in no particular order.\n\nShe is also an origamist and leaves little paper-folded creatures wherever she goes. It may sound like a serial killer modus operandi, but it's mostly a way to help with fidgeting and ADHD.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "294d6181-500c-4b0f-b609-e0a506ac3077",
		"lastname": "Pennec",
		"firstname": "Nicolas",
		"imageProfilURL": "https://sessionize.com/image/8a80-400o400o1-RmiYnit3QfCZEG3rxJFgE2.jpg",
		"bio": "Fullstack Web Developer, Open Source Enthusiast, RennesJS Co-Founder, Bike & Run Addict !",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "54a59345-ced3-4447-bbf8-d3ce1bc1cec6",
		"lastname": "Verachten 🍰",
		"firstname": "Bruno",
		"imageProfilURL": "https://sessionize.com/image/e1d3-400o400o1-NHd7EUKggtjD6r2BmsuqhX.png",
		"bio": "Dad of two, husband of one, I've been secretly geeking out since '89 – back when handheld devices were as cool as shoulder pads.\nI dabble in beekeeping and permaculture, and yes, I'm the Linux-loving, Android-tinkering, Docker-dabbling, ARMV8 aficionado in the room.\nWhen I'm not convincing my gadgets to get along, you'll find me knee-deep in the world of Linux and open source, treating single-board computers like the rockstars they are.\nBeyond tech, I'm into the zen of gardening, the art of handcrafted woodworking, and the thrill of bike riding.\nOh, and did I mention I'm a bit of a chatterbox, even though I might seem low-key?\n\nOn a mission to spread the gospel of ARM and RISC-V Socs—because who needs a boring CPU when you can have a tech rockstar?",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "8852b645-beb0-4433-85f1-4a85c989a1ea",
		"lastname": "Landurein",
		"firstname": "Enora",
		"imageProfilURL": null,
		"bio": "J’ai commencé à étudier l’informatique juste après mon Bac à l’université Bretagne Sud de Vannes où j’ai obtenu un DUT et un master. Mon master et les stages réalisés m’ont mené aux domaines de la 3D.\n\nJe travaille désormais en tant qu’ingénieure chez Sopra Steria depuis 2 ans et j’ai eu la chance d’être sur des projets passionnants autour de la simulation sur les technologie Unreal Engine et Unity.\n\nJ’ai également pu travailler sur des projets en réalité mixte.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "b55331e8-3151-4604-9350-64d63a1693b3",
		"lastname": "Chesneau",
		"firstname": "Pierre",
		"imageProfilURL": "https://sessionize.com/image/aa62-400o400o1-9UR9WxJK3upwhALewADge2.jpg",
		"bio": "Architecte Logiciel & Responsable du build Azure chez Bleu, j'aime les solutions simples, autant à comprendre qu'à utiliser.\nLes meilleures solutions sont celles faussement simples, car \"La simplicité est la sophistication extrême\" (Léonard de Vinci)",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "619ba5cd-a12a-4526-9f1a-7b9dd816d6a3",
		"lastname": "Decout",
		"firstname": "Sylvain",
		"imageProfilURL": "https://sessionize.com/image/54eb-400o400o1-DBkSeeptTaUkjWt2TUnEZs.png",
		"bio": "Sylvain est coding architect chez Shodo. Développeur dans l'écosystème Java depuis 2007, il apprécie avant tout le craftsmanship, l'architecture logicielle en général et le domain-driven design en particulier.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "aebf1399-c9c0-4dd7-a7c2-a3a65b71eed1",
		"lastname": "Houllier",
		"firstname": "Gregory",
		"imageProfilURL": "https://sessionize.com/image/7e7f-400o400o1-Xsgrp5MpJVHG8THY2ffrw5.jpg",
		"bio": "TypeScript Addict, Web Enthusiast, RennesJS Co Founder",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "e2d688bf-bd80-4227-937e-a38b9cc3a7ae",
		"lastname": "Bourgain",
		"firstname": "Olivier",
		"imageProfilURL": null,
		"bio": "Olivier is a software engineer at Mirakl with a passion for performance optimization and building efficient, scalable systems. With extensive experience in Java and JVM, Olivier is driven by the challenge of making software faster, more reliable, and better suited to real-world demands. In addition to his job, he enjoys exploring the latest trends in high-performance computing, infrastructure and algorithms.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "124037c0-913b-4e2c-9fe8-9795990aa7ea",
		"lastname": "Mellerin",
		"firstname": "Simon",
		"imageProfilURL": "https://sessionize.com/image/6e0b-400o400o1-HT4LjsLvqLziCMQYGvwuPY.jpg",
		"bio": "Développeur web chez Makina Corpus et créateur de l'application web open-source æneria, j'aime les jolis données bien présentées ;)",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "84071a95-0399-4c8a-a43d-ad8dec77a7cc",
		"lastname": "Navas",
		"firstname": "Chris",
		"imageProfilURL": "https://sessionize.com/image/7d96-400o400o1-NcnQfvaUtwzg3ksmFfZkyc.jpg",
		"bio": "Je suis consultant chez Wescale depuis bientôt 6 ans, avec une passion pour l’informatique qui remonte à mes débuts. \n\nÀ 12 ans, alors que le RFC sur le DNS venait de paraître fin 1983, j’apprenais à coder en BASIC puis en ASM 6502 sur l’ORIC-1 familial, guidé par mon père.\n\nDepuis, je vis et partage cette passion à travers mes projets et conférences, avec l’objectif de transmettre mes connaissances et d’échanger sur les innovations qui transforment notre métier.\n\n\nRéférences et conférences passées :\nJe présente régulièrement des conférences en interne chez Wescale, nos clients, notamment :\nHTTP/3 : 35 ans d’histoire du protocole HTTP (https://youtu.be/qmwtXp2Nadk )\n\nLes bases du DNS (interne, sans replay)\n\nL’IoT et le cloud (interne, sans replay)\n\nJ’ai également animé plusieurs conférences publiques lors de meetups parisiens et d’événements internes pour nos clients.\n\nQuelques références publiques :\nOVH World Tour 2015 : Présentation de l’infrastructure de Vodkaster\nhttps://www.youtube.com/watch?v=CDvCJA6Qz84\n\n\nOVH Summit 2016 : Comment j’ai découvert qu’un chat mange toutes les 2/3 heures\nhttps://twitter.com/axelmore/status/785848961609465856\n\nhttps://www.youtube.com/watch?v=ohmKeRsXz0E\n\n\nMultiples Conférences interne Wescale et chez les clients : DNS, HTTP, 12 facteurs, L’IoT et le cloud, etc ...",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "f4d763bf-5395-4cb6-a1fc-9be2c6f40534",
		"lastname": "Eleouet",
		"firstname": "Gaëtan",
		"imageProfilURL": "https://sessionize.com/image/81be-400o400o1-WwcbJkwDUaQAiGwjJ7mmtH.png",
		"bio": "Dans mes jeunes années être geek n’était pas un métier et pourtant je suis aujourd’hui développeur depuis 15 ans. Animé par des convictions fortes sur l’impact des développeurs sur le monde, je transmets et j’enseigne dans le cadre d’atelier de code et en vacation en école d’ingénieur. Au-delà de mon métier, c’est aussi une passion : je code pour le plaisir dans des projets personnels et lors de compétition de programmation (@egaetan).",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "f7977f6a-ca50-40c6-b54f-b55db26cb0dd",
		"lastname": "Reynier",
		"firstname": "Maxime",
		"imageProfilURL": "https://sessionize.com/image/3db0-400o400o1-UKQh5nUsQdVFjwVBmSShMG.jpg",
		"bio": "Architecte Solution chez Onepoint.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "e4973b28-502d-44b2-bff4-ca25f11b5c38",
		"lastname": "Mediavilla Saiz",
		"firstname": "Inigo",
		"imageProfilURL": null,
		"bio": "Software Engineer",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "f0679a02-6e5e-4a58-9f1e-322ed6d69ff0",
		"lastname": "Lecacheur",
		"firstname": "Sébastien",
		"imageProfilURL": "https://sessionize.com/image/a166-400o400o1-BAVKQ2xjVFVsVZFKjgqxeu.jpg",
		"bio": "Très attaché au logiciel libre pour découvrir comment les autres développeurs programment et comment ces projets fonctionnent, j’aime le code !\n\nDéveloppeur C, puis web, puis Java EE, puis PHP, puis Android, puis… Le langage de programmation n’est qu’un moyen pour moi.\n\nEn tant qu’architecte je suis continuellement partagé entre “aller vite” et “s’attarder sur les détails”.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "ab594bc0-70e0-4637-a9cc-2b839d2995af",
		"lastname": "Aboaf",
		"firstname": "Emmanuelle",
		"imageProfilURL": "https://sessionize.com/image/433f-400o400o1-TknoSaLhLts3hAmiW2Q5zt.jpg",
		"bio": "Sourde de naissance, bionique (deux implants cochléaires) et surtout développeuse Fullstack Angular .NET chez SHODO, je lutte chaque jour pour l’accessibilité. Dans mon monde idéal, tout doit être accessible aussi bien dans la vraie vie que dans le Web.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "f24b40fe-f430-46df-be2e-5fd2ee3d3b83",
		"lastname": "Sécurin",
		"firstname": "Lucas",
		"imageProfilURL": "https://sessionize.com/image/3178-400o400o1-naUPsUEuWhHhmgHQq9iMBy.png",
		"bio": "Le Dr. Lucas Sécurin est un chercheur spécialisé en sécurité informatique, avec une expertise particulière dans les attaques par phishing. Ses travaux se concentrent sur le développement de méthodes avancées de détection et de prévention des tentatives de phishing, visant à protéger les utilisateurs et les entreprises contre ces menaces croissantes. Il est reconnu pour ses contributions innovantes dans le domaine de la cybersécurité et ses publications académiques sur les stratégies de défense contre les cyberattaques.\n\nNon je plaisante, tout a été inventé par un LLM.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "5675dfb0-14be-4f96-ba1c-f36276ab030a",
		"lastname": "Bouvet",
		"firstname": "Yann",
		"imageProfilURL": "https://sessionize.com/image/d9e7-400o400o1-D4nfLHXh8Ch9fCzrNZytxX.jpg",
		"bio": "Développeur Fullstack Senior chez Shodo Lyon, je suis tombé dans le software craft récemment.\n\nSes pratiques et méthodes m'émerveillent et facilite mon travail, c'est pour ça que j'aime en parler.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "107ca0a9-fade-4f1f-940d-01ec9967ee87",
		"lastname": "Sorel-Giffo",
		"firstname": "Luc",
		"imageProfilURL": "https://sessionize.com/image/708a-400o400o1-7Rj4bkFvq6wkqAGZ2uReY.jpg",
		"bio": "Tech lead chez See you sun. Expert Python pendant un et demi chez Purecontrol. Consultant formateur Python pendant 6 ans chez Zenika.\nJ'ai co-fondé la communauté Python-Rennes, que je co-anime régulièrement et dans laquelle je présente des sujets de temps en temps.\nMes projets persos Python tournent autour de la génération de documentation à partir du code source, soit par analyse statique (py2puml), soit par traçage d’exécution (pydoctrace).",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c0d9a6de-346a-4cc1-9fac-4f5080d25699",
		"lastname": "Wolf",
		"firstname": "Guillaume",
		"imageProfilURL": "https://sessionize.com/image/e094-400o400o1-4PH2fej3h5rw5gnD5BkmAr.jpeg",
		"bio": "I am highly involved in raising awareness about environmental issues related to digital usage.\n- I lead numerous citizen workshops such as The Digital Collage du Numérique and the Battle of the Tech\n- I speak at events and conferences (Nantes Digital Week, Paris Web, etc.).\n- I am actively involved in collectives like Nantes Numérique Responsable , GreenIT and The Green Compagnon\nI am certified to conduct Life Cycle Assessments (LCAs) , I am a trainer for the Digital Collage and I have been recognized as a CSR Ambassador by Nantes Métropôle.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c03ddc8d-accb-4939-bc0a-b54d69f0e1f9",
		"lastname": "Joffre",
		"firstname": "Jean-baptiste",
		"imageProfilURL": null,
		"bio": "Jean-Baptiste Joffre est un Lead Tech freelance chez Whiterock Consulting, avec une expertise en Java/Spring, Golang, protocoles Internet (TCP/IP), architecture des systèmes, cloud computing et systèmes distribués. Ancien Architecte Solutions et Lead Developer chez MAIF VIE, il a dirigé des projets innovants et complexes.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "d5411057-c78c-4144-97f5-20d81354268b",
		"lastname": "Soubiran",
		"firstname": "Estéban",
		"imageProfilURL": "https://sessionize.com/image/1ed3-400o400o1-HKgRXQY6Jpmjg8yfLSB3Zv.png",
		"bio": "Je suis développeur web avec plus de 7 ans d'expérience, et full-stack depuis quelques années. Ma priorité est d'optimiser l'expérience utilisateur à chaque étape du développement, et je m'efforce d'apprendre constamment, que ce soit du code, du design ou de l'administration système.\n\nCette approche m'a conduit à développer une passion pour l'open-source. Que ce soit pour étudier du code ou y contribuer activement, j'aspire à participer à la communauté de diverses manières : en rédigeant de la documentation, en améliorant le design, en corrigeant des bogues ou en proposant de nouvelles fonctionnalités. Je gravite principalement autour de UnJS, Vite, Vue.js, Nuxt, Adonis et Laravel !\n\nMa seconde grande passion est le partage des connaissances. À travers mon blog (https://soubiran.dev) et mes réseaux sociaux, je m'efforce de diffuser ce que j'apprends et découvre. Mon objectif est de transmettre des informations de manière claire et accessible, comme j'aurais souhaité les trouver lorsque j'ai débuté dans le développement web, à une époque où des milliers de questions m'envahissaient et où les réponses étaient parfois rares.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "3de0afa9-fb28-44cc-9492-131b07680cee",
		"lastname": "Jakobi",
		"firstname": "Milan",
		"imageProfilURL": null,
		"bio": "Informaticien au coeur pur mais aux intentions dégueulasses.\nNouvellement contributeur Keycloak. Ancien contributeur de collections core Ansible.\n\nPassionné de sécurité applicative en particulier et d'informatique en général. \n\nDevise: si c'est pas open-source c'est condamné à mourir.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "a73a5394-e90a-4d3d-bb13-dfd2b0fcb50b",
		"lastname": "Béthus",
		"firstname": "Ivan",
		"imageProfilURL": "https://sessionize.com/image/f099-400o400o1-N4FGkwct3jNUtDrbqgUVnk.png",
		"bio": "Développeur backend depuis 5 ans chez onepoint, formateur et enseignant vacataire à l'IUT de Bordeaux. Au-delà de la résolution de bug et du clean code, une passion : partager !",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "3704c939-cf7e-4eb5-b27e-3c4adcc26849",
		"lastname": "Serrand",
		"firstname": "Amélie",
		"imageProfilURL": "https://sessionize.com/image/7961-400o400o1-TXTqMumsw15wFJteDoqSjh.jpg",
		"bio": "Développeuse fullstack depuis 5 ans 👩‍💻\nJ'ai toujours travaillé dans le développement d'application web dans le domaine de la santé. 🏥. Un domaine qui me passionne. \nAujourd’hui spécialisée en téléradiologie, je conçois et optimise des applications permettant à des radiologues et professionnels de santé d’accéder et d’interpréter des images médicales à distance.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "572d908f-34f0-41b6-bdcb-ca54a5afac31",
		"lastname": "El Amrani",
		"firstname": "Ali",
		"imageProfilURL": "https://sessionize.com/image/e958-400o400o1-35G6fcmBz2BUK3YwKTwGAb.jpg",
		"bio": "Avec plus de 20 ans d’expérience dans l’ingénierie logicielle et le management, je suis passionné par la construction et la transformation d’équipes tech performantes et durables. \n\nMon parcours varié m’a permis d’allier expertise technique  et compétences humaines. En prônant des pratiques modernes, je veille à aligner les objectifs stratégiques sur les ambitions des équipes.\n\nMes interventions abordent des sujets tels que le leadership technique, l’efficience vs la productivité, ou encore les méthodologies pour concevoir des systèmes résilients à l’ère du Cloud. \n\nChaque talk est conçu pour inspirer et offrir des outils concrets à une audience variée, allant des développeurs aux leaders IT.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "32398022-78ba-4385-8c4f-db0f8adf3395",
		"lastname": "Luta",
		"firstname": "Raphaël",
		"imageProfilURL": "https://sessionize.com/image/a287-400o400o1-pSQHEoSMTvNLuKrpBmLK7d.jpg",
		"bio": "Je suis un consultant technique indépendant, spécialiste des aspects opérationnels (sécurité et performance) des systèmes et applications.\n\nPassionné par les données, je développe également pour mes clients des systèmes de traitement et de visualisation de données en s'appuyant sur les outils tels que Apache Spark, Vert.x ou D3.js/Vega.js.\n\nJavaiste depuis les premières bétas et membre de la fondation Apache depuis plus de 15 ans, j'ai contribué à plusieurs projets Apache Jakarta donc Jetspeed et JMeter.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "424a78bd-3b54-4063-8892-9a920fc3b044",
		"lastname": "Hiegel",
		"firstname": "Fabien",
		"imageProfilURL": "https://sessionize.com/image/96f9-400o400o1-Tr7tqUqzAumNarjaXqcWcJ.jpeg",
		"bio": "Développeur passionné ; quel que soit le langage de programmation, tout est prétexte à créer et à y prendre du plaisir.\nPar mes diverses expériences, j'ai découvert et aiguisé mes pratiques du craft, notamment par des ateliers de partage et de veille collective.\n\nEn animant des communautés de pratiques, en facilitant l'internalisation de formations ou encore, en ludifiant des ateliers de pratique, j'espère pouvoir transmettre cette passion aux personnes qui m'entourent et les aider à apprendre les compétences techniques qui les font rêver.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "cf1c7638-d416-4fcb-800a-f364f419dfaa",
		"lastname": "Salaün",
		"firstname": "Gaël",
		"imageProfilURL": "https://sessionize.com/image/2fd0-400o400o1-Eux73rXZ91bSs2pwW1wRBx.jpg",
		"bio": "Développeur et organisateur d'événements : Agile Tour Rennes, SoCraTes Rennes, meetup Software Crafters Rennes\nEgalement Scrum master ou directeur technique suivant les lieux, les projets ou les époques.\nMon intérêt dans mon métier, c'est le partage des connaissances et l'apprentissage perpétuel, aussi bien humain que technique. Et les gens qu'on rencontre sur ce chemin !",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "62a808c7-fc60-4861-a67a-0faf19b410fd",
		"lastname": "Lair",
		"firstname": "François-Xavier",
		"imageProfilURL": "https://sessionize.com/image/21a9-400o400o1-nGn5SbDvNXuCZ5YFwHMaBX.jpg",
		"bio": "Après plus d'une dizaine d'année de Devfront j'interviens à présent sur les projets en tant qu'expert accessibilité et  qualité. Expert BBQ (Bike, Beer and QualityWeb), quand je ne bosse pas sur la qualité Web j'adore bricoler des vélos ou brasser de la bière.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "89ef7dc8-3f4e-4680-b71f-b1ec0c5ad6e2",
		"lastname": "Bartlett",
		"firstname": "William",
		"imageProfilURL": "https://sessionize.com/image/dc3f-400o400o1-JESyazdrPjSzquSvrjp9Mk.jpg",
		"bio": "Développeur de deuxième génération, William a eu son premier compte e-mail en 1990 et il est tombé dans l'informatique à l'âge de 10 ans. Son périple dans l'univers de la programmation est passé par les pays superpuissants du procédural et de l'orienté objet où l'on parle le C, le Python ou le Java. Il a aussi parcouru les contrées plus exotiques du monde fonctionnel armé seulement d'un lambda et de parenthèses. L'entrainement dans l'agilité lui a été imposé comme une évidence et a permis de s'adapter à toutes circonstances sans se blesser.\nSon familier est le pingouin et sa devise « le bon outil au bon moment ».",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "a93932b4-8308-4fba-b918-04467f3ca1b5",
		"lastname": "Ledez",
		"firstname": "Nicolas",
		"imageProfilURL": "https://sessionize.com/image/676e-400o400o1-DuqeMkm76i3NqTf2r4n7aD.jpg",
		"bio": "Nicolas Ledez works as a system administrator for CGWire and in the past for other companies of various sizes. And some freelance work on the side.\n\nHe likes to define his work as \"Lego engineer\", other people call it devops.\n\nAfter several years of experience, he became devops fullstack aka sysadmin/dev back.\n\nHe tends to manage products by himself rather than glue together different SaaS.\n\nHe is also an organizer of Rennes devops, Python Rennes, the Breizhcamp and at the AFPY.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "20ac8a46-1f84-4873-81fa-5907968cc03e",
		"lastname": "El Maizi",
		"firstname": "Hafsa",
		"imageProfilURL": "https://sessionize.com/image/4e3d-400o400o1-KqUVTBa31hJDE232K8TKjp.png",
		"bio": "Ingénieure en développement logiciel depuis 6 ans, je suis attachée à l’amélioration continue et le Craft.\n\nJ'accorde une attention particulière aux pratiques DevOps et agiles, convaincue que des processus bien pensés et une bonne collaboration sont essentiels.\n\nJ’aime aussi explorer les aspects moins évidents du développement, là où se trouvent souvent les meilleures opportunités d’amélioration.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "56865d7c-6ff0-4911-8d50-b2a276b9c7a5",
		"lastname": "Baron",
		"firstname": "Alexandre",
		"imageProfilURL": "https://sessionize.com/image/66c6-400o400o1-U7EH5N3pGFb9ZQUKm99YDe.jpg",
		"bio": "Développeur backend chez Code With Us avec une expertise sur le langage Java et le framework Spring. Apprécie aussi Postgresql, la CI, l'infra (à part le yaml), l'architecture, le clean code et la simplicité autant que possible.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c7aad32d-e553-4cb4-889c-57cec629c798",
		"lastname": "Joël",
		"firstname": "Séguillon",
		"imageProfilURL": "https://sessionize.com/image/8e6d-400o400o1-KNYwkEmniuB3SJHaPwk1H.jpg",
		"bio": "20 years in IT, I'm a Devops expert, fan of Kubernetes and CI tools.\n\nhttps://github.com/jseguillon",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "e1e57fb8-830f-4542-b811-47c847e4a0b9",
		"lastname": "Pierrain",
		"firstname": "Thomas",
		"imageProfilURL": "https://sessionize.com/image/2cb5-400o400o1-b8-830f-4542-b811-47c847e4a0b9.0ab7b331-0545-44b7-ac29-da528c15ec81.jpeg",
		"bio": "VP of Engineering in a booming European scale-up (Agicap), Thomas is a former entrepreneur, consultant, architect and eXtreme Programmer obsessed with use cases (as opposed to the solution-oriented approach that we tend to choose in our job a little too much) during more than 27 years. \n\nAlso co-organizer of the DDD France (and former BDD Paris) meetups, Thomas likes to use autonomy, DDD and TDD to boost his efficiency and that of others at work.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "89cd5e0b-53e2-4f40-ae73-febf913ffd14",
		"lastname": "Roye",
		"firstname": "Paul",
		"imageProfilURL": "https://sessionize.com/image/ced5-400o400o1-R24PaRYR53R2mP6VqzJyb7.jpg",
		"bio": "Je suis Lead Tech Backend et coordinateur de nos missions d'expertise à SII Atlantique (Nantes)\n\nJe suis aussi (et surtout ?) un joueur au sens large : jeux de société, jeu de rôle (maitre du jeu depuis mes 15 ans), membre fondateur d'une association de création de jeux de société et d'animations ludiques, joueur et collectionneur de cartes à jouer..",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "947143cb-b22d-4c97-903c-d0cc05b5eb8b",
		"lastname": "Leclerc",
		"firstname": "Gwendal",
		"imageProfilURL": "https://sessionize.com/image/3a9a-400o400o1-XJckExJ9GWvAeiqAfBe1Mi.png",
		"bio": "Fullstack developer depuis une décennie.\nJe fais du Go, du React, du Python, ... \nJ'aime bien toucher à tout et j'adore les tests :)",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "97bdf918-611b-4b36-bcf9-386f681602ba",
		"lastname": "Lefebvre",
		"firstname": "Samuel",
		"imageProfilURL": "https://sessionize.com/image/c26f-400o400o1-Ehbn5An1vGED9yYHP9hqQN.jpg",
		"bio": "Tech Lead at Shodo, I support my clients in the development of software focused on their business domain using the concepts of Behavior-driven development and Driven Domain Design\nI like to discuss and share software quality topics and Agile development practices. .",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "cffb1609-ea23-4fc2-9dfa-eb96e60f68c9",
		"lastname": "Favereau",
		"firstname": "Harold",
		"imageProfilURL": "https://sessionize.com/image/329b-400o400o1-QuLNF6i1ukFqKasjudxjyC.png",
		"bio": "Développeur full-stack chez Liksi depuis mars 2023",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "f3202151-93c0-41d1-8b02-4926f4adbe94",
		"lastname": "Leport",
		"firstname": "Nicolas",
		"imageProfilURL": "https://sessionize.com/image/5310-400o400o1-HrFxUNZ22xYNnX9KytuzNS.png",
		"bio": "Éternel touche à tout Nicolas à d’abord été WebDesigner avant d’être développeur. Ses appétences pour l’apprentissage l’ont amené à être aujourd’hui consultant, formateur et manager.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "725af93f-5681-41af-acb9-80d7dbcd8c4e",
		"lastname": "Corteel",
		"firstname": "Patrice",
		"imageProfilURL": "https://sessionize.com/image/dd68-400o400o1-LySUQdLWa1UYdBbpMEwmJ1.jpg",
		"bio": "CTO de Néosoft, je navigue dans l’univers de la tech depuis près de 30 ans. Mon parcours m’a amené à me concentrer sur les architectures, la qualité du code, la sécurité et l’optimisation des systèmes d’information. Aujourd’hui, je me plonge dans un nouveau défi : comment faire de l’IA un levier responsable. Car un SI performant, c’est bien, mais un SI responsable, c’est encore mieux ! Mon objectif est de réfléchir à l’impact des choix technologiques, en particulier ceux liés à l’IA, sur le long terme, pour aider à construire des systèmes plus durables et, espérons-le, éviter que les GPU ne se transforment en grille-pains à l'échelle planétaire",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "83bf795b-c16c-4db3-909c-02197d773093",
		"lastname": "Sulpis",
		"firstname": "Julien",
		"imageProfilURL": "https://sessionize.com/image/2c67-400o400o1-7PwAWaDz8JckJJjTt4oXZv.jpg",
		"bio": "Développeur front-end passionné, j'aime explorer les outils du web moderne pour créer des applications sans compromis entre performance, accessibilité, et design qui sort du lot. CSS, WebGL et librairies JS minimalistes sont mes outils de prédilection.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "6029450b-fe28-4177-87fe-5c05c4bd5378",
		"lastname": "Maigret",
		"firstname": "Maxime",
		"imageProfilURL": null,
		"bio": "https://www.linkedin.com/in/maxime-maigret/",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c6761e22-8b14-473d-83db-7168e840e2cc",
		"lastname": "Martineau",
		"firstname": "Emeric",
		"imageProfilURL": "https://sessionize.com/image/81dd-400o400o1-W2ezmfWzxkdFh7Pfyerte4.jpg",
		"bio": "D'abord développeur temps-réel puis exploitant, passé par hotlineur, technicien de maintenance informatique, administrateur systèmes et réseaux et enfin développeur.\n\nJe m'intéresse à énormément de sujets que j'inter-connecte mentalement pour en ressortir des idées et des concepts farfelus et improbable.\n\nJe travaille actuellement au Crédit Agricole Technologies et Services dans l'équipe accompagnant les developpeurs vers plus d'automatisation (CI/CD) et que qualité (Sonar).",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "9311189d-9779-44cf-b50c-700a4f4d6901",
		"lastname": "Chotard",
		"firstname": "Alexis \"Horgix\"",
		"imageProfilURL": "https://sessionize.com/image/872c-400o400o1-H7g2nepYUA1xbxPffCzoTy.png",
		"bio": "Alexis \"Horgix\" Chotard is a systems engineer and developer working at PayFit (https://payfit.fr), a French unicorn.\n\nDeveloper by training with experience primarily focused on systems and infrastructure, naturally finding himself involved in all things \"DevOps\"'.\nPassionate about automation to build autonomous, resilient, and easily maintainable systems.\nCommitted to the Cloud Native ecosystem, lover of Rust, and supporter of open source.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "d66b7786-0ffb-4d8e-be39-e5f5915f2d04",
		"lastname": "Burlot",
		"firstname": "Audren",
		"imageProfilURL": "https://sessionize.com/image/3584-400o400o1-L5diZYXvaQSLyXAb2aVufH.png",
		"bio": "Tombé dans une embuscade, j'ai rejoint MaxDS en février 2020 chez qui j'expérimente le dev front, back, le gamedev, la captation, le montage vidéo, l'organisation de LAN, et la consommation conséquente de sauce samouraï.\nAujourd'hui, je suis en mission chez HelloWork au sein de l'équipe Data-Ingé avec qui nous partageons la curiosité pour la technique et la franche camaraderie des tranchées.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c40b8778-e2a5-4824-a755-72ceaa12070d",
		"lastname": "Trebel",
		"firstname": "Stéphane",
		"imageProfilURL": "https://sessionize.com/image/a6be-400o400o1-fnqEYNZ3tQ6s64qHhDetG3.jpg",
		"bio": "Je bourlingue depuis une vingtaine d'années dans le monde du numérique, entre développement web full-stack et architecture de solutions diverses et variées.\n\nMes intérêts :\n- Le code, quel que soit le langage, même si j'ai mes préférences\n- L'automatisation, quelle qu'elle soit\n- L'itération, et donc le DevOps\n- Les memes, partout, toujours, tout le temps",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "72b906ad-1a5b-4110-8178-01698f9ceae6",
		"lastname": "Averty",
		"firstname": "Benoit",
		"imageProfilURL": "https://sessionize.com/image/ff75-400o400o1-XqHmfgpg6av9NWohPmMkfP.jpg",
		"bio": "Je suis consultant et formateur chez Zenika Rennes depuis plusieurs années. Je reste polyvalent car j'aime participer à tous les aspects d'un produit : front, back, data, déploiement.\n\nJe suis très attaché à la qualité des produits que je développe et j'aime revenir aux fondamentaux des technologies que j'utilise.\n\nMes intérêts du moment : HTMX, Agents IA",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "0bef80c5-06bc-419d-98ab-dfe40311fb64",
		"lastname": "Dubrez",
		"firstname": "François",
		"imageProfilURL": "https://sessionize.com/image/e505-400o400o1-DdUczbte3uUs322HZAuXGX.jpeg",
		"bio": "Développeur plutôt back j'essaie d'allier vie pro et vie perso pour essayer de grandir et faire grandir les gens autour de moi.\nDe nature plutôt volontaire, j'aime apporter un peu de FUN dans les projets sur lesquels j'interviens pour générer un peu de dopamine à la fin de nos journées de dev.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "19305f56-33bc-4a09-a9fc-869ecbdbe498",
		"lastname": "Guyard",
		"firstname": "Angi",
		"imageProfilURL": "https://sessionize.com/image/ba0c-400o400o1-pgXKxjvLZE5wFxEgYcQEHR.jpg",
		"bio": "Développeuse reconvertie grâce à l'école 42, passionnée et curieuse dans de nombreux domaines. \n\nLa plupart de ses sujets de prédilection tournent autour de l'inclusion au sens large. \nVous la verrez donc parler autant d'accessibilité pour les personnes handicapées que de féminisme, de diversité dans la tech, de neurodiversité et d'autisme, et de comment vivre ensemble en prenant en compte les caractéristiques et les besoins de chacun. \n\nRêve de participer à rendre le monde plus accessible avec équité.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "43bec2b4-a111-4260-b735-9f21eb6b63cf",
		"lastname": "Paliès",
		"firstname": "Jean",
		"imageProfilURL": "https://sessionize.com/image/5d87-400o400o1-HwfBiWTFBSTMAYcZ1gFhfb.jpg",
		"bio": "20 years of working in IT at various roles, technologies, topologies. I chose software development as a career because I wanted social interactions to be at the heart of what I do.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "cb7ebb0e-3ef1-4d2c-8a2b-96d38131a3e8",
		"lastname": "Bogrova",
		"firstname": "Nailya",
		"imageProfilURL": "https://sessionize.com/image/58e1-400o400o1-Uzs5f3ufSHbzUtPNBGN2EU.jpg",
		"bio": "Ingénieure en informatique depuis 2011, je me spécialise dans le développement du back-end (C# .net Core 6 et Python) tout en m'intéressant de plus en plus à la cybersécurité.\n\nComputer engineer since 2011, I have been working as a back-end developer(C# .net Core 6 and Python), while becoming more and more interested in cybersecurity.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "585544af-3f57-498c-b005-b5059bc5d595",
		"lastname": "Gigon",
		"firstname": "Marie",
		"imageProfilURL": "https://sessionize.com/image/fb4b-400o400o1-hENNFnEtjqDSbZL59DBbKw.jpg",
		"bio": "Ancienne développeuse, je suis aujourd'hui Product Owner chez Zenika et j'accompagne nos clients dans leur transformation produit.\nPassionnée par l'humain et l'organisation des équipes, je me suis formée au Management 3.0 et je suis devenue manager de carrière.\n\nLe travail en équipe est pour moi primordial et que ce soit dans mon rôle de PO ou manager, je chercher avant tout à donner du sens, dynamiser les personnes et les projets, tout en favorisant un climat de bien-être au travail. \n\nDepuis plusieurs années, je partage mes expériences et connaissances en tant que formatrice en agilité et management.\nA présent, je souhaite aller plus loin en donnant des conférences pour partager mes mises en oeuvre et mes apprentissages.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "50118cb3-17eb-4e55-a910-a94a5f83c28d",
		"lastname": "Denmat",
		"firstname": "Tristan",
		"imageProfilURL": "https://sessionize.com/image/8fef-400o400o1-JkBJidrJ6vA2qAqd8FQd1c.jpg",
		"bio": "Tristan est développeur back et architecte depuis 20 ans. Au sein de la société Liksi, il intervient sur la conception et le développement d'applications métier ou la mise en place d'approches DevOps. Par ailleurs formateur Keycloak, il est passionné par les problématiques d'identité numérique et de sécurité.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "a1a3a044-9414-4cc9-a12d-600d60bf0492",
		"lastname": "Buchoux",
		"firstname": "Sébastien",
		"imageProfilURL": "https://sessionize.com/image/1195-400o400o1-JVEyo4NNSK81Pjbc1EF1VB.jpg",
		"bio": "Ancien enseignant-chercheur repenti, reconverti en tech lead/architecte.\n\nJ’aime le code efficient et maintenable ainsi que l'automatisation (CI/CD ❤️).\n\nTechnos de prédilection : Python, Cython, Rust, TypeScript, Java.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "09ba1352-1b84-4ecf-9216-26ec8c345d2d",
		"lastname": "Carbonnel",
		"firstname": "Manon",
		"imageProfilURL": "https://sessionize.com/image/238d-400o400o1-97DpFrcdUDwM3d5iHhtBHi.jpg",
		"bio": "Je suis développeuse web (PHP, Python, JS), experte en intégration web et facilitatrice Agile.\nJ'adore travailler en mob programming et je facilite des sessions de découverte pour @mobprogfr.\nJe suis passionnée par le HTML/CSS et j'ai créé @Csscade, une communauté française sur l'intégration web.\nJ'aime apprendre le software craft et les tests, et je crois énormément à l'Agilité.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "07cd0dc2-1db7-48e4-adb7-4f295d13c3ae",
		"lastname": "Castelein",
		"firstname": "Nathan",
		"imageProfilURL": "https://sessionize.com/image/d0d9-400o400o1-aXikhYCFCuSbwVv4joAAWA.jpg",
		"bio": "Après plus de dix années à travailler pour OVHcloud, j'ai co-fondé Shodo Lille en janvier 2024, une ESN militante qui casse les codes.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "2cfe92bd-2140-4072-956d-73502aaeb90d",
		"lastname": "Cloirec",
		"firstname": "Olivier",
		"imageProfilURL": "https://sessionize.com/image/4602-400o400o1-X36YUmSxGVJJ4sa1JBqCum.jpg",
		"bio": "Consultant Cloud chez WeScale, musicien à corps (et temps) perdu, je me considère aux service des développeurs pour proposer des solutions tant techniques qu'organisationnelles aux problématiques de tous les jours.\nPassionné de culture produit et orga, il m'arrive de me déguiser de temps en temps en Product Owner.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "edd18d0c-feff-4709-9fdc-ce99a8795a74",
		"lastname": "Dassé",
		"firstname": "Anthony",
		"imageProfilURL": "https://sessionize.com/image/922f-400o400o1-wHh2A2VMZKBYNWxh5XYnyB.jpg",
		"bio": "Passionné par les nouvelles technologies, je n'hésite pas à mettre les mains dans le cambouis ! De par mes différentes expériences, j'ai pu travailler sur de nombreuses architectures différentes et de nombreux technologies.\n\nActuellement, je travaille beaucoup sur des sujets clouds ou kubernetes.\n\nConférences données : \n----- Breizhcamp -----\nArchUnit à la rescousse de mon projet ✨ : https://www.youtube.com/watch?v=eVpi0VT4tFQ\nGitlab de A à Z ! Car il n'y a pas que le C et le I : https://www.youtube.com/watch?v=QPujvB37hIM",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "0c9b144a-3a48-4cb8-b9f9-84def47710c6",
		"lastname": "Quintard",
		"firstname": "Christophe",
		"imageProfilURL": "https://sessionize.com/image/08f3-400o400o1-RG4L2GaaVNwjNw6m15iQy9.jpg",
		"bio": "Je suis passé par des startups, IBM, Timwi, Ouest-France et maintenant je suis consultant chez onepoint. Je continue à coder, parce que je ne veux pas être un architecte hors-sol. Mon but, c'est de mettre en place des SI évolutifs, grâce aux meilleurs principes et aux technos actuelles les plus adaptées.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "6da05a26-7eb6-4244-abba-350669a6cd11",
		"lastname": "Siber",
		"firstname": "Eric",
		"imageProfilURL": "https://sessionize.com/image/25f9-400o400o1-9nZfwBWx5SsGz4W6us4tg5.png",
		"bio": "J'ai démarré dans le développement Java et sur des compétences Web en 2005, plongé dans l'agilité à partir de 2009. J'ai régulièrement eu le souci de faire de la veille et de m'intéresser aux évolutions de mon métier sur les axes techniques et méthodologiques. Ces efforts constants m'ont amené à devenir responsable de telles démarches au sein de l'entreprise qui m'employait et au service des collaborateurs qui y étaient sensibles, tout cela sans perdre pied par rapport au terrain.\n\nFreelance depuis 2016, j'apprécie de pouvoir me positionner sur un périmètre d'intervention en cohérence avec un équilibre vie privée / vie professionnelle. J'ai ainsi pu varier les postures et découvrir celles de formateur et d'auditeur qui m'ont enrichi selon différents axes dont la pédagogie et la qualité logicielle. J'ai bien évidemment continué à intervenir, avec mes hard skills et soft skills, dans des équipes produit chez des clients en phase avec mes modalités d'intervention et d'engagement en temps presque plein.\n\nAssocié depuis 2021 avec d'autres freelances de l'organisme de formation HackYourJob valorisant les formateurs freelances et experts de leurs domaine, ainsi que des formations par la pratique. A ce titre, j'accompagne nos clients dans l'analyse de leurs besoins, les formateurs partenaires dans la collaboration étroite qu'ils ont et le cadre exigeant de la formation professionnelle saupoudrée de certification Qualiopi, et contribue au développement business de l'entreprise.\n\nPetit péché mignon, je pratique l'ultra trail. Je suis également à la recherche du minimalisme dans les différentes facettes de ma vie.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "89782719-2288-4b59-aec7-8951ca26c446",
		"lastname": "Touret",
		"firstname": "Alexandre",
		"imageProfilURL": "https://sessionize.com/image/5392-400o400o1-Tho9qRRznEeVdAFKVqpQAh.jpg",
		"bio": "With over two decades of experience as a seasoned software architect, I am fueled by a passion for technology, cloud computing, and software development. Throughout my career, I have designed, built, and managed systems of varying scales across a diverse range of industries, including insurance, financial services, and mobility.\n\nI take great pleasure in sharing my insights and experiences with others, whether by teaching, speaking at conferences, organizing hands-on workshops, or writing articles. By engaging with the community, I aim to inspire and provide practical insights drawn from my hands-on experience.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "3cef0ae9-f716-42f4-9a90-02ced19310d7",
		"lastname": "Boutros",
		"firstname": "Ludovic",
		"imageProfilURL": "https://sessionize.com/image/be71-400o400o1-MQv3HKZHQ6F33SpL3ZNmHT.png",
		"bio": "Développeur passionné depuis plus de 20 ans principalement sur des sujets autour des données.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "5ab0d7c3-da8a-4adf-9e13-58aaa7a9fa32",
		"lastname": "de Rancourt",
		"firstname": "Juliette",
		"imageProfilURL": "https://sessionize.com/image/ef95-400o400o1-MRsavm8DusvDn9sxHnjz33.png",
		"bio": "Juliette has been a full-stack developer for 6 years, building web applications in various functional contexts and contributing to the JUnit 5 framework. Besides seeking to deliver useful, well-crafted software to end-users, she enjoys leveraging testing tools to make test suites pleasant to read and convenient to write.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "bb3d9d1b-57f8-4e44-b487-a6e1492dd5d9",
		"lastname": "Topçu",
		"firstname": "Julien",
		"imageProfilURL": "https://sessionize.com/image/e31d-400o400o1-1b-57f8-4e44-b487-a6e1492dd5d9.d768854a-603f-4104-ae25-25c1d9f53eb8.png",
		"bio": "Julien is a hands-on technical coach with 15 years of experience, specializing in Domain-Driven Design (#DDD). His expertise lies in helping organizations build systems that deliver high business value. Julien focuses on aligning organizational structure, architecture and software practices with business objectives. As a member of the OWASP foundation, he actively promotes application security best practices. An international speaker, Julien enjoys sharing his knowledge with others.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "b1974f5a-0a03-4079-abae-0f87145fb355",
		"lastname": "Haumont",
		"firstname": "Julien",
		"imageProfilURL": "https://sessionize.com/image/7969-400o400o1-B2ZtTrQL9eUSREaVrX8Gyz.png",
		"bio": "Geek, père, motard, métalleux, bricoleur du samedi, modéliste, joueur, badeux, j'ai trop de passions ! Mais ça ne me suffit pas ! J'ai toujours soif de découverte. Ma curiosité est sans fin :)\n\nDans ma vie précédente, j'étais un profil tout terrain (dev, QA, architecture, Scrum Master, pilote projet, Architecte) chez Sopra, habitué des projets d'envergures (plus 100 personnes).\n\nAujourd'hui, après avoir décidé de changer de \"métier\" et satisfaire ma curiosité, je suis un SRE accompli chez BlaBlaCar, spécialisé dans la CI/CD et possédant une forte expertise sur Flux, Helm, Jenkins, GitHub Actions, Renovate, etc\n\nMes références:\nCodelab Enter the Daggerverse ! au devfest 2024\nhttps://devfest2024.gdgnantes.com/sessions/enter_the_daggerverse__/ & https://github.com/jhaumont/enter-the-daggerverse\n\nQuand Windows rencontre Linux... au devfest 2021\nhttps://www.youtube.com/watch?v=xh_BgQhowTQ\n\nArticle du blog BlaBlaCar sur la migration Flux2\nhttps://medium.com/blablacar/from-flux-v1-to-flux-v2-stairway-to-heaven-or-highway-to-hell-876b7bba139b",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "d64fba44-b0b8-4281-bb00-b96f24767244",
		"lastname": "De Carvalho",
		"firstname": "David",
		"imageProfilURL": "https://sessionize.com/image/2579-400o400o1-50fd1692-adc9-430e-9e44-88407a31b701.jpg",
		"bio": "Je viens tout juste de rejoindre Capgemini en tant qu'Architecte Solution. Mais je suis un développeur au final ... j'adore mettre les mains dans le code et le fait un maximum ! \nDéveloppeur \"touche-à-tout\" depuis une quinzaine d'années,\nmon langage de prédilection est le Java (entre autres) mais je travaille également sur des sujets techniques, allant des Bases de données aux API REST en passant par la mise en place d'outillage interne.\nJe suis également friand de tout ce qui concerne les process Agile, j'ai d'ailleurs été ScrumMaster pendant 2 ans.\nLe partage de la connaissance est primordial à mes yeux : documentation bien entendu mais aussi relectures croisées de code, ou encore des communautés de pratiques.\nJ'adore expérimenter et trouver des manière de faire qui améliore la vie et la productivité du développeur.\nEnfin, je participe et contribue activement à certains projets open source autour du #greenit (plugin ecocode pour Sonarqube, collectif Api Thinking).",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "57a0073c-0819-4cbd-ab19-d461605bb965",
		"lastname": "Barroux",
		"firstname": "Mickaël",
		"imageProfilURL": "https://sessionize.com/image/01f9-400o400o1-JvHcT4er1ZBfESraDJ53cF.jpg",
		"bio": "Consultant fullstack sénior spécialisé en développement Kotlin, Java et Scala. \nParticipe à la mise en place de bonnes pratiques au sein des équipes : TDD, BDD, DDD, mob-programming, désendettement, clean code.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "1b42c774-b49f-4975-ade3-bdd4bb6e0f93",
		"lastname": "Blaisot",
		"firstname": "Thomas",
		"imageProfilURL": "https://sessionize.com/image/d837-400o400o1-9UBCTEVymk5WhV1DiZKaZS.png",
		"bio": "Lead Tech chez onepoint depuis plus de 10ans",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "df701232-56b1-4367-b009-d733c289dafe",
		"lastname": "Giraud",
		"firstname": "Nicolas",
		"imageProfilURL": "https://sessionize.com/image/5baf-400o400o1-a635a143-9934-46bb-966c-460355a8a2c5.jpg",
		"bio": "Développeur  passionné, Nicolas évolue depuis près de 15 ans essentiellement sur des projets Java (EE).\n\nAddict aux outils innovants et sensible aux pratiques agiles, c'est d'abord avec les notions de CD/CI qu'il aborde ces notions d'amélioration continue, puis plus récemment dans la mouvance DevOps, où il trouve refuge !\n\nC'est finalement dans un rôle de Tech lead (alias \"couteau suisse\") qu'il intervient, et tente (parfois avec succès) de faciliter la vie de ses co-équipiers dans l'esprit bienveillant du Software Crafter.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "b53d2e80-e297-4265-af4f-9623087d10d5",
		"lastname": "Hackett",
		"firstname": "Damien",
		"imageProfilURL": "https://sessionize.com/image/3119-400o400o1-T119enjFzLycDXCxa7in95.jpeg",
		"bio": "After bachelor in Electronics and M.Sc inComputer Science, especially in Embedded System in Ensimag, Grenoble, France I worked for 10 year for several companies on various embedded environment from baremetal to Embedded Linux throught Real Time OS.\n\n\nI also worked on Electronic Design Automation Software, FPGA/Chip Design in Verilog/VHDL and even SoC Design.\n\nCurrently, I am a so called \"Embedded Practice Leader\" (Embedded Software Expert) at SII, a French software contractor company in Grenoble, France and working also as Senior Embedded Linux/Yocto at Eaton, Montbonnot, France.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "60ee88c6-3fbd-4467-8388-dcb3069e6bc1",
		"lastname": "Cantet",
		"firstname": "Thibaut",
		"imageProfilURL": "https://sessionize.com/image/b91c-400o400o1-QEgWaQotzuTLVAKQwKHKKX.png",
		"bio": "Thibaut est développeur depuis plus de 18 ans. Convaincu par les pratiques craft, il s’efforce de rendre le code le plus simple et agréable à travailler.\nAdepte de DDD, il aime parler design et architecture.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "fecaaa02-e901-4689-97d9-48823e54efa0",
		"lastname": "Pessu",
		"firstname": "Adrien",
		"imageProfilURL": "https://sessionize.com/image/31ee-400o400o1-9BiXoufWtWhxRU8Mcd9thW.jpg",
		"bio": "Je suis developer Field security specialist chez GitHub, mais je suis avant tout un développeur passionné, en particulier de Java, Kotlin et Web. Je m'intéresse aussi particulièrement à la sécurité applicative (AppSec). J'aime chercher/corriger des bugs de sécurité, mais aussi partager et mettre en place les bonnes pratiques.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "9c904945-768e-4597-b942-6be90cf4d731",
		"lastname": "Fränkel",
		"firstname": "Nicolas",
		"imageProfilURL": "https://sessionize.com/image/200e-400o400o1-MVSybLoJJYvYT7ku79HWNt.jpg",
		"bio": "Nicolas Fränkel is a technologist focusing on cloud-native technologies, DevOps, CI/CD pipelines, and system observability. His focus revolves around creating technical content, delivering talks, and engaging with developer communities to promote the adoption of modern software practices. With a strong background in software, he has worked extensively with the JVM, applying his expertise across various industries. In addition to his technical work, he is the author of several books and regularly shares insights through his blog and open-source contributions.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c32ca426-2fdb-44c3-9fd6-7706f7720e77",
		"lastname": "Legros",
		"firstname": "Emmanuel",
		"imageProfilURL": "https://sessionize.com/image/3f10-400o400o1-s7fEzH8rB6m7AyN8yxko6a.jpg",
		"bio": "Après mes premières années en tant que développeur, j'ai eu l'occasion de prendre plusieurs rôles (Engineering Manager, Product Owner, Scrum master, Coach Agile, ...).\nDe retour au plus près de ma passion pour la tech, je suis de nouveau développeur (tech lead) depuis 4 ans.\nAnimateur d'une communauté de partage de connaissances chez Decathlon Digital, je suis toujours prêt à parler tech, organisation d'équipe et surtout, apprendre des autres grâce aux différentes rencontres.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "cef8c142-9b42-4d0a-b2dd-8fe32628f003",
		"lastname": "Bouron",
		"firstname": "Nicolas",
		"imageProfilURL": "https://sessionize.com/image/0d6d-400o400o1-Pvq1jQwqqxn6QXAKq3HgRy.jpg",
		"bio": "Consultant Formateur DevOps/Cloud",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "619dcf9a-1762-4492-850c-78dc1bfe7f48",
		"lastname": "Chauvin",
		"firstname": "Jérémy",
		"imageProfilURL": "https://sessionize.com/image/7436-400o400o1-SPmSC93pPfYk4Uetx4EkjK.jpg",
		"bio": "Développeur un peu touche à tout, je possède une certaine appétence pour le front et les interfaces élégantes et intuitives, même si un bon backend fait toujours plaisir.\nVéritable technophile dans une esprit craftsman et agile, j'aime à ce que l'amélioration continue, la qualité et le partage ne soient pas que des mots.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "d3e04b6b-b82e-40dd-b811-343fb0867746",
		"lastname": "Baguet",
		"firstname": "Sebastien",
		"imageProfilURL": null,
		"bio": "Infra lead chez Purecontrol, spécialisé dans l’infrastructure open source, l’automatisation et la scalabilité des systèmes. Ancien responsable infrastructure chez ARIADNEXT by IDNow, j'ai aussi dirigé des projets R&D en Big Data et en machine learning. Mes domaines d'expertises vont du bas niveau (embarqué, électronique, réparation), aux applicatifs Linux, en passant par le kernel.Je m'intéresse aussi à l’impact environnemental des technologies.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "e6528c62-4131-49a4-b5e3-86c083cccc51",
		"lastname": "Odye",
		"firstname": "Maxime",
		"imageProfilURL": "https://sessionize.com/image/65df-400o400o1-TuTuyxkpA88GV9Y6tMj3oA.png",
		"bio": "Je suis un développeur passionné et formateur sur des sujets techniques autour du monde du développement logiciel. Conférencier technique et agile, j'essaye de mêler la technique et l'organisationnel, deux mondes intrinsèquement lié.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "66462b24-0915-46c5-a5f2-834493f12c6c",
		"lastname": "Durand",
		"firstname": "Mathieu",
		"imageProfilURL": "https://sessionize.com/image/5d69-400o400o1-VJB41AQTfsjX7SH3LhBVFd.jpg",
		"bio": "Développeur Normand au pays des bretons depuis plus de 10 ans, je suis adepte de tous les concepts et acronymes qui font peur comme Clean Code, Software Craftsmanship, Extreme programming, TDD, SOLID, DRY, KISS, YAGNI, FIRST etc.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "e2b571e2-472e-42a1-9a1c-b3b9f542824f",
		"lastname": "Rineau",
		"firstname": "Pierre",
		"imageProfilURL": null,
		"bio": "Why should I write a biography exactly?",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "acbd55f3-0f40-493b-acbd-794c2c0457ea",
		"lastname": "Bossard",
		"firstname": "Cécilia",
		"imageProfilURL": "https://sessionize.com/image/3ee6-400o400o1-f3-0f40-493b-acbd-794c2c0457ea.1c277ef5-7806-4fc7-aab8-7f89e8240953.jpeg",
		"bio": "Développeuse depuis près de 20 ans, je m’intéresse à beaucoup de sujets et aime partager avec les différentes communautés.\n\nVous pouvez d’ailleurs me croiser du côté des Duchess, ou me rencontrer sur Nantes aux meetups Software Crafters, aux coding goûters et Devoxx4kids ...\n\nEt si je ne suis pas derrière mon clavier, c’est probablement que je suis en train de m’occuper de mes petites abeilles :)",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "1f221109-c45a-4149-8770-4610c595d52e",
		"lastname": "Bertrand",
		"firstname": "Sébastien",
		"imageProfilURL": "https://sessionize.com/image/2678-400o400o1-3ApPQg9yPPvrqvV6fyWmn1.jpg",
		"bio": "Développeur backend et chercheur chez Onepoint, je m'intéresse à la fois aux développement côté serveur, à l'analyse de donnée et à l'intelligence artificielle. Avec mes 15 ans d'expérience dans l'industrie, j'aime particulièrement les problèmes épineux et les bugs velus.\n\nJe suis diplômé ingénieur en cognitique depuis 2007 et docteur en cognitique depuis 2024, ma thèse portait sur l'analyse statique de la maintenabilité logicielle à l'aide de graphe de code du programme. J'enseigne également à l'ENSC de Bordeaux INP avec qui je collabore sur mes sujets de recherche.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "8df53dbf-7f6d-4ab5-ac1d-e3eae87af671",
		"lastname": "Gary",
		"firstname": "Gaston",
		"imageProfilURL": null,
		"bio": "Développeur python depuis bientôt 3 ans à purecontrol.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "a90311bb-87bd-406b-bbd9-2a2c3e78b316",
		"lastname": "Deprez",
		"firstname": "Antoine",
		"imageProfilURL": "https://sessionize.com/image/fdbc-400o400o1-9kvmtA3E3S57ZgSz8pss7m.jpg",
		"bio": "Ingénieur développeur et libriste convaincu. Son compagnon de recherche est un canard privilégiant la confidentialité.\nSa bonne humeur est ses compétences techniques auront pour but de vous faire découvrir une nouvelle face de l’informatique.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "2e34a8ec-f173-4561-ad6e-0504cd1804a7",
		"lastname": "Viley",
		"firstname": "Marie",
		"imageProfilURL": "https://sessionize.com/image/865a-400o400o1-0614b306-c973-4cb7-a982-2ec24d0858d7.jpg",
		"bio": "Directrice d'agence chez Zenika, je suis passionnée par la détection des fake news et de la désinformation, l'OSINT et les chats.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "19d8ff26-d4a1-4a0c-bd0e-33946f4e3772",
		"lastname": "Quincerot",
		"firstname": "Emmanuel",
		"imageProfilURL": "https://sessionize.com/image/9262-400o400o1-PtXPeMFAtZnUoNeVmwX8Jb.jpeg",
		"bio": "Développeur fullstack depuis 15 ans, j'ai travaillé sur des sujets variés qui m'ont confronté à de nouvelles problématiques : applications web, migration et tests de pipelines Jenkins, docker... Dernièrement j'ai plus particulièrement travaillé sur la scalabilité de la base de données Doctolib.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "548a46a5-9467-4102-9b42-aea93b54e8ef",
		"lastname": "Chilla",
		"firstname": "Mehdi",
		"imageProfilURL": null,
		"bio": "Mehdi, Passionné de Développement et Expert en Technologies  \n\nDepuis plus de dix ans, Mehdi évolue dans le développement logiciel, maîtrisant les langages Java, Go et JavaScript. Tech Lead expérimenté, il conçoit et optimise des systèmes robustes et évolutifs, en garantissant performance et qualité à chaque étape.  \n\nAu sein d’une alliance de mutuelles et d’assurances, il applique des standards exigeants et encourage les meilleures pratiques pour assurer la fiabilité des solutions mises en place. Expert en infrastructures modernes, il exploite Kubernetes et les environnements cloud pour concevoir des architectures résilientes et adaptées aux enjeux technologiques actuels.  \n\nToujours curieux et en quête d’innovation, Mehdi explore les opportunités offertes par l’intelligence artificielle et cherche continuellement à perfectionner ses compétences. Sa rigueur ne se limite pas au domaine technique : il adopte une approche méthodique pour progresser aussi bien dans son travail que dans sa vie personnelle.  \n\nAmbitieux et tourné vers l’avenir, il accompagne ses équipes vers de nouveaux défis en mettant son expertise et son engagement au service de l’excellence.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "b75872d2-4d09-4ff5-81d3-e213f04a62cc",
		"lastname": "Dano",
		"firstname": "Héloïse",
		"imageProfilURL": "https://sessionize.com/image/c2bd-400o400o1-d2-4d09-4ff5-81d3-e213f04a62cc.4be0d54c-68b1-4640-94c6-383ccfb7e64c.jpg",
		"bio": "Ingénieure INSA Rennes de formation, Héloïse fonde ecologeek en 2021 pour sensibiliser et former au sujet du Numérique Responsable.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "a634e6f1-4c3f-482f-93e1-22008d97e0eb",
		"lastname": "Bétourné",
		"firstname": "Joffrey",
		"imageProfilURL": "https://sessionize.com/image/7269-400o400o1-EbXQcj3pt8Ymzb1NPvnCgS.png",
		"bio": "🪙 Aventurier du Code Perdu\n\nIndiana Jones du développement, je parcours les terres hostiles du front-end, explore les temples anciens du back-end et brave les dangers de l’infra.\n\nJ’ai traversé les contrées médicales, arpenté les ruines de l’immobilier et survécu aux télécoms, en suivant la carte secrète des méthodos agiles.\n\nJe taille la jungle du code legacy à coups de machette, déterre des bugs ancestraux et… déclenche parfois un piège en prod (sinon, où serait l’aventure ?).",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "bc34fdc8-be25-4c32-ae1d-9fd6f1905b02",
		"lastname": "Piscitelli",
		"firstname": "Thomas",
		"imageProfilURL": "https://sessionize.com/image/07b9-400o400o1-GTgK9yTSbpBF2WocTr9SaF.jpg",
		"bio": "Rennais de cœur et développeur passionné, j'ai  pu expérimenter le delivery dans un contexte d'ESN ou d'éditeur logiciel. J'aspire à mettre les équipes au centre des process afin de leur simplifier la vie et leur permettre de lever les différents freins qu'elles peuvent rencontrer. Je suis particulièrement intéressé par toutes les solutions permettant de favoriser la communication, la qualité de code, la sécurité applicative, la qualité des entrants, la gestion de la dette technique, le test...",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "88f16687-0ac9-4bb0-8c3d-72818ee7e5e6",
		"lastname": "Schepens",
		"firstname": "Yann",
		"imageProfilURL": "https://sessionize.com/image/c4e8-400o400o1-9r7oZhKEXJfYvVLhfx8oVx.png",
		"bio": "Originellement développeur PHP, je suis devenu avec le temps expert technique, Architecte, Évangéliste, Coach technique ; en résumé : Tech Lead.\n\nMes domaines de prédilection ?\n\n* La POO\n* L'automatisation\n* La qualité\n* Le process DevOps\n* Le coaching technique\n* Le PHP\n* Le Numérique responsable",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "20ae04be-db3a-4135-89b0-fab53afd8300",
		"lastname": "Louët",
		"firstname": "Christopher",
		"imageProfilURL": "https://sessionize.com/image/2411-400o400o1-WPtoB3nBvja8NnWDgsf4oT.jpg",
		"bio": "Ayant débuté ma carrière en tant que développeur, je me suis intéressé il y a quelques années à la philosophie et méthodoloigie DevOps, pour en faire mon métier il y a 5 ans.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "c0b9c265-b20a-4522-80e1-9a069d0c3c92",
		"lastname": "Fervel",
		"firstname": "Pierre",
		"imageProfilURL": "https://sessionize.com/image/b784-400o400o1-whjVTRPgo5Roiw3vY6w1Qh.png",
		"bio": "Je suis développeur Fullstack js / Java, avec 8 ans d'amour inconditionnel pour Angular.\nJ'ai déjà réalisé deux talks au sein même de mon entreprise, malheureusement jamais en externe. L'un était sur le développement de jeux vidéos en Godot Engine, l'autre sur l'utilisation des frameworks CSS.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	},
	{
		"id": "92a512c4-d0da-434e-b61d-8ff3c20bcce9",
		"lastname": "Gauffriau",
		"firstname": "Henri",
		"imageProfilURL": "https://sessionize.com/image/596e-400o400o1-UmbgJRB3KWjhT4qYRFFkJX.jpg",
		"bio": "Mouton transgénique issu d'un élevage de designer, j'ai vite préféré intégrer moi même les maquettes que je produisais. \nCurieux invétéré, j'ai joué avec tout ce qui passait à portée de mon clavier. Aujourd'hui expert accessibilité chez Onepoint, avec un furieux syndrome de l'imposteur, j'essaye de déplacer les mentalités vers ce qui me semble être  la voie.",
		"github": null,
		"googleplus": null,
		"twitter": null,
		"social": null
	}
]
