{
  "sessions": [
    {
      "id": "838332",
      "title": "Des Objets Élégants dans votre code",
      "description": "Depuis l’école jusqu’au monde de l’entreprise, nous avons trop souvent tendance à écrire du code dans le langage des ordinateurs. Nous nous satisfaisons d’un découpage de nos procédures sous forme d’objets. Il en résulte un amas d’instructions, de changement d’état et de structures de données qui devient trop compliqué à maintenir.\r\n\r\nLa promesse de l’approche orientée objet était pourtant d’augmenter la lisibilité et de faciliter la compréhension en modélisant plus facilement des structures complexes. Alors, qu’est-ce qui a mal tourné ?\r\n\r\nVenez remettre en question ce que vous savez des bonnes pratiques et réfléchir différemment : oubliez les méthodes static, les variables nullables, découvrez la magie de l’encapsulation, utilisez la richesse de vos propres mots dans votre code, … Nous partirons d’une codebase existante et y appliquerons ces principes pour la rendre plus lisible et maintenable grâce à des objets élégants.\r\n\r\nCes principes sont fortement inspirés du livre “Elegant Objects” de Yegor Bugayenko. \r\n\r\nPrévoyez un ordinateur avec votre IDE préféré, git et un environnement pour le langage suivant : Java 21+",
      "startsAt": "2025-06-25T10:00:00",
      "endsAt": "2025-06-25T12:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "619dcf9a-1762-4492-850c-78dc1bfe7f48",
        "5675dfb0-14be-4f96-ba1c-f36276ab030a"
      ],
      "categoryItems": [
        325283,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "826347",
      "title": "\"Mais qu'est ce qu'on va devenir ?\" - Le métier de dev passé au crible des scénarios de l'ADEME",
      "description": "Il est désormais acté que le numérique est une source non négligeable du dérèglement climatique actuel. Et lorsque l'on commence à creuser ce sujet, on finit souvent par se demander si nos métiers ont encore un avenir.\r\n\r\nDans son exercice de projection \"Transitions 2050\", l'ADEME a défini 4 scénarios pour atteindre la neutralité carbone d'ici à 2050. De la génération frugale au pari réparateur, venez découvrir ces différents scénarios et vous projeter dans chacun d'entre eux pour imaginer avec nous l'évolution de nos métiers et les adaptations qui seront nécessaires pour atteindre cet objectif. \r\n\r\nAprès avoir réfléchi en petits groupes sur les différents scénarios, nous effectuerons une mise en commun des conclusions. Et nous terminerons par un petit débat pour que chacun se positionne sur le ou les futurs qui lui semblent les plus désirables.",
      "startsAt": "2025-06-25T10:00:00",
      "endsAt": "2025-06-25T12:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "acbd55f3-0f40-493b-acbd-794c2c0457ea",
        "43bec2b4-a111-4260-b735-9f21eb6b63cf"
      ],
      "categoryItems": [
        325283,
        325295,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "869677",
      "title": "Dis papa, c'est quoi et ça se passe comment un audit d'applications ?",
      "description": "En tant qu'informaticiens (au sens large), développeurs en particulier, nous sommes régulièrement confrontés à avoir besoin d'expliquer aux génération plus jeunes et plus anciennes (après avoir réparé l'imprimante) notre métier.\r\n\r\nJe vous propose, au plus jeune et moins jeunes, de vous faire découvrir l'activité d'auditeur expert / architecte, mais non pas seulement ce que je fais moi, mais l'ensemble de la démarche et la systémique associée. Le talk restera majoritairement technique, fera l'objet de quelques démonstrations (scope sujet à acceptations clientes), et nous conserverons un temps d'expérimentations et d'échanges que je me proposerai de faciliter.\r\n\r\nQuel que soit votre profil, je vous promet que vous ressortirez de cette session avec de l'inspiration.",
      "startsAt": "2025-06-25T10:00:00",
      "endsAt": "2025-06-25T12:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "6da05a26-7eb6-4244-abba-350669a6cd11"
      ],
      "categoryItems": [
        325282,
        325283,
        325292,
        325300
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "834143",
      "title": "Enter the Daggerverse !",
      "description": "Si je vous dis Dagger ? Cela ne vous parle peut être pas. Si je vous dis... Docker ? Là, ça vous parle !\r\nDagger, c'est le moteur de CI/CD développé par Solomon Hykes, le papa de Docker. Un OVNI dans l'univers des moteurs de CI/CD, à la fois une alternative et un complément à Jenkins, Circle, GitHub Actions. Mais quid du Daggerverse ?\r\n\r\nLaissez nous vous embarquer dans ce nouvel univers, laissez nous vous faire tomber dans... le Daggerverse of madness !!\r\n\r\nDans ce talk, vous :\r\n\r\n- prendrez en main Dagger avec le langage de votre choix : Typescript, Go ou Python (et qui sait, Java ?)\r\n- découvrirez comment publiez votre propre module Dagger dans... le Daggerverse !\r\n\r\nVous découvrirez même comment en évitant le push and pray, vous augmentez votre productivité, votre satisfaction et réduisez votre impact énergétique.\r\nEt vous serez à tout jamais séduit par Dagger et son univers à part entière.\r\n\r\n------------------------------------------ Talk Reference (A des destination des organisateurs) ----------------------------\r\nDagger une technologie émergente, créée par le papa de Docker, fait de plus en plus parler d'elle, en conquérant de nouveaux adeptes régulièrement.\r\n\r\nNous souhaitons partager notre expérience en vous proposant un atelier de prise en main concret sur le cas d'usage de mise en place de Renovate sur un projet Github.\r\n\r\nDonné l'année dernière au Devfest 2024 de Nantes, nous avons consolidé l'autre grâce aux très bon retour reçus de la part des participants.\r\n\r\nEnrichi d'un débriefing avec l'équipe de développement de Dagger, l'atelier est disponible aussi en anglais.\r\nL'équipe de Dagger souhaite mettre en avant notre travail sur les réseaux sociaux d'ici fin Janvier.\r\n\r\nLien vers les slides: https://docs.google.com/presentation/d/1bHa-cYo7Zx8NpSf_aktVSY0f5nu_-NCoNISsI_4gDmg/edit?usp=sharing\r\nVous pouvez tester le lab (tout la procédure est présente dans le README) : https://github.com/jhaumont/enter-the-daggerverse\r\n\r\nCe codelab est déclinable en\r\n- Quicky (slides uniquement),\r\n- Codelab (slides + codelab),\r\n- Tools in action (codelab joué par le speaker)\r\n- Conference (slides + codelab joué par le speaker)",
      "startsAt": "2025-06-25T10:00:00",
      "endsAt": "2025-06-25T10:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b1974f5a-0a03-4079-abae-0f87145fb355",
        "c6761e22-8b14-473d-83db-7168e840e2cc"
      ],
      "categoryItems": [
        325282,
        325284,
        325285,
        325297,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "880963",
      "title": "1ere règle du code club : il est interdit de trop coder",
      "description": "Dans le monde du développement logiciel, on confond souvent efficacité et efficience. Pourtant, pousser les équipes à livrer toujours plus de fonctionnalités mène inévitablement à une explosion de la dette technique, une augmentation du stress des développeurs et, in fine, une baisse de la qualité.\r\n\r\nCe talk, vas permettre d'explorer pourquoi \"livrer plus\" ne signifie pas \"mieux\", et comment les métriques DORA offrent un cadre objectif pour mesurer et améliorer la performance des équipes tech. À travers des chiffres concrets et des anecdotes vécues, nous verrons comment repenser nos pratiques pour un développement plus efficient et plus performant.",
      "startsAt": "2025-06-25T10:00:00",
      "endsAt": "2025-06-25T10:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "572d908f-34f0-41b6-bdcb-ca54a5afac31"
      ],
      "categoryItems": [
        325282,
        325297,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879525",
      "title": "La réactivité et les signaux : démystifions la magie du frontend",
      "description": "Certaines choses dans l’univers resteront sans réponse, mais la réactivité et les signaux ne devraient pas en faire partie.\r\n\r\nDepuis plusieurs années, la réactivité (et son concept clé : les signaux) s’est imposée sur toute la scène frontend. Que ce soit dans Vue.js, Angular, React, Svelte, Solid, Qwik, ou Preact, ces notions sont partout. Pourtant, malgré leur popularité, il est souvent difficile de comprendre ce qui se cache réellement derrière les signaux.\r\n\r\nOn entend parler de tracking, de proxies, d’états dérivés, et même d’effects, mais… de quoi parle-t-on vraiment ? Comment ces mécanismes permettent-ils à des valeurs d’\"écouter\" et de réagir aux changements d’autres ? Quelle est cette \"sorcellerie\" qui met à jour nos interfaces en temps réel, simplement en assignant une nouvelle valeur à une variable ?\r\n\r\nDans cette session, plonge dans le monde fascinant (et parfois mystérieux) de la réactivité et des signaux. Ensemble, nous décortiquerons une bibliothèque comme Alien Signals, pour démystifier ces concepts et enfin comprendre la mécanique qui se cache derrière cette \"magie\" du frontend.",
      "startsAt": "2025-06-25T11:00:00",
      "endsAt": "2025-06-25T11:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d5411057-c78c-4144-97f5-20d81354268b"
      ],
      "categoryItems": [
        325282,
        325286,
        325300
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "883709",
      "title": "ProgramAtion in Franglais 🇫🇷🧑‍💻🇬🇧",
      "description": "Le naming et le cache invalidAtion, c'est hard. C'est especialement hard quand on est francophone, que l'on parle un approximatif anglais, que le bizness parle un mix des deux et que quasiment tous les languages de programAtion baignent dans l'anglais.\r\n\r\nAïe ave euh drime ! où le code est lisible et compréhensible par toutes les parties prenantes du projet, en se basant sur un langage omniprésent (Domain-Driven Design).\r\n\r\nUn anglo-américain vous révélera les ingrédients de la sauce secrète qu'il a affinée et optimisée au cours de ses 15 années de pratique en France.",
      "startsAt": "2025-06-25T11:00:00",
      "endsAt": "2025-06-25T11:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "89ef7dc8-3f4e-4680-b71f-b1ec0c5ad6e2"
      ],
      "categoryItems": [
        325282,
        325287,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889929",
      "title": "Bataille de l'IA",
      "description": "Atelier participatif en 2h pour découvrir les enjeux environnementaux et sociaux de l'IA générative. \r\n\r\nBasé sur le livre blanc de l'association Data for Good \"les grands défis de l'IA générative\" - les propositions du collectif Data for Good pour une IA générative plus responsable : un guide pour les utilisateurs, les artistes, les développeurs et décideurs. \r\n\r\nAtelier co-créé par les associations Latitudes et Data for Good.\r\n\r\n5 enjeux lié à l'IA générative à découvrir : \r\n1) Fiabilité (de l'information)\r\n2) Créativité (Propriété intellectuelle)\r\n3) Société (Réseaux et données personnelles)\r\n4) Biais (algorithmiques)\r\n5) Environnement",
      "startsAt": "2025-06-25T13:30:00",
      "endsAt": "2025-06-25T15:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b75872d2-4d09-4ff5-81d3-e213f04a62cc"
      ],
      "categoryItems": [
        325283,
        325294,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "881204",
      "title": "Quarkus & programmation réactive : quand la performance rencontre la sobriété 🍷",
      "description": "🌱💻 Dans cet atelier de 2 heures, alliant théorie et pratique, je vous propose de découvrir comment faire de Quarkus et de la programmation réactive un levier pour améliorer l'efficience de vos SI.\r\nAu programme :\r\n✅Les clés de l'efficience logicielle : Quels sont les leviers pour optimiser vos applications ? \r\n✅Introduction à Quarkus : Découvrez les caractéristiques de ce framework innovant, sa compatibilité avec les standards Java, et son intégration native avec Kubernetes et GraalVM.\r\n✅Programmation réactive en action : Explorez les concepts de la programmation réactive et apprenez à les mettre en œuvre avec Quarkus.\r\n✅Changement de paradigme : Identifiez les défis liés à la transition vers une approche réactive et découvrez des clés pour les surmonter.\r\n✅Impact sur l'efficience de vos développements : Analysez les bénéfices concrets de l'association Quarkus/programmation réactive en termes de performance, de consommation de ressources et de durabilité.",
      "startsAt": "2025-06-25T13:30:00",
      "endsAt": "2025-06-25T15:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "725af93f-5681-41af-acb9-80d7dbcd8c4e"
      ],
      "categoryItems": [
        325283,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "883823",
      "title": "Redécouvrir la coopération : Atelier de Mob Programming",
      "description": "Vous est-il déjà arrivé de rester bloqué·e, dans le doute devant un problème complexe, surtout lorsqu'un·e de vos collègues est absent·e ? De constater que votre équipe gère trop de tickets en parallèle et prend trop de temps pour délivrer de la valeur ? De vous impatienter pendant que votre code est relu et validé ?\r\n\r\nImaginez une équipe de développement où l'onboarding se fait à une vitesse fulgurante, et où la sécurité psychologique est le socle permettant à chaque membre d'apporter de la valeur et des idées, d'apprendre des autres et d'être écouté·e. Une équipe éliminant les silos d'information et améliorant la qualité du code produit. Ce n'est pas une utopie, c'est le mob programming !\r\n\r\nVous vous demandez comment une équipe entière peut coder ensemble sur un seul ordinateur ? Le mob peut être redoutablement efficace, joyeux et épanouissant, avec les bonnes pratiques. Et le mieux est de venir l’expérimenter par vous-même.\r\n\r\nRejoignez-nous pour un atelier immersif en partant d’un jeu vidéo pour continuer autour d’un exercice (kata) de code simple où vous découvrirez comment cette approche coopérative peut transformer votre matière de travailler. L'objectif principal de cet atelier n'est pas le code en lui-même, mais de vous faire vivre l'importance de la coopération et de la communication.\r\n\r\nQue vous soyez dev ou non, débutant·e ou confirmé·e, PC ou non, vous êtes toustes les bienvenu·e·s, même pour observer.",
      "startsAt": "2025-06-25T13:30:00",
      "endsAt": "2025-06-25T15:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "09ba1352-1b84-4ecf-9216-26ec8c345d2d",
        "a077b0b1-30b9-42b2-aabb-cf207b0ad01b"
      ],
      "categoryItems": [
        325283,
        325287,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "860353",
      "title": "HTMX, ou le retour de l'AJAX dans le développement Web",
      "description": "Et si l'avenir pouvait se conjuguer au passé ?\r\nLoin de l'obésité du développement Web contemporain, où chaque framework se sent obligé de réinventer sa roue tous les six mois,\r\nLoin de l'obsession de la «SaaS»-isation qui contamine désormais les architectures front, où des entreprises se sentent investies de la mission d'héberger, encadrer, voire guider l'évolution même des frameworks,\r\nHTMX apparaît comme une bouffée d'air fraîche, revenant aux fondamentaux du Web qu'on a tant chéri !\r\n\r\nEn effet, cette librairie a pour simple mais noble ambition de remettre au centre du développement Web le protocole HTTP, et notamment le pattern de la récupération asynchrone (via Javascript), de morceaux de HTML, afin de peupler les pages. Oui, on va causer, à nouveau, d'AJAX !\r\n\r\nDans une logique unixienne (« Faire une seule chose, mais le faire bien »), HTMX propose de revenir à un développement sain d'esprit dans lequel l'état est géré côté Serveur, le Front n'est là que pour présenter les données, et les composants sont de simples fragments d'HTML.\r\n\r\nMêlant HTMX, WebComponents, et Rust, j'ai créé un PoC qui va chambouler votre manière de percevoir le développement Web, et de le rendre, je l'espère, fun !",
      "startsAt": "2025-06-25T13:30:00",
      "endsAt": "2025-06-25T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c40b8778-e2a5-4824-a755-72ceaa12070d"
      ],
      "categoryItems": [
        325282,
        325286,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "871686",
      "title": "Le DDD, c’est compliqué ? Attendez de mal l’appliquer !",
      "description": "Le Domain-Driven Design est porteur de nombreuses belles promesses: un code propre, évolutif, maintenable. Une vraie collaboration entre équipes de développement et experts métiers. Convaincu par toutes les conférences que j’avais vu sur le sujet, j’ai sauté le pas: j’ai dit à mon équipe qu’on se lançait dans le DDD !\r\n\r\nAssez rapidement, l’enthousiasme des premiers commits a laissé sa place aux difficultés. Incompréhension des concepts, résistance aux changements, perte de vitesse, complexité supplémentaire. La promesse d’un code plus clair et aligné avec le métier s’est transformé en aventure semée d’embûches, de petites victoires et de défaites.\r\n\r\nDans cette conférence, j’ai envie de vous partager ce que j’ai appris de cette expérience: Qu'avons-nous réussi ? Où a-t-on échoué ? Quels signaux d’alerte ont été ignorés ? Comment mieux aborder cette transition ?\r\n\r\nSi vous vous intéressez de près ou de loin au DDD et que vous pensez l’introduire dans vos équipes, ce retour d’expérience vous donnera quelques clés pour éviter les pièges et maximiser vos chances de réussite. Et peut-être toucher du bout des doigts cette promesse d’une base de code saine !",
      "startsAt": "2025-06-25T13:30:00",
      "endsAt": "2025-06-25T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "07cd0dc2-1db7-48e4-adb7-4f295d13c3ae"
      ],
      "categoryItems": [
        325282,
        325289,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "843830",
      "title": "Décodons nos pipelines : comprendre pour mieux déployer",
      "description": "Dans le monde accéléré du développement logiciel, il est facile de négliger un aspect crucial : la compréhension approfondie de ce qui se passe réellement dans nos pipelines CI/CD.\r\n\r\nDans cette conférence, je vous propose de réaliser une décomposition détaillée des différentes phases et composantes d’un pipeline CI/CD typique. Nous explorerons en profondeur les techniques pour éliminer les goulots d'étranglement, intégrer la sécurité dès les premières étapes et mettre en place des stratégies d'automatisation intelligente.\r\n\r\nÀ travers des démonstrations pratiques et des études de cas réels, vous acquerrez les connaissances nécessaires pour décoder et maîtriser vos pipelines de déploiement, vous permettant ainsi d'optimiser vos processus et de garantir des déploiements plus rapides, plus sûrs et plus fiables.",
      "startsAt": "2025-06-25T14:30:00",
      "endsAt": "2025-06-25T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "20ac8a46-1f84-4873-81fa-5907968cc03e"
      ],
      "categoryItems": [
        325282,
        325297,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889757",
      "title": "Rendre ses tests concis et évolutifs grâce à JUnit 5 & cie",
      "description": "Après avoir développé une nouvelle fonctionnalité, on passe souvent par une phase de refactoring pour essayer de trouver une meilleure implémentation. Mais peut-être qu’on oublie parfois d’améliorer aussi les tests ?\r\n\r\nUne fois écrits, ces tests serviront non seulement à détecter de potentiels bugs, mais aussi à documenter un comportement et à apporter de la confiance à l’équipe lors des développements suivants. Pour remplir ces fonctions cruciales, une suite de tests doit être lisible, compréhensible, rapidement exécutable, et doit pouvoir être enrichie le plus simplement possible.\r\n\r\nVoyons comment tirer parti d’outils tels que JUnit 5, AssertJ ou Spring Test pour atteindre ces objectifs !",
      "startsAt": "2025-06-25T14:30:00",
      "endsAt": "2025-06-25T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5ab0d7c3-da8a-4adf-9e13-58aaa7a9fa32"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "845703",
      "title": "Vous pouvez venir à cet atelier les yeux fermés",
      "description": "La navigation sur les sites internet à l'aide d'un lecteur d'écran comment ça marche ?\r\n\r\nComment \"voit-on\" un site sans le voir ?\r\n\r\nQuels sont les problèmes rencontrés par les utilisateurs de lecteurs d'écrans et surtout, comment faciliter cette navigation et éviter de faire un site inutilisable pour certains.\r\n\r\nAu programme :\r\nInstallation et prise en main d’un lecteur d’écran,\r\nApprentissage des principales commandes pour naviguer efficacement,\r\nIdentification et correction des principaux problèmes rencontrés,\r\nDécouverte des lecteurs d’écran sur mobile (Android et iOS).\r\n\r\nPré-requis :\r\nLes participants devront venir avec un ordinateur (Windows, Mac ou Linux pour les plus aventureux) ainsi qu’un casque audio.",
      "startsAt": "2025-06-25T16:00:00",
      "endsAt": "2025-06-25T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "62a808c7-fc60-4861-a67a-0faf19b410fd",
        "92a512c4-d0da-434e-b61d-8ff3c20bcce9"
      ],
      "categoryItems": [
        325283,
        325286,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893338",
      "title": "Démystifions nos clean architectures",
      "description": "Ces dernières années, les pratiques de développement ont largement évoluées.\r\nDe Clean Code aux outils issus du Domain Driven Design, l'organisation de nos applications s'est complexifiée, laissant sur le bord de la route un certain nombre de développeurs.\r\n\r\nD'un autre côté, les languages comme Java, les frameworks comme Spring ou certaines librairies de l'écosystème améliorent la prise en compte de ces grands principes \"by design\" pour nous permettre de les mettre en œuvre.\r\nSi vous êtes familier avec ces principes de Clean Architecture ou d'architecture hexagonale, il est probable que vos yeux saignent à la vue de bon nombre d'implémentations pour de multiples raisons !\r\n\r\nNicolas, Thomas et Yann vous proposent de reparcourir les différents concepts de ces architectures et pratiques afin d'identifier les impacts sur notre code, et peut être aussi certains mélanges douteux.\r\nEnrichis d'exemples de pratiques douteuses, voire incomplètes, ils vous proposeront également de voir comment les éléments de l'écosystème Java/spring peuvent répondre à certains paradigmes de ces architectures en facilitant leur utilisations pour le plus grand nombre.",
      "startsAt": "2025-06-25T16:00:00",
      "endsAt": "2025-06-25T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "df701232-56b1-4367-b009-d733c289dafe",
        "1b42c774-b49f-4975-ade3-bdd4bb6e0f93",
        "88f16687-0ac9-4bb0-8c3d-72818ee7e5e6"
      ],
      "categoryItems": [
        325283,
        325289,
        325300
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "831585",
      "title": "Sortir des ORMs avec jOOQ",
      "description": "Hibernate, Entity Framework, JPA… Ça fait maintenant des décennies que les ORMs sont parmi nous. En tant que dev, bien souvent, on sait s’en servir, mais ce qu’il y a derrière, c’est un peu un mystère. C’est pratique, ça fait gagner du temps, mais cette magie a un coût qu’on paie bien souvent plus tard : requêtes complexes, mauvaises performances, comportements différents selon les contextes…\r\n\r\nEt pourtant, depuis plusieurs années, des alternatives comme jOOQ sont en train de prendre une place de plus en plus importante. Leur credo : on jette l'ORM a la poubelle et on revient à du bon vieux SQL, mais type safe.\r\n\r\nLors de cet atelier, nous travaillerons sur une application Spring / JPA, comme on en rencontre beaucoup, pour y intégrer jOOQ. Nous verrons comment nous sortir, étape par étape, de cette dépendance néfaste aux ORMs. Ce sera l'occasion de découvrir combien cela permet d'évoluer vers un code plus simple, plus standard, plus expressif. Et que ce n'est même pas compliqué.",
      "startsAt": "2025-06-25T16:00:00",
      "endsAt": "2025-06-25T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "619ba5cd-a12a-4526-9f1a-7b9dd816d6a3",
        "97bdf918-611b-4b36-bcf9-386f681602ba"
      ],
      "categoryItems": [
        325283,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879938",
      "title": "Management libéré : Et si votre collègue développeur.euse était votre manager ?",
      "description": "Dans beaucoup d’entreprises, le management est réalisé par les personnes de la direction ou du commerce dans un système pyramidal avec un nombre trop élevé de collaborateurs et collaboratrices suivi.e.s.\r\n\r\nCes managers sont-ils les plus à même de comprendre le quotidien des personnes qu’elles managent ? Ont-ils les moyens et le temps de les accompagner dans leur carrière ? \r\n\r\nChez Zenika, nous avons redistribué les cartes en déléguant le management aux consultantes et consultants sans lien hiérarchique. Objectif : Améliorer l’expérience managériale de toutes et tous.\r\n\r\nQu’en avons-nous retiré, quel est l’impact, et qu’avons-nous mis en place ?\r\n\r\nRetour sur une année de mie en oeuvre.\r\n",
      "startsAt": "2025-06-25T16:00:00",
      "endsAt": "2025-06-25T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "585544af-3f57-498c-b005-b5059bc5d595",
        "f3202151-93c0-41d1-8b02-4926f4adbe94"
      ],
      "categoryItems": [
        325282,
        325287,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "881309",
      "title": "🧹 Klean Code : Appliquer les principes du Clean Code en Kotlin",
      "description": "Kotlin est un langage moderne, concis et expressif, mais écrire du code Klean demande plus qu’une simple syntaxe élégante ! \r\nDans cette conférence, nous revisiterons les principes du Clean Code sous l’angle des spécificités Kotlin. Nous explorerons comment tirer parti des scope functions (let, run, apply, also, with) pour structurer notre code de manière fluide et éviter les effets de bord inutiles.\r\nNous verrons également comment les data classes, les sealed classes et les expressions idiomatiques de Kotlin nous aident à rendre notre code plus lisible, maintenable et évolutif. Enfin, nous mettrons en lumière les pièges à éviter pour ne pas transformer la concision de Kotlin en complexité cachée.",
      "startsAt": "2025-06-25T16:00:00",
      "endsAt": "2025-06-25T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "66462b24-0915-46c5-a5f2-834493f12c6c"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "883234",
      "title": "Booster le démarrage des applications Java : optimisations JVM et frameworks",
      "description": "À mesure que les applications évoluent et que la fréquence des déploiements augmente, l’optimisation du temps de démarrage devient essentielle pour garantir la performance, la scalabilité et la satisfaction des utilisateurs.\r\nCette présentation explore des stratégies avancées pour accélérer le démarrage des applications Spring Boot, allant des optimisations JVM et du garbage collection à l’utilisation de technologies émergentes comme Project Leyden d’OpenJDK et Spring AOT (Ahead-of-Time Compilation).Nous discuterons de la manière dont ces innovations peuvent transformer l’approche des développeurs face à la performance des applications, rendant les applications Java plus légères, rapides et efficaces. \r\nQue vous gériez des déploiements complexes sous Kubernetes, dans un datacenter on-premises ou même pour une meilleure expérience de développement, cette session vous fournira des outils et des techniques pour booster la performance de démarrage de vos applications.\r\n",
      "startsAt": "2025-06-25T17:00:00",
      "endsAt": "2025-06-25T17:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "e2d688bf-bd80-4227-937e-a38b9cc3a7ae"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882454",
      "title": "Détection d'anomalies avec Apache Flink et Apache Kafka",
      "description": "Dans cette session, nous allons explorer l'utilisation d'Apache Flink et Apache Kafka pour le traitement de flux de données afin de détecter des anomalies. \r\n\r\nNous nous concentrerons spécifiquement sur la fonctionnalité de Pattern Recognition d'Apache Flink, qui permet l'identification de schémas complexes dans des flux de données en temps réel.\r\n\r\nTout d'abord, aborderons les avantages de l'intégration d'Apache Kafka comme couche de stockage pour le traitement de flux de données avec Apache Flink.\r\n\r\nEnsuite, nous plongerons dans les détails de la fonctionnalité de Pattern Recognition d'Apache Flink, un outil puissant pour la détection d'anomalies. Cette fonctionnalité permet de définir des séquences d'événements attendus et de déclencher des alertes en cas de déviations ou d'occurrences particulières. \r\n\r\nNous pouvons par exemple définir des schémas d'événements et identifier des transactions frauduleuses en temps réel ou des anomalies dans des flux de données de capteurs IoT.\r\n\r\nNous illustrerons ces concepts à l'aide d'exemples concrets et de démonstrations pratiques. Enfin, nous discuterons des bonnes pratiques et des défis liés à la mise en œuvre de la détection d'anomalies en temps réel avec Apache Flink et Apache Kafka.",
      "startsAt": "2025-06-25T17:00:00",
      "endsAt": "2025-06-25T17:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3cef0ae9-f716-42f4-9a90-02ced19310d7"
      ],
      "categoryItems": [
        325282,
        325288,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879244",
      "title": "Indiana Jones et la Malédiction des Commons",
      "description": "La mise en place de commons au sein d'un SI est un réflexe assez commun, d'autant plus avec l'essor des Microservices. Ces librairies \"maison\" sont en effet bien pratiques pour mutualiser des comportements métiers ou techniques.\r\nL'objectif de cette conférence est de fournir une critique constructive sur le recours aux commons, de présenter leurs coûts plus ou moins cachés et de donner des conseils pour réduire au maximum ces coûts.\r\nEt pourquoi pas même de proposer une solution alternative pour adresser les problématiques auxquelles les commons tentent de répondre...\r\nCela ne semble peut-être pas évident au premier abord mais les commons sont un parfait support pour parler Software Craftmanship, architecture et même un peu IA ! \r\nLa réflexion autour de cette problématique s'appuiera sur un exemple en SpringBoot/Java mais peut se généraliser pour n'importe quel framework ayant recours à des mécanismes d'injection de dépendances.",
      "startsAt": "2025-06-26T10:30:00",
      "endsAt": "2025-06-26T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bc34fdc8-be25-4c32-ae1d-9fd6f1905b02"
      ],
      "categoryItems": [
        325282,
        325289,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": false
    },
    {
      "id": "874517",
      "title": "Le monde merveilleux des claviers mécaniques",
      "description": "Et si on regardait de plus près cet omniprésent bidule de vos journées sur l'ordinateur : votre clavier. Vous restez des heures devant sans vraiment y prêter attention, alors qu'il est un élément central de votre confort et de votre efficacité.\r\n\r\nSuivez-nous et découvrez les \"claviers mécaniques\", qui, ayant le bon goût d'être hackables, font le bonheur de leurs propriétaires, qu'ils soient simples utilisateurs, honnêtes geeks, gamers invétérés, ou makers enthousiastes.\r\n\r\nSuivez-nous, et découvrez toutes leurs possibilités, laissez-vous guider dans le monde merveilleux des claviers mécaniques. Qui sait ? Vous pourriez y découvrir *LE* clavier qui changera à jamais votre vie/quotidien !",
      "startsAt": "2025-06-26T10:30:00",
      "endsAt": "2025-06-26T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "e5ebefc4-7a49-4cc6-95ed-28b1f8dfd6a2",
        "d8ecbdb8-a0df-4345-82e5-6df992636dc1"
      ],
      "categoryItems": [
        325282,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "881810",
      "title": "Systèmes distribués, pour le meilleur et pour le pire",
      "description": "Les solutions que nous concevons sont de plus en plus complexes. Elles mettent en œuvre différents systèmes que nous appelons des systèmes distribués. Sur le papier, les systèmes distribués ont plein de vertus. Mais il faut savoir que la production peut rapidement vous ramener à la triste réalité : ce n'est pas aussi magique que ça en a l'air.\r\nAu travers d'un retour d'expérience de nombreuses années, nous explorons donc ensemble le monde des systèmes distribués afin de comprendre pourquoi mettre en place un système distribué. Découvrons également les difficultés auxquelles il faut se préparer et comment s'en prémunir ou, tout du moins, les mitiger.\r\nCette session sera l'occasion d'évoquer de nombreux modèles de conception à travers le prisme de \"leçons apprises\". Dans le but de ne pas commettre les mêmes erreurs que d'autres ont déjà faites.",
      "startsAt": "2025-06-26T10:30:00",
      "endsAt": "2025-06-26T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f0679a02-6e5e-4a58-9f1e-322ed6d69ff0"
      ],
      "categoryItems": [
        325282,
        325289,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882642",
      "title": "HTTP/3 : 36 ans d’histoire du protocole HTTP",
      "description": "Depuis la création du protocole HTTP en 1989, le web a connu plusieurs transformations majeures. \r\nDans cette conférence, j’explore l'évolution de ce protocole clé, en mettant en lumière les avancées qui ont permis d'améliorer la performance, la sécurité et les fonctionnalités d'Internet. \r\nDe HTTP/0.9 à HTTP/3, découvrez comment ces innovations du protocole ont façonné le web moderne (exemples pêle-mêle : Gmail, Netflix, Zoom, Discord, Slack, les applications PWA, Gaming, etc …)",
      "startsAt": "2025-06-26T10:30:00",
      "endsAt": "2025-06-26T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "84071a95-0399-4c8a-a43d-ad8dec77a7cc"
      ],
      "categoryItems": [
        325282,
        325284,
        325286,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "881416",
      "title": "Développeurs, votre code façonne le monde de demain !",
      "description": "Développeurs, il est temps d'agir pour notre planète !\r\n\r\nLes catastrophes climatiques se multiplient, et il est plus que jamais crucial de passer à l'action dès maintenant. En tant que développeurs, nous avons le pouvoir de contribuer significativement au secteur numérique.\r\nActuellement, le secteur du numérique représente environ 4 % des émissions de carbone (selon l'ADEME), mais les prévisions montrent une augmentation rapide dans les mois et années à venir, en partie à cause de l'essor de l'IA.\r\n\r\nAlors, que pouvons-nous faire pour mettre à profit nos compétences techniques et passer à l'action ?\r\nJe vous invite à découvrir \"Creedengo\" (anciennement \"EcoCode\"), un outil Open-Source disponible depuis 2019. Cet outil propose un ensemble de bonnes pratiques de Green Coding adaptées à divers langages de programmation.\r\n\r\nParticipez à une démo-live pour comprendre comment fonctionne cet outil et comment, en tant que développeurs, nous pouvons adopter et promouvoir ces bonnes pratiques, partagées par une vaste communauté de développeurs et d'entreprises.\r\n\r\nEnsemble, faisons la différence ! \r\n",
      "startsAt": "2025-06-26T10:30:00",
      "endsAt": "2025-06-26T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d64fba44-b0b8-4281-bb00-b96f24767244"
      ],
      "categoryItems": [
        325282,
        325295,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "875686",
      "title": "“Make the change easy” : Apprivoiser le legacy avec les Object Calisthenics",
      "description": "Avez-vous déjà ouvert un fichier de code legacy et eu l’irrésistible envie de refermer votre IDE ? Rassurez-vous, on a toustes vécu ça ! Mais si on vous disait qu’avec quelques règles simples, ce code peut devenir plus lisible, maintenable et même plaisant à faire évoluer ?\r\n\r\nLa programmation orientée objet, c’est “easy to learn, hard to master”. Dans cette session, nous vous embarquons dans une session de pair programming en live, où nous appliquerons les Object Calisthenics : 9 règles conçues pour muscler votre code et le rendre plus modulaire. À partir d’une base legacy en Kotlin, nous ferons ensemble un refactoring incrémental pour la transformer en un code robuste, élégant et facile à maintenir.\r\n\r\nAu programme : du fun, du refactoring, et des astuces concrètes, avec en tête la maxime de Kent Beck : “Make the change easy, then make the easy change.”\r\n\r\nRepartez avec une envie irrépressible de rouvrir votre IDE et améliorer votre codebase.",
      "startsAt": "2025-06-26T11:30:00",
      "endsAt": "2025-06-26T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "09ba1352-1b84-4ecf-9216-26ec8c345d2d",
        "cf1c7638-d416-4fcb-800a-f364f419dfaa"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882411",
      "title": "L'ensaignement vu par la data 💉🩸",
      "description": "28 Juin 2024, je suis, avec Alex, devant vous pour jouer notre conférence sur Spring, un étrange bandage sur le bras.\r\nBandage résiduel de ma saignée du matin, la première d'une longue série que je vais enchainer hebdomadairement.\r\nLa question est pourquoi ? C'est le seul traitement pour la pathologie qui m'a été découverte fin 2023: l'hémochromatose, la première maladie génétique de France.\r\n\r\nToutes les semaines, je vais à l'hôpital réaliser une saignée et surtout, ce qui nous intéresse ici, récolter plein de données sur mon organisme.\r\n\r\nEt si on utilisait ces données pour refaire le tour de Kibana ?! Un outil présent partout mais qui reste obscur pour la plupart.\r\nKibana est l'application compagnon de la stack Elastic, qui permet de visualiser et de mettre en forme vos données grâce, notamment, à des dashboards.\r\nTrès régulièrement, on me demande un coup de main pour réaliser des choses assez simples dans Kibana, une recherche, une inspection, une visualisation.\r\nJ'ai souvent la réponse dans ma boîte à outils de trucs et astuces, l'idée est de vous en partager le max.\r\n\r\nVous avez envie d'en savoir plus ? Venez je vous explique tout ca en vous montrant des dashboards ca sera plus simple.",
      "startsAt": "2025-06-26T11:30:00",
      "endsAt": "2025-06-26T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "e6528c62-4131-49a4-b5e3-86c083cccc51"
      ],
      "categoryItems": [
        325282,
        325288,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "871684",
      "title": "Réinventer les masculinités, un chemin vers plus d’inclusion dans la tech",
      "description": "Moins de 20% de représentation féminine dans le secteur de la tech. Derrière ce constat, la discussion sur les problèmes de sexisme dans notre milieu met en lumière des mécanismes tels que la masculinité toxique, le patriarcat, la virilité dominante, les boys club, les privilèges, …\r\n\r\nOffrir un espace d’inclusion permettant à chacun et chacune de s’épanouir nécessite une compréhension de ces mécanismes que les hommes, consciemment ou inconsciemment, perpétuent.\r\n\r\nNous verrons comment ces schémas prennent place dans le milieu de l’informatique, et nous aborderons la nécessité de les déconstruire, tout en explorant les questions fondamentales : Déconstruire, mais pour aller où ? Comment les hommes peuvent-ils trouver leur nouvelle place ?\r\n\r\nÀ travers des exemples concrets et des bases théoriques, cette présentation proposera la réinvention des masculinités comme une étape cruciale pour accroître la présence des femmes dans la tech. Elle soulignera également que ces mécanismes, préjudiciables aux femmes, peuvent aussi avoir des répercussions néfastes sur les hommes.\r\n\r\nEnfin, elle proposera des pistes et des solutions pour entamer le chemin vers de nouvelles masculinités, notamment grâce à mon expérience personnelle au sein d’un groupe d’hommes qui cherche à redéfinir la masculinité collective.",
      "startsAt": "2025-06-26T11:30:00",
      "endsAt": "2025-06-26T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "07cd0dc2-1db7-48e4-adb7-4f295d13c3ae"
      ],
      "categoryItems": [
        325282,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "857012",
      "title": "Social Engineering ⚙, techniques de manipulation et influence : \"ça ne m'arrivera jamais !\" ?",
      "description": "Ne vous êtes vous jamais demandé pourquoi autant de personnes se font piéger par le phishing, les arnaques au CPF, au faux conseiller bancaire, au \"soit-disant\" conseiller mandaté par GRDF...\r\nMais d'ailleurs, qui serait assez idiot pour aller acheter des coupons PCS à la demande de son CEO ?\r\nPourquoi est-ce étrangement compliqué de refuser de donner à certaines associations lorsqu'elles vous abordent dans la rue?\r\nEt enfin, bien que l'on dise aux enfants de ne pas partager d'information à des inconnus sur internet, pourquoi y-a-t-il encore des informations terribles dans les journaux ?\r\n\r\nLa réponse est simple et tient au dénominateur commun de toutes ces histoires : l'influence et la manipulation.\r\n\r\nPersonne ne veut être manipulable et peu de personnes veulent en entendre parler, par peur ou crainte. Pourtant, c'est en démystifiant les techniques que l'on peut le mieux les comprendre et les analyser.\r\nAussi, je vous propose de plonger en ma compagnie dans ce monde intriguant, mêlant algorithmes, patterns et psychologie pour découvrir les techniques et outils du social engineering et de la manipulation. Vous pourrez ainsi mieux comprendre leur fonctionnement, les reconnaitre et surtout vous en défendre.\r\n\r\nSi Vis pacem, para bellum.",
      "startsAt": "2025-06-26T11:30:00",
      "endsAt": "2025-06-26T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b55331e8-3151-4604-9350-64d63a1693b3"
      ],
      "categoryItems": [
        325282,
        325296,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "883212",
      "title": "Ne laissez-plus traîner vos données de prod: anonymisez-les avec DbToolsBundle !",
      "description": "Avez-vous déjà injecté des données de prod en local ? Laissé traîner un backup de prod sur votre machine de dev ?\r\n\r\nVous êtes sans doute au courant des risques mais un workflow d'anonymisation est complexe à mettre en place et à maintenir. Et les performances ne sont pas toujours optimales.\r\n\r\nDbToolsBundle se propose de répondre à ces problématiques en facilitant la mise en place d'une anonymisation efficace des données sur vos projets PHP ou sur n'importe quelle stack Docker.\r\n\r\nEn plus de l’anonymisation, ce composant PHP fournit un outillage complet pour gérer votre base de données (sauvegarde, restauration, récupération de statistiques).\r\n\r\nVenez découvrir comment :\r\n\r\n- Intégrer le composant à vos projets.\r\n- Mettre en place un workflow compatible avec le RGPD pour cloner votre environnement de production.\r\n- Sauvegarder et restaurer une base de donnée.\r\n- Étendre DbToolsBundle avec vos propres anonymizers.\r\n\r\nNous vous montrerons aussi comment DbToolsBundle peut anonymiser 1 million de lignes en moins de 20 secondes à l'aide de requêtes SQL avancées !\r\n",
      "startsAt": "2025-06-26T11:30:00",
      "endsAt": "2025-06-26T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "124037c0-913b-4e2c-9fe8-9795990aa7ea",
        "e2b571e2-472e-42a1-9a1c-b3b9f542824f"
      ],
      "categoryItems": [
        325282,
        325286,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "828529",
      "title": "À la découverte du code golf",
      "description": "Qui a dit que coder ne pouvait pas être un sport ? Si les jeux vidéo ont droit à leur championnats, et que même les pros d'Excel ont des arènes pour en découdre, sachez que les devs ne sont pas en reste. Le code golf est une compétition où le but est de résoudre un problème grâce à un programme comportant le minimum de caractères. Et c'est tout un art. ",
      "startsAt": "2025-06-26T12:45:00",
      "endsAt": "2025-06-26T13:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "be291234-34e1-424f-8b4a-528ffd6c5338"
      ],
      "categoryItems": [
        325285,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879524",
      "title": "En JavaScript, il y a un paquet pour tout... et souvent pour rien.",
      "description": "Le petit module is-number totalise chaque semaine plus de 70 millions de téléchargements, tandis que des géants comme react plafonnent à seulement 25 millions. Surprenant, non ?\r\n\r\nMais ce raz-de-marée de dépendances dépassées n’est pas une fatalité. Un groupe de développeurs déterminés, connu sous le nom de e18e (Ecosystem Performance), s'est donné pour mission de rénover l’écosystème JavaScript : un paquet à la fois. Leur objectif ? Nettoyer, accélérer et optimiser l'écosystème JavaScript tout en aidant la communauté à réduire les dépendances inutiles.\r\n\r\nLe plus incroyable, c’est que toi aussi, tu peux contribuer à ce changement ! Que ce soit au sein de tes bibliothèques ou dans tes applications web, tu peux intégrer ces bonnes pratiques sans effort. Pour t’y aider, l’équipe e18e et la communauté ont conçu une panoplie d’outils :\r\nRègles ESLint\r\nPlugins Vite\r\nOutils pour CI/CD\r\n\r\nViens découvrir comment améliorer tes pipelines, réduire la taille de tes builds, simplifier la maintenance de tes projets, et même limiter la surface d’attaque de ton application. Rejoins-nous pour explorer comment rendre JavaScript plus propre, plus rapide et plus sûr !",
      "startsAt": "2025-06-26T12:45:00",
      "endsAt": "2025-06-26T13:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d5411057-c78c-4144-97f5-20d81354268b"
      ],
      "categoryItems": [
        325285,
        325286,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "835967",
      "title": "Comment merger sa PR en 10 secondes​ ? Avez-vous essayé les mob code review ?",
      "description": "Dans la plupart des équipes de développement les suggestions de code sont faites via des Pull (ou Merges) Request. Elles sont le lieu de discussions asynchrones pouvant prendre des heures voire des jours à se terminer. Des validations sont en plus nécessaires pour les merger ralentissant le rythme des releases de nouvelles fonctionnalités. \r\nCes échanges écrits peuvent également amener des incompréhensions et une communication violente qui peuvent dégrader la cohésion dans une équipe.\r\n\r\nPendant 2 ans, dans mon équipe, nous avons fait du mob code review avant de merger nos PR. Au lieu de les ouvrir et de faire des code reviews chacun de notre côté, nous nous retrouvions plusieurs fois par jour pour présenter et améliorer le code écrit. C’est comme cela que nous mergions nos PR en 10 secondes​.\r\n\r\nAprès vous avoir présenté ce concept, je vous expliquerai comment nous avons fait évoluer nos pratiques au fur et à mesure que l’équipe grandissait. Parmi elles, nous souhaitions aligner l’architecture et les standards de code, tout en ayant au sein de l’équipe, une bonne compréhension de l’application d’un point de vue fonctionnel ou technique.\r\nJe détaillerai les difficultés que nous avons rencontrées et les ajustements que nous avons mis en place, les avantages et les inconvénients que j’y vois, ainsi que les conditions nécessaires pour faire du mob code review.\r\n",
      "startsAt": "2025-06-26T12:45:00",
      "endsAt": "2025-06-26T13:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "60ee88c6-3fbd-4467-8388-dcb3069e6bc1"
      ],
      "categoryItems": [
        325285,
        325287,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892551",
      "title": "🔓 RFID, MIFARE, chambre d'hôtel et flipper0 : décryptage sans contact",
      "description": "Pas besoin d’être un génie du hacking ou de porter un sweat à capuche pour comprendre comment fonctionnent les badges MIFARE et autres périphériques RFID. Avec un peu de matériel – voire juste un smartphone – on peut en apprendre beaucoup… et faire bien plus que vous ne l’imaginez.  \r\n\r\nAlors, comment ça marche ? Quels sont les risques ? Et surtout, comment se protéger efficacement ? Si vous développez des produits utilisant ces technologies, quelques bonnes pratiques peuvent faire toute la différence.  \r\n\r\nPrêt à plonger dans les coulisses du RFID ? C’est parti. 🚀",
      "startsAt": "2025-06-26T13:05:00",
      "endsAt": "2025-06-26T13:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a93932b4-8308-4fba-b918-04467f3ca1b5"
      ],
      "categoryItems": [
        325284,
        325285,
        325296,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "885579",
      "title": "Le quantique, c'est fantastique !!",
      "description": "On parle de temps en temps de l'informatique quantique mais personne ne sait vraiment comment ça marche : qbits de spin, particule de Majorana, quantum annelling ou qbit de \"chat\"....\r\n\r\nNous allons essayer de faire un panorama des technologies existantes et en cours de R&D et des avancées déjà bien réelles et utilisable du domaine.\r\n\r\nN.B: promis aucun chat ne sera maltraité, enfin, on ne le saura seulement lorsque qu'on aura ouvert la boîte.",
      "startsAt": "2025-06-26T13:05:00",
      "endsAt": "2025-06-26T13:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b53d2e80-e297-4265-af4f-9623087d10d5"
      ],
      "categoryItems": [
        325285,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "887174",
      "title": "OSINT : L’art de trouver ce qui ne devrait pas être trouvé",
      "description": "Dans un monde où l’information est partout, savoir chercher est un pouvoir. L’OSINT (Open Source Intelligence) permet de collecter et d’exploiter des informations publiquement accessibles pour découvrir et croiser des faits .\r\n\r\nDans ce talk vous allez découvrir les bases de l'OSINT en explorant des techniques et outils pour exploiter des données publiques de manière stratégiques. Et enfin nous mettrons ces techniques en pratique lors d'une étude de cas.\r\n",
      "startsAt": "2025-06-26T13:05:00",
      "endsAt": "2025-06-26T13:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2e34a8ec-f173-4561-ad6e-0504cd1804a7"
      ],
      "categoryItems": [
        325285,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882291",
      "title": "Faire évoluer une application legacy sans (trop) souffrir",
      "description": "Félicitations, vous venez d'arriver dans votre nouvelle mission et on vous confie déjà la maintenance et l'évolution d'une des applications critiques de l'entreprise !\r\n\r\nMalheureusement, assez vite vous vous rendez compte qu'elle n'est pas dans un état brillant: plus personne ne sait vraiment ce qu'elle fait exactement ni comment elle fonctionne, la documentation a été mise à jour pour la dernière fois en 2017, il n'y a que 3 tests unitaires sur toute la code base et l'historique du développement n'a pas vraiment survécu à la migration SVN vers git... bref c'est du legacy et il a déjà eu raison de votre prédécesseur parti en burn-out !\r\n\r\nPour vous éviter le même sort, dans cette conférence, je vous propose de faire, en se basant sur un exemple réel en Java, un petit tour des techniques et outils permettant d'abord de comprendre et ensuite de reprendre la main sur un logiciel de ce type sans trop s'arracher les cheveux.",
      "startsAt": "2025-06-26T13:30:00",
      "endsAt": "2025-06-26T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "32398022-78ba-4385-8c4f-db0f8adf3395"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "891492",
      "title": "Repérer les requêtes lentes avant la prod",
      "description": "- T'as encore cassé la prod avec une requête lente ?\r\n- Oui, pourtant en local ça marchait nickel !\r\n\r\nC'est du vécu ? Alors venons en parler.\r\n\r\nAprès avoir révisé ensemble les principales manières d'accéder à la donnée dans une base PostgreSQL, nous verrons comment repérer les sequential scans et les index scans qui posent problème, avant d'arriver en production. Et nous verrons aussi des stratégies concrètes pour remplacer des sequential scans en index scan.\r\n\r\nPour nous aider dans cette quête, une extension PostgreSQL mystérieuse sera utilisée.",
      "startsAt": "2025-06-26T13:30:00",
      "endsAt": "2025-06-26T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "19d8ff26-d4a1-4a0c-bd0e-33946f4e3772",
        "e4973b28-502d-44b2-bff4-ca25f11b5c38"
      ],
      "categoryItems": [
        325282,
        325288,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "828525",
      "title": "Et si on parlait de \"malware craftsmanship\" ?",
      "description": "Derrière cette expression aux faux airs de buzzword, se cache un constat : les caractéristiques d'un bon logiciel malveillant ne sont pas forcément celles que l'on a l'habitude de préconiser pour le développement de nos produits. \r\n\r\nSi leur objectif final peut varier (exfiltration d'information, destruction de systèmes, chiffrement de données à des fins d'extorsion...), les logiciels malveillants ont bien une contrainte commune : parvenir à leurs fins sans se faire prendre. \r\n\r\nAu travers de la création d'un \"pseudo-virus\" inoffensif, nous vous présenterons quelques techniques de développement de malware utilisées pour contourner les outils de détection, avant de nous mettre dans la peau d'un analyste et de disséquer le résultat !",
      "startsAt": "2025-06-26T13:30:00",
      "endsAt": "2025-06-26T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "be291234-34e1-424f-8b4a-528ffd6c5338",
        "cb7ebb0e-3ef1-4d2c-8a2b-96d38131a3e8"
      ],
      "categoryItems": [
        325282,
        325296,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882176",
      "title": "Mais pourquoi je me ferais ch**r avec l'accessibilité ?",
      "description": "    \"C'est vrai quoi, j'en ai à peine fini avec la RGPD qu'on me file un nouveau projet inutile : remettre mon produit aux normes d'accessibilité. Ça fait un an qu'on est dessus, et il faut repasser partout. Ça va nous coûter un pognon de dingue cette affaire, et tout ça pour trois personnes qui ne peuvent pas naviguer sur mon site !\"\r\n\r\n    On vous dit souvent comment rendre vos produits accessibles, on vous dit souvent qu'il faut les rendre accessibles, on vous parle vaguement de quelques normes, de quelques personnes qui ne peuvent pas naviguer sur votre site, mais on vous explique rarement pourquoi.\r\n\r\n    C'est ce que je vais faire dans cette conférence. Je vais vous expliquer en trois grands axes très différents pourquoi vous devez rendre vos sites accessibles, et je vous promets que ça risque de vous donner très envie de vous pencher ensuite sur le \"comment\".\r\n",
      "startsAt": "2025-06-26T13:30:00",
      "endsAt": "2025-06-26T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "19305f56-33bc-4a09-a9fc-869ecbdbe498"
      ],
      "categoryItems": [
        325282,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "881405",
      "title": "Amusons-nous avec jj, une alternative à git !",
      "description": "Vous connaissez tous git, l'indétrônable gestionnaire de versions qui s'impose sans discussion pour tous les usages. Ou peut-être pas ?\r\nDécouvrons par la pratique jj, un nouveau gestionnaire de versions avec sa propre philosophie, et qui nous promet qu'il est à la fois plus simple et plus puissant que git !\r\njj propose moins de concepts et de commandes que git, mais les rend plus puissants. Par exemple, pas de staging area avec jj. Et un merge ou rebase n'échoue jamais, car les conflits sont un concept majeur de la philosophie jj. Vous pouvez même commit des conflits !\r\nEt en bonus, vous pouvez utiliser jj avec un dépôt git, avec des collègues qui continuent à utiliser git.\r\nAlors pourquoi ne pas découvrir jj ?",
      "startsAt": "2025-06-26T13:30:00",
      "endsAt": "2025-06-26T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "cffb1609-ea23-4fc2-9dfa-eb96e60f68c9"
      ],
      "categoryItems": [
        325282,
        325284,
        325292,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893286",
      "title": "Dapr : le secret pour des microservices sans migraines",
      "description": "Tout le monde adore les microservices. Sur le papier, on trouve pêle-mêle : livraisons plus rapides, équipes autonomes et qui se concentrent sur le métier plutôt que la technique...\r\n\r\nMais au fil du temps et mis à l’échelle, la situation devient difficile à gérer. Les exigences des ops grossissent : options d’intégration (gestion de certificats ou de service accounts), de robustesse (retries / circuit breakers), mise en place de métriques et tracing en tête.\r\n\r\nUne solution classique consiste à adopter des frameworks qui peuvent \"tout faire\" et à alimenter des boilerplates plus ou moins gargantuesques, accompagnés de templates de déploiement fruit de longues négociations entre dev et ops (sur chaque variable de configuration), et auxquels tout le monde doit se conformer.\r\n\r\nTout ceci rend le travail assez fastidieux et parfois déceptif, avec des devs sous l’eau face aux demandes des ops, et des ops qui perdent un temps précieux à configurer des frameworks au lieu de bichonner leur prod chérie.\r\nEt bien sûr, ça ne facilite ni l’adoption de nouveaux langages, ni l’adoption de nouvelles briques. Encore moins le changement de cloud...\r\n\r\nPour apporter des solutions à ces difficultés, Dapr propose une approche élégante et radicalement différente de tout ce que vous connaissez. Un sidecar ultra léger, accessible via API, qui déporte la gestion des intégrations, fournit des patterns classiques pour microservices, inclut métriques et tracing, et bien plus encore.\r\n\r\nÀ la fin de cette session, vous n’aurez plus qu’une seule envie : tester Dapr et retrouver les bienfaits des architectures microservices, sans subir leurs inconvénients !",
      "startsAt": "2025-06-26T14:30:00",
      "endsAt": "2025-06-26T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c7aad32d-e553-4cb4-889c-57cec629c798"
      ],
      "categoryItems": [
        325282,
        325284,
        325289,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882264",
      "title": "pre-commit, un framework pas que reservé aux développeurs !",
      "description": "Lorsqu'on utilise de l'Infrastructure-as-Code pour gérer et approvisionner une infrastructure, il est toujours intéressant d'améliorer la qualité du code et sa maintenabilité, en utilisant des linters et formaters.\r\nIl peut être nécessaire également de détecter des secrets et informations sensibles avant que ceux-ci se retrouvent dans ses dépôt git !\r\nEt si nous faisions tout cela avec le framework pre-commit, à partir d'un seul fichier de configuration ?\r\nEn introduction, nous verrons ce que sont les hooks git et le cycle de vie des commits.\r\nOn verra par la suite ce qu'est le framework pre-commit, et en quoi il va nous aider à mettre en place tous les outils qui vont nous permettre d'améliorer la qualité du code dans Ansible et Terraform.\r\nEnfin, on verra ce qu'il est possible de faire avec le framework pre-commit dans des pipelines Gitlab CI.",
      "startsAt": "2025-06-26T14:30:00",
      "endsAt": "2025-06-26T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "20ae04be-db3a-4135-89b0-fab53afd8300"
      ],
      "categoryItems": [
        325282,
        325284,
        325297,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882931",
      "title": "Quels identifiants pour vos bases de données en 2025 ?",
      "description": "Le choix de vos identifiants a un impact sur les perfs de vos BDD\r\n\r\nAujourd'hui on a tendance à utiliser des UUID mais sans connaitre les problèmes que cela peut poser ensuite.\r\nPeut-être que vous utilisez plutôt des ID séquentiels, mais dans ce cas là aussi cela peut amener des problèmes.\r\n\r\nPour cela on va regarder sous le capot des indexes de bases de données\r\n\r\nA la fin de ce talk, j'aimerais que vous repartiez en étant capable de faire un choix éclairé pour vos identifiants\r\n\r\nOn va parler B-tree +, UUIDv4, UUIDv7, ULID, ...",
      "startsAt": "2025-06-26T14:30:00",
      "endsAt": "2025-06-26T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "6029450b-fe28-4177-87fe-5c05c4bd5378"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "825531",
      "title": "Savez-vous vraiment ce qu’est la couleur ? Découvrez la science derrière les pixels 🎨",
      "description": "Si la couleur est souvent vue sous un angle créatif, c’est aussi une science qui peut expliquer certaines bizarreries : pourquoi les mêmes couleurs ont l’air plus saturées sur ma maquette Figma que sur ma page web ? Est-ce qu’il y a un rouge “plus rouge” que le rgb(255, 0, 0) ? Pourquoi le jaune paraît plus clair que le bleu à luminosité égale ?\r\n\r\nCes questions sont toutes liées à notre représentation des couleurs. Dans ce talk, je vous emmène dans un voyage à travers l’Histoire et les sciences pour comprendre, réellement, les codes couleur que vous utilisez dans vos applications.\r\n\r\nVous y découvrirez ce que sont les espaces de couleur (sRGB, P3…), les notations courantes comme RGB ou HSL, et en quoi elles peuvent être trompeuses. Vous verrez enfin comment les dernières notations OKLAB et OKLCH, plus fidèles à notre perception des couleurs, peuvent permettre par exemple de créer des gradients ou des palettes de couleur cohérentes beaucoup plus facilement !",
      "startsAt": "2025-06-26T14:30:00",
      "endsAt": "2025-06-26T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "83bf795b-c16c-4db3-909c-02197d773093"
      ],
      "categoryItems": [
        325282,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "871972",
      "title": "Visite guidée de la maintenabilité logicielle",
      "description": "Il faut toujours livrer plus vite et la dette technique s'accumule : \"Mais c'est normal, c'est l'entropie du code !\"\r\n\r\nVotre bouquin de thermodynamique n'aide pas vraiment ?\r\n\r\nPas de problème, je vous propose de faire un tour d'horizon de la maintenabilité logicielle, en partant de la dette technique et de l'entropie jusqu'aux modèles de maintenabilité.\r\n\r\nInstallez-vous confortablement, la visite démarre en 1968 avec la croisade de Dijkstra contre les instructions GoTo, nous ferons escale chez Manny Lehman et ses lois sur l'évolution des logiciels, puis nous flânerons au musée des modèles de maintenabilité pour terminer sur un bref état de l'art de la recherche.",
      "startsAt": "2025-06-26T14:30:00",
      "endsAt": "2025-06-26T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "1f221109-c45a-4149-8770-4610c595d52e"
      ],
      "categoryItems": [
        325282,
        325287,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "883713",
      "title": "🧑‍🎤🎸 La preuve de programme vous fera apprécier les tests",
      "description": "La pratique de Développement piloté par les tests (TDD) est formalisée depuis au moins 1999. La famille d'outils de test automatisé xUnit existe depuis 1998 et ne cesse de s'améliorer. Pourtant le test automatisé est encore perçu comme un poids pour les équipes de développement.\r\n\r\nPour aider à relativiser, je vous invite à découvrir le mode encore plus hard-core : la preuve de programme vérifiée. Dans une session de live-coding nous comparerons l'effort à faire pour tester et pour prouver un même algorithme. Eh oui, il existe des langages de programmation qui permettent d'énoncer un théorème sur un programme et d'en écrire la preuve, laquelle sera vérifiée par le compilateur 🤯\r\n\r\nVous repartirez avec les oreilles cassées, des neurones pétés, les doigts musclés et le système vacciné.",
      "startsAt": "2025-06-26T16:00:00",
      "endsAt": "2025-06-26T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "89ef7dc8-3f4e-4680-b71f-b1ec0c5ad6e2"
      ],
      "categoryItems": [
        325282,
        325283,
        325290,
        325300
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "856457",
      "title": "Confidential Computing: une invasion de RATS",
      "description": "Comment Instagram et TikTok permettent aux chercheurs de croiser leur données sans jamais leur en donner l'accès ?\r\n\r\nComment n'autoriser une machine à rejoindre un parc que si et seulement si elle prouve qu'elle peut prouver son noyau compilé dans telle version, de telle manière, avec tels paramètres ?\r\n\r\nVoilà le genre de problématique diverse mais, on le verra, assez connexes, que cherche à résoudre le Confidential Computing.\r\n\r\nCe talk vise à présenter, à niveau fonctionnel, chacune des grandes problématiques proposées par ce champ émergent: les Trusted Execution Environnment (TEE), les architectures RATS, les TPM, les SMPC...\r\n\r\nL'auditeur en ressortira convaincu et informé qu'être conforme au RGDP est à portée de main, et qu'il est possible de travailler avec des Américains sans offrir les données de ses clients à Trump?",
      "startsAt": "2025-06-26T16:00:00",
      "endsAt": "2025-06-26T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3de0afa9-fb28-44cc-9492-131b07680cee"
      ],
      "categoryItems": [
        325282,
        325296,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893423",
      "title": "Montres Cardio-GPS : Mythes, Réalités et Technologie Décryptée",
      "description": "Les montres cardio-GPS sont devenues des compagnons incontournables des sportifs et des amateurs de suivi de santé. Mais comment fonctionnent réellement le GPS, l’altimètre, la mesure de la fréquence cardiaque, le suivi du sommeil ou encore le coaching intégré ? Entre promesses marketing et limitations technologiques, cette conférence vous propose une plongée dans les coulisses des capteurs et algorithmes qui analysent nos performances et notre bien-être. Objectif : comprendre pour mieux utiliser sa montre au quotidien !",
      "startsAt": "2025-06-26T16:00:00",
      "endsAt": "2025-06-26T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "294d6181-500c-4b0f-b609-e0a506ac3077"
      ],
      "categoryItems": [
        325282,
        325288,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889033",
      "title": "Pourquoi les clés de nos HashMap doivent être comparables ?",
      "description": "Avez-vous déjà entendu parler de déni de service (DoS) provoqué par une table de hashage ?\r\n\r\nVenez plonger avec moi dans les détails d'implémentation des tables de hashages pour créer ce déni de service et apprendre à s'en protéger !\r\n\r\nAu programme, tableau, chaînes, arbre binaires (pour le fun), bucket, et surtout hash, collisions et démos !",
      "startsAt": "2025-06-26T16:00:00",
      "endsAt": "2025-06-26T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f4d763bf-5395-4cb6-a1fc-9be2c6f40534"
      ],
      "categoryItems": [
        325282,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893095",
      "title": "Réveillez votre vieux smartphone Android et transformez le en machine de CI grâce à Jenkins",
      "description": "Saviez-vous que votre vieux téléphone Android pourrait être transformé en un agent Jenkins ? Les smartphones des dernières années ont des spécifications comparables à celles des ordinateurs monocartes, les rendant incroyablement puissants pour l'intégration et le déploiement continus. Dans cette présentation, vous apprendrez comment transformer votre téléphone Android en une instance Jenkins entièrement fonctionnelle, ouvrant ainsi un monde de possibilités pour le développement et les tests d'applications mobiles.\r\n\r\nNous commencerons par explorer les avantages de la réutilisation d'un vieux téléphone - de la réduction des déchets électroniques à l'économie d'argent sur du matériel coûteux. Ensuite, nous plongerons dans les détails techniques de la configuration de votre téléphone en tant qu'agent Jenkins, y compris les outils et logiciels nécessaires et la configuration optimale pour des performances optimales. Enfin, nous partagerons des astuces et des conseils pour tirer le meilleur parti de votre nouvelle instance Jenkins, notamment comment gérer les ressources et éviter les pièges courants.\r\n\r\nRejoignez-nous pour découvrir comment réutiliser, réduire et recycler votre vieux téléphone Android en un outil puissant pour le développement (sur) mobile !",
      "startsAt": "2025-06-26T16:00:00",
      "endsAt": "2025-06-26T16:55:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "54a59345-ced3-4447-bbf8-d3ce1bc1cec6"
      ],
      "categoryItems": [
        325282,
        325297,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893099",
      "title": "Sécuriser vos Pipelines GitHub Actions : Meilleures Pratiques et Stratégies",
      "description": "Dans un monde où les attaques de la chaîne d'approvisionnement logicielle sont de plus en plus fréquentes, sécuriser vos pipelines CI/CD est devenu une priorité absolue. Cette présentation se concentrera sur les meilleures pratiques et les stratégies avancées pour sécuriser vos pipelines GitHub Actions. Nous explorerons les vulnérabilités courantes, les menaces potentielles et les solutions concrètes pour les atténuer.",
      "startsAt": "2025-06-26T17:00:00",
      "endsAt": "2025-06-26T17:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "fecaaa02-e901-4689-97d9-48823e54efa0"
      ],
      "categoryItems": [
        325284,
        325296,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "885103",
      "title": "10 trucs et astuces à connaître avant de développer en Go",
      "description": "Depuis 13 ans que le langage Go existe en version stable, et plus de 10 ans qu'on le pratique quotidiennement ou presque, les bases sont restées les mêmes mais certaines façons de faire ont évolué… Du moins, avec le recul, certains éléments présentés comme indispensables au tout début ne nous semblent pas l'être tant que ça.\r\n\r\nOn souhaite s'adresser à vous, débutant dans le langage, pour vous faire un petit retour d'expérience de nos apprentissages : quels sont les concepts et outils à connaître, les conventions utiles à respecter, les inventions que vous pouvez ignorer… bref, on va essayer de vous faire découvrir le langage en vous faisant gagner du temps !\r\n\r\nEt si vous êtes plus expérimentés, venez confronter votre ressenti au nôtre, et le partager avec nous. Ce sera l'occasion de mettre nos pratiques en commun, et de s'améliorer les uns les autres.",
      "startsAt": "2025-06-26T17:00:00",
      "endsAt": "2025-06-26T17:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "947143cb-b22d-4c97-903c-d0cc05b5eb8b",
        "e143dcf9-e7d9-42a5-b18e-0ea35c307cf6"
      ],
      "categoryItems": [
        325284,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "887177",
      "title": "IA et désinformation : Affûtez votre bullshit detector !",
      "description": "À l’ère des IA génératives, la désinformation n’a jamais été aussi sophistiquée, rapide et virale. Deepfakes, fake news hyper-ciblées, clonage de voix… Comment distinguer le vrai du faux dans ce tsunami de contenus artificiels ?\r\n\r\nDans ce talk, nous explorerons comment l’IA amplifie la propagation du \"bullshit\" et les risques qu’elle représente pour l’information. À travers des exemples concrets, nous apprendrons à repérer les signes révélateurs des contenus truqués, à utiliser des outils de vérification efficaces et à adopter les bons réflexes face aux fake news.\r\n",
      "startsAt": "2025-06-26T17:00:00",
      "endsAt": "2025-06-26T17:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2e34a8ec-f173-4561-ad6e-0504cd1804a7"
      ],
      "categoryItems": [
        325284,
        325294,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879867",
      "title": "Apprend les langues à ton IDE avec LSP",
      "description": "Comment un environnement de développement apprend-il à fournir une assistance pour un langage spécifique ? Pourquoi un simple plugin suffit-il souvent à offrir un support complet pour un langage ou un framework ?\r\n\r\nIntroduit en 2016, le Language Server Protocol (LSP) s'est rapidement imposé comme un standard incontournable pour intégrer de nouveaux langages et technologies dans les IDE. Il a notamment révolutionné le support des langages moins répandus, l’intégration des outils d’analyse statique et même le développement de fonctionnalités avancées comme la complétion intelligente et la navigation dans le code.\r\n",
      "startsAt": "2025-06-26T17:00:00",
      "endsAt": "2025-06-26T17:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f7977f6a-ca50-40c6-b54f-b55db26cb0dd"
      ],
      "categoryItems": [
        325284,
        325285,
        325287,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889055",
      "title": "Tout plaquer et partir Fullstack Kotlin & HTMX",
      "description": "Backend & Frontend, Backendless, Fullstack ?\r\n\r\nSimplifiez vos développements web en réduisant les dépendances et en unifiant vos outils. Pourquoi multiplier les langages et frameworks quand une approche plus directe est possible ?\r\n\r\nAvec Kotlin & HTMX, découvrez une solution fullstack qui mise sur la clarté et l'efficacité, sans sacrifier la performance ni l'expérience utilisateur.\r\n\r\nAu programme, un live coding pour construire une application complète, illustrant comment cette combinaison peut rationaliser vos projets et offrir une alternative pragmatique aux stacks traditionnelles. Une invitation à repenser vos choix technologiques avec simplicité et cohérence.\r\n\r\nGarantie sans ligne de Javascript, d'HTML, de CSS ou de Spring.",
      "startsAt": "2025-06-26T17:00:00",
      "endsAt": "2025-06-26T17:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "66462b24-0915-46c5-a5f2-834493f12c6c"
      ],
      "categoryItems": [
        325284,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "881814",
      "title": "Guide de survie du contributeur git",
      "description": "Dans l'univers parfois impitoyable de `git`, il est facile de... perdre la tête, surtout face à un `detached HEAD`. Et quand tout semble perdu, la tentation de basculer du côté obscure de la force et faire un `push --force` devient trop forte. Ce \"Guide de survie\" vous apprendra à éviter ces pièges en vous guidant à travers les commits, merges et remotes. Avec des astuces concrètes pour gérer les conflits et récupérer votre travail, préparez-vous à maîtriser `git`, même dans les situations critiques. Que la force soit avec vous, mais attention au force push !",
      "startsAt": "2025-06-26T17:35:00",
      "endsAt": "2025-06-26T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f0679a02-6e5e-4a58-9f1e-322ed6d69ff0"
      ],
      "categoryItems": [
        325284,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893371",
      "title": "Traquez les memory leaks dans vos applications JavaScript !",
      "description": "Les fuites mémoire peuvent sérieusement impacter les performances de vos applications JavaScript. Découvrons ensemble les causes principales, les outils de diagnostic essentiels comme les DevTools de Chrome, et les meilleures pratiques pour les détecter et les résoudre efficacement. À travers des exemples concrets, nous apprendrons à optimiser la gestion de la mémoire et à maintenir des applications performantes.",
      "startsAt": "2025-06-26T17:35:00",
      "endsAt": "2025-06-26T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "aebf1399-c9c0-4dd7-a7c2-a3a65b71eed1"
      ],
      "categoryItems": [
        325284,
        325286,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "863307",
      "title": "Mockoon : Les bouchons contre-attaquent !",
      "description": "Être dépendant de web services externes est une contrainte quasi-constante sur des projets informatique. Que faire alors lorsque ces partenaires sont hors ligne ? \r\nDéveloppeurs mécontents, tests fonctionnels anéantis... Plus rien ne va et c'est souvent la panique !\r\nDécouvrez Mockoon, la solution open source idéale pour s'affranchir en quelques clics de toutes ces problématiques.\r\n \r\nDu plus simple endpoint REST à la désérialisation d'enveloppes SOAP pour l'écriture de règles personnalisées, en passant par la création de payload aléatoires, nous couvrirons un panel de solutions plus ou moins complexes à mettre en œuvre. Ma mission : vous permettre de reproduire le plus fidèlement possible le comportement de vos services externes.\r\n \r\nEnfin, nous découvrirons comment intégrer Mockoon dans un pipeline de CI/CD pour déployer simplement ces bouchons sur des environnements et permettre à vos testeurs de reprendre, enfin, leurs tâches !",
      "startsAt": "2025-06-26T17:35:00",
      "endsAt": "2025-06-26T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a73a5394-e90a-4d3d-bb13-dfd2b0fcb50b"
      ],
      "categoryItems": [
        325284,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889886",
      "title": "Gaming et Industrie : La Double Vie d'Unreal Engine",
      "description": "Découvrez comment Unreal Engine, l'un des leaders mondiaux du jeu vidéo et de la simulation, transforme non seulement le divertissement, mais aussi l'industrie. \r\nCes dernières années, le moteur de jeux d'Epic Games a fait des pas de géant, devenant un outil incontournable dans le domaine de la simulation en offrant des rendus ultra-réalistes et immersifs.\r\n \r\nImaginez simuler des environnements complexes, collaboratifs ou non, sans avoir à recourir à des équipements coûteux ou réels. Unreal Engine permet justement aux industriels de créer des simulations 3D réalistes, facilitant la prise de décision et l'optimisation des processus.\r\n \r\nL'un des principaux atouts de cette technologie réside dans sa facilité d'utilisation. Les novices peuvent rapidement se lancer dans le développement sans écrire une seule ligne de code grâce au \"Blueprint\", le langage visuel d'Unreal Engine.\r\n  \r\nAu programme :\r\n•\tIntroduction à Unreal Engine et son impact sur les jeux vidéo et les simulations industrielles\r\n•\tExploration des dernières évolutions du moteur\r\n•\tDémonstration des possibilités offertes par les Blueprints pour un développement sans code\r\n•\tExemples de rendus visuels impressionnants créés avec Unreal Engine\r\n \r\nCette présentation est destinée aux débutants et vous guidera à travers les principales fonctionnalités et innovations d'Unreal Engine. Rejoignez-nous pour découvrir comment cette technologie peut transformer vos projets et ouvrir des horizons nouveaux, que vous soyez développeur, industriel ou simplement curieux des nouvelles technologies. \r\n\r\n",
      "startsAt": "2025-06-26T17:35:00",
      "endsAt": "2025-06-26T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8852b645-beb0-4433-85f1-4a85c989a1ea"
      ],
      "categoryItems": [
        325284,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892604",
      "title": "Mieux écrire, mieux trouver : Diátaxis appliqué à la doc de plateforme",
      "description": "Bien documenter une plateforme interne, c’est essentiel… mais entre les contributions dispersées, les outils tiers déjà documentés, et les besoins variés des utilisateurs, structurer cette documentation devient vite un casse-tête. Heureusement, Diátaxis (https://diataxis.fr/) est venu à notre rescousse !\r\n\r\nChez PayFit, nous avons décidé de refondre entièrement la documentation de notre plateforme interne en adoptant cette méthodologie, avec un parti pris  : organiser chaque section (Tutoriels, How-To, Explications, Reference) autour des cas d’usage de la plateforme pour une approche 100% developer-centric. \r\n\r\nLe résultat ? De nombreuses identifications de doublons de documentation (!), une contribution plus fluide, une identification plus aisée des éléments manquants, et une meilleure navigation pour les utilisateurs de notre plateforme interne.\r\n\r\nDe la méthode Diátaxis en elle-même à la solution de rendu (du bon vieux mkdocs ? Un developer portal ? Un site dédié basé sur Astro/Starfish ?), en passant par quelque tips pour rendre la contribution à la doc moins rébarbative, ce talk vous donnera des clés actionnables pour rentre votre documentation plus utile et efficace !",
      "startsAt": "2025-06-26T17:35:00",
      "endsAt": "2025-06-26T18:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "9311189d-9779-44cf-b50c-700a4f4d6901"
      ],
      "categoryItems": [
        325284,
        325287,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893365",
      "title": "Reverse engineering d'un silent piano",
      "description": "En 2016, j'investissais dans un système silencieux pour piano acoustique me permettant de jouer à des heures indécentes sans déranger les voisins (à commencer par ma famille).\r\n\r\nJe m'étais promis de ne pas soulever le capot mais \"Oops, I did it again!\"\r\n\r\nAprès avoir exposé les motivations de la rétroingénierie d'un composant matériel de ce système, je vous ferai part du chemin emprunté pour en décrypter le fonctionnement et le réimplementer.\r\n\r\nCette présentation sera parsemée d'instants de démonstration pour retracer ensemble l'expérimentation et vous donner des clés qui m'auraient été particulièrement utiles au fil de mes découvertes.",
      "startsAt": "2025-06-27T10:30:00",
      "endsAt": "2025-06-27T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2cfe92bd-2140-4072-956d-73502aaeb90d"
      ],
      "categoryItems": [
        325282,
        325291,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "885510",
      "title": "Indiana Jones et le Temple Maudit d’Angular : 10 Ans d’Aventures et les Bonnes Pratiques en v19",
      "description": "Depuis presque 10 ans, Angular nous embarque dans une aventure épique. Entre réécritures, changements de paradigmes et évolutions majeures, le framework a connu plus de rebondissements qu’un film d’Indiana Jones. 🎩\r\n\r\nAvec la sortie d’Angular 19, il est temps de prendre du recul et d’explorer ensemble les grandes étapes de son histoire :\r\n- La quête des premiers frameworks front-end (AngularJS et le passage à Angular 2)\r\n- Les évolutions majeures qui ont tout changé (Ivy, Standalone Components, Signals)\r\n- Les pièges à éviter et les bonnes pratiques à adopter en 2024\r\n\r\n\r\n👨‍🏫 Objectif du talk :\r\nComprendre les grandes évolutions d’Angular et leurs impacts sur nos applications.\r\nDétecter les pièges classiques du framework (et comment les éviter !)\r\nMaîtriser les meilleures pratiques en v19 pour écrire du code performant, scalable et maintenable.\r\n\r\n\r\n🔥 Préparez-vous pour une aventure technique et humoristique… où vous serez le héros de votre codebase ! 🔥\r\n\r\n📌 Plan détaillé du talk\r\n1️⃣ Prologue : Indiana Jones, les frameworks et la jungle du web\r\n- Au début, il y avait jQuery… puis AngularJS arriva tel un artefact sacré.\r\n- Le passage d’AngularJS à Angular 2 : un reboot plus brutal que le crâne de cristal.\r\n- Depuis, chaque version nous rapproche du Saint Graal du framework parfait… mais le chemin est semé d’embûches.\r\n\r\n2️⃣ Les grandes pierres angulaires d’Angular : 10 ans d’évolution\r\n🔹 AngularJS → Angular 2 : La réécriture la plus violente de l’histoire du web\r\n🔹 Angular 4 à 8 : L’âge d’or et la stabilité\r\n🔹 Angular 9-12 : L’avènement d’Ivy et des performances optimisées\r\n🔹 Angular 13-17 : Adieu les NgModules ? Standalone Components, Signals… le futur est là\r\n🔹 Angular 18-19 : Ce qui change vraiment et pourquoi ça compte\r\n\r\n3️⃣ Angular : Les bonnes pratiques à adopter (et les pièges à éviter !)\r\n📌 Standalone Components : Pourquoi les NgModules sont en voie d’extinction (et comment s’adapter)\r\n📌 Signals vs RxJS : Nouvelle relique ou révolution durable ?\r\n📌 Optimisation des performances : Les coups de fouet à implémenter dès maintenant\r\n📌 Sécurisation des requêtes : Empêcher les méchants de venir voler vos trésors !\r\n\r\n4️⃣ Conclusion : Quel avenir pour Angular ?",
      "startsAt": "2025-06-27T10:30:00",
      "endsAt": "2025-06-27T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c0b9c265-b20a-4522-80e1-9a069d0c3c92"
      ],
      "categoryItems": [
        325282,
        325286,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "878221",
      "title": "Rendre son back générique grâce au pattern composite",
      "description": "Au cours de mes années universitaires, assis sur ces mêmes bancs d'amphithéâtre, j'ai découvert les différents patrons de conception. Contrairement à mes premières impressions, leur maîtrise ne se résume pas à seulement utiliser le singleton. J'ai eu l'opportunité d'approfondir certains d'entre eux par la suite, notamment le pattern composite.\r\n\r\nLe patron de conception composite, grâce à sa structure arborescente, peut sembler complexe au premier abord. Cependant, il excelle dans la simplification de systèmes intrinsèquement complexes, en offrant une grande généricité. Il n'est donc pas surprenant de le retrouver dans de nombreux outils que nous utilisons quotidiennement :\r\n - dans le front-end, le HTML, qui forme un arbre représentant le rendu du navigateur\r\n - dans les bases de données relationnelles, où la clause WHERE du langage SQL constitue un arbre définissant les conditions que doivent remplir les enregistrements pour être sélectionnés\r\n\r\nCette conférence vous permettra de découvrir le patron composite dans le contexte du développement back-end en Java. Dans la période actuelle, où il est demandé non seulement de développer des applications, mais parfois des \"plateformes\", utiliser le pattern composite peut être un atout majeur pour rendre vos solutions génériques et évolutives. Vous comprendrez pourquoi et comment le mettre en place, ainsi que les bénéfices de généricité que vous pouvez en tirer. Elle ne se limitera pas uniquement au patron composite, mais abordera également quelques variantes (comme le patron de spécification) et des patrons complémentaires (comme le visiteur). Seulement quelques variantes seront couvertes, car de fil en aiguille, il est possible de conclure qu'un programme informatique, en tant qu'arbre d'instructions, utilise le patron composite 🤯.",
      "startsAt": "2025-06-27T10:30:00",
      "endsAt": "2025-06-27T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "56865d7c-6ff0-4911-8d50-b2a276b9c7a5"
      ],
      "categoryItems": [
        325282,
        325290,
        325300
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893359",
      "title": "Le pouvoir des Bonnes Pratiques : Jouer la stratégie gagnante dans votre contexte mouvementé",
      "description": "Combien de fois avez-vous assisté à une réunion technique qui a dérapé à cause de désaccords sur les pratiques à adopter ? C'est précisément ce qui s'est produit lors de notre dernier atelier collaboratif de conception logicielle\r\n\r\nLa réunion avait pourtant bien commencé. Tous et toutes semblaient alignés sur la vision et la direction du projet, mais rapidement, les passions se sont déchaînées. Des injonctions désordonnées et plus ou moins sensées, se sont multipliées : \"Il faut coder en TDD !\", \"Nous devons livrer en prod cachée !\" ou encore \"Le COBOL est un langage d'avenir !\".\r\n\r\nNous voulons toutes et tous faire avancer le projet en valorisant les pratiques que nous savons pertinentes, mais les consensus sont difficiles à trouver et souvent, les discussions n'aboutissons qu'à de la frustration.\r\n\r\nEt si, au lieu d’appliquer des pratiques par habitude ou par contrainte, nous choisissions celles qui ont vraiment du sens pour nous ?\r\n\r\nEt que ce sont ces \"pratiques\" qui nous tiennent tant à cœur ? Pourquoi existe-t-il des \"bonnes pratiques' et d'autres pratiques ? Comment faisons nous pour les catégoriser ainsi ?\r\n\r\nDans cette présentation, nous répondrons à ces questions en apportant un regard objectif sur les pratiques, afin de vous donner les moyens de les valoriser auprès de vos collègues et de votre hiérarchie. Puis nous découvrirons des outils méthodologiques et visuels permettant de cataloguer et catégoriser vos pratiques, ainsi que des astuces pour embarquer votre équipe à les appliquer et suivre leur adoption dans votre contexte.",
      "startsAt": "2025-06-27T10:30:00",
      "endsAt": "2025-06-27T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "424a78bd-3b54-4063-8892-9a920fc3b044"
      ],
      "categoryItems": [
        325282,
        325287,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "857242",
      "title": "Le Fédivers et le protocole ActivityPub",
      "description": "Depuis quelques années, après plusieurs bad buzz chez les entreprises éditrices des réseaux sociaux qu'on utilise au quotidien, on entend beaucoup parler de Mastodon. Mais Mastodon n'est qu'un logiciel parmi d'autres, qui forment un ensemble plus large appelé le Fédivers.\r\n\r\nÀ travers cette présentation, je vous propose de faire un point de culture générale sur ce qu'est le Fédivers, quels en sont les composants, d'où vient-il... puis nous aborderons le sujet sous un angle un peu plus technique, en s'intéressant aux bases du protocole ActivityPub, le principal protocole sur lequel repose le Fédivers.\r\n\r\nCette conférence s'adresse aux personnes n'ayant aucune ou très peu de connaissances sur le protocole ActivityPub, et qui souhaitent découvrir le monde des réseaux sociaux décentralisés, libres, et indépendants de tout milliardaire instable.",
      "startsAt": "2025-06-27T10:30:00",
      "endsAt": "2025-06-27T11:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a90311bb-87bd-406b-bbd9-2a2c3e78b316"
      ],
      "categoryItems": [
        325282,
        325284,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879240",
      "title": "Modular monolith : la dernière croisade des architectures ?",
      "description": "La hype des Microservices s'essoufflant sérieusement, les équipes de développement sont à la recherche d'une alternative.\r\nModular monolith, appelé également modulith, se présente comme une architecture permettant de bénéficier du découplage fonctionnel vertical en évitant les couts importants des déploiements séparés.\r\nDans cette conférence, je vous propose 2 retours d'expérience sur le recours à spring-modulith pour permettre :\r\n->la rationalisation et refactorisation de 3 Microservices en une seule application\r\n->la refactorisation d'un monolithe existant pour permettre le découplage de 3 domaines distincts\r\nNe manquez pas cette conférence si vous êtes un architecte ou un Lead tech à la recherche d'une architecture pragmatique et scalable. Si vous êtes un développeur, découvrir en quoi cette architecture va vous simplifier la vie peut également vous intéresser…",
      "startsAt": "2025-06-27T11:30:00",
      "endsAt": "2025-06-27T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bc34fdc8-be25-4c32-ae1d-9fd6f1905b02"
      ],
      "categoryItems": [
        325282,
        325289,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "879095",
      "title": "☁️ 20 000 nuages sous les mers ☁️",
      "description": "Si l’Internet a dans l’imaginaire une portée aérienne, 5G, connectivité wi-fi, cloud, satellites… Plus de 99% du trafic mondial ne transite néanmoins non pas par les airs ou l’espace, mais bien via un réseau de câbles sous-marins à travers le globe.\r\n\r\nEnjeux de libre circulation de l’information, d’influence stratégique et de géopolitique, venez découvrir les dessous historiques des câbles sous-marins, les risques, et les défis actuels/futurs auxquels fait face cette industrie.",
      "startsAt": "2025-06-27T11:30:00",
      "endsAt": "2025-06-27T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "cef8c142-9b42-4d0a-b2dd-8fe32628f003",
        "524208b7-6f75-46aa-9f5a-9350e18cf178"
      ],
      "categoryItems": [
        325282,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "882174",
      "title": "On n’aurait pas oublié un truc dans le craft !?",
      "description": "J’ai mis en place du TDD, du BDD, et du DDD, de l’archi hexagonale, et j’ai suivi toutes les bonnes pratiques de “Pragmatic programmer”, et pourtant, mon application n’est pas utilisable. Pourquoi ? Qu’est-ce que j’ai pu oublier ?\r\n\r\nNous vous proposons de découvrir ensemble le chaînon manquant qui va rendre vos applications vraiment utilisables et utilisées, et en quoi cet élément mystérieux et a priori peu connu est en fait partie intégrante des pratiques craft.\r\n\r\nSpoiler Alert : on va parler A11Y",
      "startsAt": "2025-06-27T11:30:00",
      "endsAt": "2025-06-27T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "19305f56-33bc-4a09-a9fc-869ecbdbe498",
        "acbd55f3-0f40-493b-acbd-794c2c0457ea"
      ],
      "categoryItems": [
        325282,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "911393",
      "title": "Au coeur du phishing",
      "description": "Ca y est, comme tant d'autres, tonton Gérard vient de se faire pirater son compte en banque, perdant alors plusieurs milliers d'euros.\r\nMalgré les apparences, il suffit de peu de compétences techniques pour mener des attaques très rentables, alors piratons les pirates ! Je vous propose une plongée en eaux troubles pour découvrir leurs réseaux, leurs outils et leurs modes opératoires.",
      "startsAt": "2025-06-27T11:30:00",
      "endsAt": "2025-06-27T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f24b40fe-f430-46df-be2e-5fd2ee3d3b83"
      ],
      "categoryItems": [
        325282,
        325296,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "878985",
      "title": "Micro-Frontends Hypermedia avec HTMX",
      "description": "Les micro-frontends sont aujourd'hui sur toutes les lèvres : découper l'interface en modules autonomes, gérés par des équipes distinctes, offre une flexibilité et une scalabilité indéniables. Cependant, aller au-delà d'une séparation « page par page » peut rapidement introduire une complexité architecturale difficile à maîtriser.\r\n\r\nDans cette conférence, nous explorerons une approche basée sur HTMX pour implémenter des micro-frontends. L'objectif est de conserver l'essentiel des avantages – modularité, déploiement indépendant et collaboration multi-équipes – tout en éliminant une grande part de la complexité inhérente à ces architectures. ",
      "startsAt": "2025-06-27T11:30:00",
      "endsAt": "2025-06-27T12:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "72b906ad-1a5b-4110-8178-01698f9ceae6"
      ],
      "categoryItems": [
        325282,
        325286,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892554",
      "title": "Héberger son serveur mail en 2025 – et pourquoi c’est (presque) une mauvaise idée",
      "description": "Envoyer et recevoir des e-mails en 2025 ? Facile… si vous aimez les problèmes.\r\nDans cette session, on va décortiquer tout ce que vous devez savoir pour éviter de finir en “mailcheap. Problèmes de délivrabilité, joyeuses aventures avec les blacklistages, règles obscures des fournisseurs …\r\nEt si après tout ça, vous êtes toujours motivé… bienvenue dans le club des irréductibles. 😅",
      "startsAt": "2025-06-27T12:45:00",
      "endsAt": "2025-06-27T13:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a93932b4-8308-4fba-b918-04467f3ca1b5"
      ],
      "categoryItems": [
        325285,
        325297,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889943",
      "title": "Smartphonus adictus ?",
      "description": "Nous somme en l'an 18 après la sortie du premier I-phone, toute la France est équipée d'un smartphone. Toute ? Non ! 8 % irréductibles utilisateur.rices résistent encore et toujours à l'envahisseur ! Et leur vie n'est pas facile tous les jours...\r\n\r\nPeut-on se passer d'un smartphone aujourd'hui ? Retour d'expérience d'une femme de 35 ans qui n'en a jamais eu... trucs et astuces, tops et flops : vis ma vie sans smartphone ! ",
      "startsAt": "2025-06-27T12:45:00",
      "endsAt": "2025-06-27T13:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b75872d2-4d09-4ff5-81d3-e213f04a62cc"
      ],
      "categoryItems": [
        325285,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892780",
      "title": "Comment sont implémentés les containers sous Linux ?",
      "description": "Difficile de nos jours d'imaginer un monde sans containers. Les containers, de l'ancêtre LXC à Docker, Podman ou Containerd, sont bâtis sur deux élégants concepts du noyau Linux : les cgroups et les namespaces. Je vous explique tout cela, et je vous raconte au passage l'histoire d'une petite startup française qui a beaucoup contribué à leur développement.",
      "startsAt": "2025-06-27T12:45:00",
      "endsAt": "2025-06-27T13:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0c9b144a-3a48-4cb8-b9f9-84def47710c6"
      ],
      "categoryItems": [
        325285,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "893018",
      "title": "Aventuriers du runtime perdu",
      "description": "Deno c’est un nouveau runtime JS qui se veut ce que Node.js aurait du être dès le départ 😅\r\n\r\nIl propose de répondre à beaucoup des problèmes qu'on reprochait à son grand frère (Node.js). Mais il apporte aussi un soin attentif à l'expérience de développement pour fournir un environnement unifié, rapide et sécurisé pour coder nos applicatifs JS et Typescript.\r\n\r\nJe propose par des exemples concrets de montrer \r\n- où en est le projet aujourd’hui\r\n- comment est l'expérience de développement\r\n- pourquoi le projet est intéressant et quelles sont les perspectives concrètes pour Deno mais aussi pour l'écosystème NodeJS dans son ensemble",
      "startsAt": "2025-06-27T13:05:00",
      "endsAt": "2025-06-27T13:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0bef80c5-06bc-419d-98ab-dfe40311fb64"
      ],
      "categoryItems": [
        325285,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "883827",
      "title": "Back to the dev - Retour d'expérience",
      "description": "A 42 ans, je suis redevenu développeur après quelques années en tant que manager, PO, scrum master ou encore coach Agile.\r\nJe vous partage cette expérience de retour à ce métier passion, en quelques minutes, tout en vous proposant de prendre un peu de recul sur le métier de développeur-euse en 2025.",
      "startsAt": "2025-06-27T13:05:00",
      "endsAt": "2025-06-27T13:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c32ca426-2fdb-44c3-9fd6-7706f7720e77"
      ],
      "categoryItems": [
        325285,
        325292,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "852137",
      "title": "Comment rendre son code Java plus expressif et robuste avec le pattern matching ?",
      "description": "Le pattern matching, longtemps réservé aux langages fonctionnels comme Scala ou Haskell, est désormais un outil de premier ordre en Java depuis la version 21.\r\n\r\nEn combinant expressivité et simplicité, il révolutionne la manière d’écrire du code Java, notamment grâce à des structures modernes comme record et sealed class, ainsi qu’aux évolutions de instanceof et switch.\r\n\r\nDans cette présentation, nous découvrirons comment le pattern matching améliore la lisibilité du code et renforce sa robustesse face aux changements. Nous passerons en revue les types de données et les nouvelles syntaxes introduits récemment dans l’écosystème Java.\r\n\r\nPour ancrer ces concepts dans la pratique, nous explorerons un exemple concret : une fonction générant un message de salutation en fonction de l’état d’authentification d’un utilisateur.\r\nVous verrez comment le pattern matching simplifie la logique et élimine les pièges des structures conditionnelles classiques.\r\n\r\nAdoptez ces nouvelles possibilités pour écrire un code Java plus élégant, lisible et maintenable.",
      "startsAt": "2025-06-27T13:05:00",
      "endsAt": "2025-06-27T13:20:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a1a3a044-9414-4cc9-a12d-600d60bf0492"
      ],
      "categoryItems": [
        325284,
        325285,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "890887",
      "title": "Transformez votre \"Path-to-Production\" en Promenade de Santé",
      "description": "Le \"path-to-production\" est un itinéraire incontournable, mais souvent semé d’embûches pour les développeurs. Entre frustrations, complexité et imprévus, il peut rapidement devenir un véritable casse-tête.\r\n\r\nDans cette conférence, nous verrons pourquoi il échoue souvent lorsqu’il est réduit à une simple collection d’outils, sans vision d’ensemble. Nous explorerons les bonnes questions à se poser avant de concevoir un pipeline efficace, notamment :\r\n\r\n- L’organisation du flow Git\r\n- La gestion des dépendances pendant les tests\r\n- Le découpage stratégique des repositories\r\n\r\nRejoignez-nous pour prendre du recul sur vos pipelines et transformer votre path-to-production en une véritable promenade de santé !",
      "startsAt": "2025-06-27T13:30:00",
      "endsAt": "2025-06-27T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "50118cb3-17eb-4e55-a910-a94a5f83c28d"
      ],
      "categoryItems": [
        325282,
        325297,
        325299
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "827093",
      "title": "Comment compter les moutons sans perdre la mémoire",
      "description": "Quand on veut compter le nombre d'occurrences distinctes dans une collection, on n'a pas d'autre choix que de mémoriser tout ce qui a déjà été vu, au risque de faire exploser l'utilisation de la mémoire.\r\n\r\nNous allons implémenter ensemble un algorithme de comptage de mots distincts dans un texte, en espace mémoire (très) contraint, tout en maintenant des performances optimales. Cela sera rendu possible par l'utilisation d'un itérateur combiné à un algorithme probabiliste récemment inventé, à la fois simple à comprendre et très performant.\r\n\r\nL'implémentation sera réalisée en Go, pour illustrer la notion récente d'itérateur, mais sera accessible à tout le monde, le code étant simple et lisible.",
      "startsAt": "2025-06-27T13:30:00",
      "endsAt": "2025-06-27T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "e143dcf9-e7d9-42a5-b18e-0ea35c307cf6"
      ],
      "categoryItems": [
        325282,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "856962",
      "title": "API Security 2025 : Comment éviter de finir sur Have I Been Pwned ?",
      "description": "Les attaques sur les APIs explosent, et en 2025, les menaces sont plus sophistiquées que jamais. Entre vols de tokens, attaques par re-jeu et API key exposées sur GitHub, êtes-vous sûr que vos APIs ne finiront pas sur Have I Been Pwned ?\r\n\r\nDans ce talk ultra-concret et sans bullshit, on passe en revue les meilleures pratiques de sécurisation des APIs en 2025 :\r\n✅ OAuth 2.1 : Ce qui change (et pourquoi vous devez vous mettre à jour)\r\n✅ JWT, DPoP, mTLS : Stop aux mauvaises implémentations !\r\n✅ Zero Trust & API Gateways : Faut-il encore faire confiance aux clients ?\r\n✅ Démo live : Comment un token mal sécurisé peut tout casser\r\n\r\nQue vous soyez architecte, dev back ou expert en sécu, venez découvrir comment éviter la fuite de vos données... et votre prochain cauchemar en prod ! 🚀",
      "startsAt": "2025-06-27T13:30:00",
      "endsAt": "2025-06-27T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "57a0073c-0819-4cbd-ab19-d461605bb965"
      ],
      "categoryItems": [
        325282,
        325284,
        325296,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "832863",
      "title": "Le pattern Hive : une stratégie de modularisation pour votre monolithe modulaire ou vos microservice",
      "description": "Après une décennie, l'industrie réalise que des microservices mal conçus peuvent facilement se transformer en un monolithe distribué, encore plus problématique que le monolithe en spaghetti qu'ils visaient à résoudre. Pour remédier à ce problème, le concept de monolithe modulaire émerge comme une approche alternative.\r\n\r\nCependant, le défi reste de le scinder efficacement sans tomber dans le piège d'un système fortement couplé et rigide. Comment le modulariser correctement tout en gérant la complexité croissante de votre système ? Comment survivre au-delà de notre dette de modélisation et reprendre le contrôle ?\r\n\r\nDécouvrez le pattern Hive qui découple votre stratégie de déploiement - monolithe modulaire ou microservices - de la conception de votre logiciel, en adoptant le principe « Model Once, Deploy as you wish ». Ce pattern vous apportera une conception souple et évolutive, résiliente face aux défis changeants pour les produits existants ou en développement.\r\n",
      "startsAt": "2025-06-27T13:30:00",
      "endsAt": "2025-06-27T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bb3d9d1b-57f8-4e44-b487-a6e1492dd5d9",
        "e1e57fb8-830f-4542-b811-47c847e4a0b9"
      ],
      "categoryItems": [
        325282,
        325289,
        325300
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "885442",
      "title": "⚔️ Le code dont vous êtes le héros ou l’héroïne : +5 en agilité, +10 en fun !",
      "description": "Imaginez… Une équipe de devs aguerri·es, un royaume en proie au chaos technique, et une quête légendaire pour vaincre la dette legacy à coups de pull requests magiques. Votre CI est une arène. Vos tests, des sorts. Et chaque merge réussie vous fait gagner des points d'expérience.\r\n\r\nPartez à la découverte de la gamification appliquée au cycle de développement logiciel. À travers des retours d’expérience concrets (Sonar Smash, GitLab Achievements, et autres serious games), des mécaniques ludiques applicables dans vos routines d'équipe, et quelques mini-jeux surprises, nous explorerons comment transformer nos pratiques quotidiennes en véritables quêtes collaboratives.\r\n\r\nQue vous soyez une barbare du back-end 🪓, un ensorceleur tieffelin du front 🔮 ou une elfe multi-classée DruideOps 🌿, vous repartirez avec des idées concrètes, des ressources, et une furieuse envie de jouer.\r\n\r\nRejoignez l’aventure, héros et héroïnes du code ! 🎲",
      "startsAt": "2025-06-27T13:30:00",
      "endsAt": "2025-06-27T14:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "89cd5e0b-53e2-4f40-ae73-febf913ffd14"
      ],
      "categoryItems": [
        325282,
        325287,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "890806",
      "title": "Quand la téléradiologie ralentit : retour sur une quête d’optimisation",
      "description": "Convaincus d’avoir bâti une nouvelle version robuste de notre application (Angular, Django, Kubernetes, PostgreSQL), nous avons lancé la migration de tous nos clients…\r\nSans trop nous demander si l’infrastructure allait encaisser le choc.\r\n\r\nTout semblait rouler. Les semaines passent. Puis, soudain, la panique :\r\n🚨 \"C’est lent ! Ça rame ! On ne peut plus bosser !\"\r\n\r\nOn se connecte et… horreur ! Tout est figé. Piégés dans notre propre temple technologique, nous devons percer le mystère du goulet d’étranglement.\r\n\r\nChaque salle cache un défi, chaque artefact une énigme :\r\n\r\n🌪 La malédiction de Kubernetes – Une mauvaise répartition des ressources ?\r\n📶 L’épreuve du réseau – Un goulet d’étranglement invisible ?\r\n🔍 Le sortilège du front Angular – Un JavaScript qui s’emballe ?\r\n⚙️ Le piège du backend Django – Une surcharge insidieuse ?\r\n📜 Les parchemins de PostgreSQL – Des requêtes antiques et inefficaces ?\r\n\r\nSans carte ni boussole, nous avons fouillé logs et métriques, traqué l’ennemi caché et recomposé le puzzle des performances perdues.\r\n\r\n⚠️ Retour d’expérience sur cette aventure périlleuse, entre erreurs, surprises…\r\net précieuses leçons pour ne plus jamais déployer les yeux fermés.\r\nDécouvrez comment Graylog, Locust et Silk ont été nos reliques salvatrices !",
      "startsAt": "2025-06-27T14:30:00",
      "endsAt": "2025-06-27T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a634e6f1-4c3f-482f-93e1-22008d97e0eb",
        "3704c939-cf7e-4eb5-b27e-3c4adcc26849"
      ],
      "categoryItems": [
        325282,
        325287,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "889032",
      "title": "Le Data Mesh : Une réponse aux limites des architectures monolithiques pour vos données",
      "description": "Dans nos systèmes d'information, les architectures monolithiques traditionnelles montrent leurs limites face à la complexité croissante et aux besoin de flexibilité. Pour répondre à ces problématiques, des architectures visant des composants/applications plus petits et ciblant des périmètres métier bien précis voient le jour depuis plusieurs années.\r\n\r\nMais quand est-il de la données ? L'air du mono datalake où toutes les données sont centralisées dans un même endroit arrive t'il à sa fin ?\r\nDepuis quelques années, un concept émerge comme une réponse au même problématique des architectures monolithiques : Le  Data Mesh.\r\n\r\nCette présentation a pour but de donner un premier vernis sur les concepts proposés par le DataMesh, il est donc parfait tout type d'audience (développeur, architecte, data engineer).\r\nÉtant issu du pur génie logiciel et non de la Data, je ferais des parallèles entre les deux mondes avec des exemples concrets.",
      "startsAt": "2025-06-27T14:30:00",
      "endsAt": "2025-06-27T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "edd18d0c-feff-4709-9fdc-ce99a8795a74"
      ],
      "categoryItems": [
        325282,
        325288,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "852130",
      "title": "Le meilleur test, c'est celui qu'on n'a pas à écrire!",
      "description": "Qu’ils soient unitaires ou d’intégration, écrits avant ou après l’implémentation, les tests sont un passage obligé pour garantir la qualité du code.\r\nMais soyons honnêtes : écrire des tests n’est pas l’étape préférée de tous les développeurs.\r\n\r\nEt si l’on pouvait réduire le nombre de tests tout en reforçant la robustesse du code ?\r\n\r\nQu'on utilise un language à typage statique, comme Java, ou dynamique, comme Python, une grande partie des tests servent à gérer des cas limites : paramètres manquants ou null, valeurs incohérentes, etc...\r\nEt si jamais on utilisait judicieusement le typage des données pour rendre ces cas limites simplement impossibles? 🤔\r\n\r\nExplorons ensemble comment repenser le typage et la structure de nos données pour éliminer des tests \"garde-fous\".\r\nNous verrons, à travers des exemples concrets, comment des choix judicieux de typage et de structure peuvent éliminer des tests répétitifs tout en rendant le code plus sûr et plus simple à maintenir.\r\n\r\nL’objectif ? Vous donner des clés pratiques pour concevoir des systèmes plus robustes, quel que soit votre langage de prédilection.",
      "startsAt": "2025-06-27T14:30:00",
      "endsAt": "2025-06-27T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a1a3a044-9414-4cc9-a12d-600d60bf0492"
      ],
      "categoryItems": [
        325282,
        325290,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57579,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892405",
      "title": "Sécuriser son Code à l’Ère du DevSecOps : Outils et Stratégies Essentielles",
      "description": "Dans un monde où les cyberattaques se multiplient et où les failles de sécurité coûtent des millions, il est plus que jamais essentiel d’intégrer la sécurité dès les premières étapes du développement logiciel. Pourtant, la réalité est souvent différente : contraintes de temps, manque de sensibilisation, outils mal intégrés… Résultat ? Des applications vulnérables, des incidents critiques, et une dette sécuritaire qui ne cesse de croître.\r\n\r\nComment faire du DevSecOps une véritable force et non une contrainte ?\r\nCe talk propose une approche pragmatique et actionnable pour intégrer efficacement la sécurité dans le cycle de développement, en s’appuyant sur des outils éprouvés et des bonnes pratiques concrètes.\r\n\r\nPourquoi assister à cette session ?\r\n🔹 Comprendre l’importance d’un DevSecOps efficace : Quels sont les risques réels et les conséquences d’une approche négligée ?\r\n🔹 Découvrir des outils essentiels : Nous explorerons des solutions incontournables pour analyser, détecter et corriger les vulnérabilités avant qu’elles ne deviennent critiques.\r\n🔹 Gagner en efficacité sans ralentir le développement : Automatisation, intégration continue, gestion des dépendances… Adoptez une stratégie qui renforce la sécurité sans sacrifier l’agilité.\r\n\r\nLes outils qui feront la différence :\r\n🛠️ SonarQube – L’analyseur de code incontournable\r\nDétectez les failles de sécurité, améliorez la qualité du code et assurez-vous que chaque ligne respecte les meilleures pratiques.\r\n\r\n🌐 OWASP ZAP – Le scanner de sécurité pour vos applications web\r\nIdentifiez les vulnérabilités avant qu’un attaquant ne le fasse, et intégrez ces analyses dans vos pipelines CI/CD.\r\n\r\n🔒 HashiCorp Vault – La gestion sécurisée des secrets\r\nStockez, gérez et protégez les informations sensibles de votre application, tout en limitant les accès aux bonnes personnes.\r\n\r\n📦 OWASP Dependency Track – Sécurisation des dépendances open source\r\nNe laissez pas des bibliothèques obsolètes ou vulnérables mettre en péril votre application. Surveillez et corrigez proactivement.\r\n\r\n📊 DefectDojo – La plateforme centralisée pour piloter la sécurité\r\nSuivez, priorisez et automatisez la gestion des vulnérabilités pour une approche DevSecOps efficace et durable.",
      "startsAt": "2025-06-27T14:30:00",
      "endsAt": "2025-06-27T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "548a46a5-9467-4102-9b42-aea93b54e8ef",
        "c03ddc8d-accb-4939-bc0a-b54d69f0e1f9"
      ],
      "categoryItems": [
        325282,
        325285,
        325297,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "821780",
      "title": "Comment débuter dans l'accessibilité numérique ?",
      "description": "Vous êtes développeuse ou développeur et vous êtes intéressés par l'accessibilité numérique mais vous ne savez pas par où commencer ? Venez découvrir les bases du développement de l'accessibilité numérique en HTML. Vous verrez que respecter la sémantique HTML permet de faciliter l'accessibilité.\r\nA travers mes exemples, vous pourrez sans peine appliquer les conseils que je vous donnerai dans vos développements y compris dans les frameworks JS (Angular, React et Vue).",
      "startsAt": "2025-06-27T14:30:00",
      "endsAt": "2025-06-27T15:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "ab594bc0-70e0-4637-a9cc-2b839d2995af"
      ],
      "categoryItems": [
        325282,
        325286,
        325298
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892585",
      "title": "Tout déléguer, mais à quel prix ? Les vrais chiffres derrière un bon outllage",
      "description": "_\"Combien ça coûte de complètement outiller le cycle de vie d'une application et les développeurs travaillant dessus ?\"_ —  Vous aurez la réponse en sortant de ce talk !\r\n\r\n**Déléguer un maximum** à des services managés & SaaS tout ce qui n'est pas de la logique métier, c'est sans l'ombre d'un doute très pratique et plein d'avantages… mais combien ça coûte vraiment au bout du compte ?\r\n\r\nChez PayFit, licorne scale-up française disposant de forts moyens d'investissements, nous avons eu la chance de pouvoir faire le pari de joyeusement déléguer tout ce que nous pouvions, et de nous acheter une certaine tranquillité d'esprit. Dans ce talk, venez découvrir **les vrais chiffres de PayFit en tout transparence**, y compris le coût \"par développeur\" — un exercice trop rarement fait !\r\n\r\nDe l'hébergement des applications à l'outillage des développeurs en passant par l'automatisation du cycle de vie d'une application, nous parlerons des coûts d'AWS, CircleCI, Raenovate, Datadog, Launchdarkly, GitHub (et Copilot), licences d'IDE, et plus généralement des …  **81 (!) outils tiers** sur lesquels PayFit repose, ce panorama se voulant aussi exhaustif que possible.\r\n\r\nAu-delà des coûts unitaires, nous explorerons également comment maintenir un certain contrôle et éviter un flagrant gâchis de moyens sans pour autant nuire à l'efficacité et au confort.",
      "startsAt": "2025-06-27T16:00:00",
      "endsAt": "2025-06-27T16:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "9311189d-9779-44cf-b50c-700a4f4d6901"
      ],
      "categoryItems": [
        325284,
        325292,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57577,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "838146",
      "title": "20 min pour réduire l'impact environnemental d'un site",
      "description": "    Anciennement Product Owner, j’aide maintenant les entreprises à réduire leur empreinte environnementale numérique. A chaque fois que je regarde sous le capot d’une page web, je vois toujours (ou presque) les mêmes défauts…\r\n\r\n    Dans ce talk, je vais vous présenter un réel site statique responsive (légèrement modifié pour les besoins de l’atelier). Je vais vous montrer rapidement le code (HTML, CSS, javascript) ainsi que son score environnemental : l’éco-index.\r\n    Puis par une série de petites optimisations rapides, nous allons améliorer l’éco-index et donc l’empreinte environnementale du site. Il n’y a là rien de bien compliqué, mais en quelques minutes on va drastiquement améliorer ce site.\r\n\r\n    Malgré son côté technique, cette présentation reste très accessible pour toute personne travaillant dans le numérique.",
      "startsAt": "2025-06-27T16:00:00",
      "endsAt": "2025-06-27T16:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c0d9a6de-346a-4cc1-9fac-4f5080d25699"
      ],
      "categoryItems": [
        325284,
        325295,
        325298
      ],
      "questionAnswers": [],
      "roomId": 57578,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "892932",
      "title": "conteneurisation de Python : chute de performances et investigations",
      "description": "Notre service numérique python de traitement de données temporelles tournait sur un serveur en mêlant multithreading et multiprocessing, il était temps de le conteneuriser. Un coup de Docker et c’est parti… pour une chute de 30% des performances : CPU et RAM qui grimpent, le temps d’exécution aussi et l’ingestion des données prend du retard. Trop.\r\n\r\nOn s’aperçoit alors que les images Docker Python “officielles” ne sont pas performantes, que l’installation de Python sur un système propose des options de compilation au potentiel intéressant. Un trio se met en place pour élaborer un benchmark pour comparer les performances de différentes façon d’installer Python dans un conteneur Docker : image officielle, Python natif d‘une image Debian, différentes modalités d’installation par pyenv et par uv, l’outil sorti en 2024 qui “dérouille” l’écosystème Python (vous l’avez ?).\r\n\r\nTout benchmark a ses biais, c’est pourquoi nous insisterons sur la démarche élaborée et suivie pour que vous puissiez la reproduire sur vos bases de codes, plutôt que d’insister sur les résultats.\r\n\r\nLe trio :\r\n- Gaston Gary : spécialiste du métier du service numérique\r\n- Sébastien Baguet : spécialiste infrastructure et conteneurisation\r\n- Luc Sorel-Giffo : spécialiste Python\r\n\r\n",
      "startsAt": "2025-06-27T16:00:00",
      "endsAt": "2025-06-27T16:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "107ca0a9-fade-4f1f-940d-01ec9967ee87",
        "d3e04b6b-b82e-40dd-b811-343fb0867746",
        "8df53dbf-7f6d-4ab5-ac1d-e3eae87af671"
      ],
      "categoryItems": [
        325282,
        325284,
        325297,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65425,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "842957",
      "title": "Améliorons la qualité et l'adoption de nos API grâce à l'approche API-First",
      "description": "Et si la prochaine innovation dans le monde des API était l' Expérience Développeur  ?\r\n\r\nLorsqu'on souhaite développer des API, nous opposons régulièrement les approches Code-First et API-First. La plupart des développeurs préfèrent la première car elle est plus centrée sur le code. Malheureusement, de la seconde on ne retient trop souvent que les mots \"documentations\" ou \"spécifications\".\r\nCette dernière offre cependant de nombreux avantages : compatibilité automatique des implémentations avec les spécifications, automatisation de la validation des API publiées et surtout, amélioration de l'expérience développeur de vos clients.\r\n\r\nDans ce tools in action, nous transformerons une application Java en la rendant \"API-First\" avec des pratiques et outils que j'ai pu mettre en oeuvre dans mes récentes expériences tels que la spécification JsonAPI ou les outils proposés par l'OpenAPI Initiative (OpenAPI Generator, OASDIFF,Microcks).\r\n\r\nNous verrons enfin comment relever ce grand défi : simplifier vos développements, améliorer la qualité de vos API, favoriser son adoption par vos clients et, surtout, faire en sorte que vos développeurs puissent adorer manipuler de la documentation d'API.\r\n\r\n",
      "startsAt": "2025-06-27T16:00:00",
      "endsAt": "2025-06-27T16:25:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "89782719-2288-4b59-aec7-8951ca26c446"
      ],
      "categoryItems": [
        325284,
        325290,
        325299
      ],
      "questionAnswers": [],
      "roomId": 65426,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    }
  ],
  "speakers": [
    {
      "id": "fecaaa02-e901-4689-97d9-48823e54efa0",
      "firstName": "Adrien",
      "lastName": "Pessu",
      "bio": null,
      "tagLine": "Field Security Specialist @GitHub",
      "profilePicture": "https://sessionize.com/image/31ee-400o400o1-9BiXoufWtWhxRU8Mcd9thW.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893099
      ],
      "fullName": "Adrien Pessu",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "56865d7c-6ff0-4911-8d50-b2a276b9c7a5",
      "firstName": "Alexandre",
      "lastName": "Baron",
      "bio": null,
      "tagLine": "Développeur backend @ Code With Us",
      "profilePicture": "https://sessionize.com/image/66c6-400o400o1-U7EH5N3pGFb9ZQUKm99YDe.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        878221
      ],
      "fullName": "Alexandre Baron",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "89782719-2288-4b59-aec7-8951ca26c446",
      "firstName": "Alexandre",
      "lastName": "Touret",
      "bio": null,
      "tagLine": "Architect at Worldline",
      "profilePicture": "https://sessionize.com/image/5392-400o400o1-Tho9qRRznEeVdAFKVqpQAh.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        842957
      ],
      "fullName": "Alexandre Touret",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "9311189d-9779-44cf-b50c-700a4f4d6901",
      "firstName": "Alexis \"Horgix\"",
      "lastName": "Chotard",
      "bio": null,
      "tagLine": "Staff SRE @ PayFit",
      "profilePicture": "https://sessionize.com/image/872c-400o400o1-H7g2nepYUA1xbxPffCzoTy.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892604,
        892585
      ],
      "fullName": "Alexis \"Horgix\" Chotard",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "572d908f-34f0-41b6-bdcb-ca54a5afac31",
      "firstName": "Ali",
      "lastName": "El Amrani",
      "bio": null,
      "tagLine": "Zenika, engineering manager",
      "profilePicture": "https://sessionize.com/image/e958-400o400o1-35G6fcmBz2BUK3YwKTwGAb.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        880963
      ],
      "fullName": "Ali El Amrani",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "3704c939-cf7e-4eb5-b27e-3c4adcc26849",
      "firstName": "Amélie",
      "lastName": "Serrand",
      "bio": null,
      "tagLine": "Lead dev & Manager R&D Téléradiologie chez Enovacom",
      "profilePicture": "https://sessionize.com/image/7961-400o400o1-TXTqMumsw15wFJteDoqSjh.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        890806
      ],
      "fullName": "Amélie Serrand",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "19305f56-33bc-4a09-a9fc-869ecbdbe498",
      "firstName": "Angi",
      "lastName": "Guyard",
      "bio": null,
      "tagLine": "Develoveuse chez Shodo",
      "profilePicture": "https://sessionize.com/image/ba0c-400o400o1-pgXKxjvLZE5wFxEgYcQEHR.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882176,
        882174
      ],
      "fullName": "Angi Guyard",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "edd18d0c-feff-4709-9fdc-ce99a8795a74",
      "firstName": "Anthony",
      "lastName": "Dassé",
      "bio": null,
      "tagLine": "France Télévision - Solutions Architect",
      "profilePicture": "https://sessionize.com/image/922f-400o400o1-wHh2A2VMZKBYNWxh5XYnyB.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        889032
      ],
      "fullName": "Anthony Dassé",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a90311bb-87bd-406b-bbd9-2a2c3e78b316",
      "firstName": "Antoine",
      "lastName": "Deprez",
      "bio": null,
      "tagLine": "Slickteam, Développeur",
      "profilePicture": "https://sessionize.com/image/fdbc-400o400o1-9kvmtA3E3S57ZgSz8pss7m.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        857242
      ],
      "fullName": "Antoine Deprez",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "524208b7-6f75-46aa-9f5a-9350e18cf178",
      "firstName": "Antoine",
      "lastName": "Oili",
      "bio": null,
      "tagLine": "Zenika - Cloud Sales Partner Manager",
      "profilePicture": "https://sessionize.com/image/9be7-400o400o1-TPEceGmN7uQLgjgwRkeetX.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879095
      ],
      "fullName": "Antoine Oili",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "72b906ad-1a5b-4110-8178-01698f9ceae6",
      "firstName": "Benoit",
      "lastName": "Averty",
      "bio": null,
      "tagLine": "Developpeur et formateur polyvalent chez Zenika Rennes",
      "profilePicture": "https://sessionize.com/image/ff75-400o400o1-XqHmfgpg6av9NWohPmMkfP.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        878985
      ],
      "fullName": "Benoit Averty",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e143dcf9-e7d9-42a5-b18e-0ea35c307cf6",
      "firstName": "Benoît",
      "lastName": "Masson",
      "bio": null,
      "tagLine": "Développeur @OVHcloud",
      "profilePicture": "https://sessionize.com/image/6020-400o400o1-arPQiiVr4xr7U41qyT11vZ.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        885103,
        827093
      ],
      "fullName": "Benoît Masson",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "54a59345-ced3-4447-bbf8-d3ce1bc1cec6",
      "firstName": "Bruno",
      "lastName": "Verachten 🍰",
      "bio": null,
      "tagLine": "Sr Developer Relations, Cloudbees",
      "profilePicture": "https://sessionize.com/image/e1d3-400o400o1-NHd7EUKggtjD6r2BmsuqhX.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893095
      ],
      "fullName": "Bruno Verachten 🍰",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "acbd55f3-0f40-493b-acbd-794c2c0457ea",
      "firstName": "Cécilia",
      "lastName": "Bossard",
      "bio": null,
      "tagLine": "Développeuse hyperactive",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        826347,
        882174
      ],
      "fullName": "Cécilia Bossard",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "84071a95-0399-4c8a-a43d-ad8dec77a7cc",
      "firstName": "Chris",
      "lastName": "Navas",
      "bio": null,
      "tagLine": "Wescale : Cloud Advisor ",
      "profilePicture": "https://sessionize.com/image/7d96-400o400o1-NcnQfvaUtwzg3ksmFfZkyc.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882642
      ],
      "fullName": "Chris Navas",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0c9b144a-3a48-4cb8-b9f9-84def47710c6",
      "firstName": "Christophe",
      "lastName": "Quintard",
      "bio": null,
      "tagLine": "Architecte @ onepoint",
      "profilePicture": "https://sessionize.com/image/08f3-400o400o1-RG4L2GaaVNwjNw6m15iQy9.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892780
      ],
      "fullName": "Christophe Quintard",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "20ae04be-db3a-4135-89b0-fab53afd8300",
      "firstName": "Christopher",
      "lastName": "Louët",
      "bio": null,
      "tagLine": "DevOps @ Oxxeo",
      "profilePicture": "https://sessionize.com/image/2411-400o400o1-WPtoB3nBvja8NnWDgsf4oT.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882264
      ],
      "fullName": "Christopher Louët",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b53d2e80-e297-4265-af4f-9623087d10d5",
      "firstName": "Damien",
      "lastName": "Hackett",
      "bio": null,
      "tagLine": "Senior Embedded Linux Engineer @ SII Grenoble",
      "profilePicture": "https://sessionize.com/image/3119-400o400o1-T119enjFzLycDXCxa7in95.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        885579
      ],
      "fullName": "Damien Hackett",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e5ebefc4-7a49-4cc6-95ed-28b1f8dfd6a2",
      "firstName": "David",
      "lastName": "Blanchet",
      "bio": null,
      "tagLine": "Developer @ Orange Innovation",
      "profilePicture": "https://sessionize.com/image/8cb1-400o400o1-GMCkpJzRhN9JbcLxnLqGMN.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        874517
      ],
      "fullName": "David Blanchet",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "d64fba44-b0b8-4281-bb00-b96f24767244",
      "firstName": "David",
      "lastName": "De Carvalho",
      "bio": null,
      "tagLine": "Capgemini : Architecte Solution, Crafter, Developpeur",
      "profilePicture": "https://sessionize.com/image/2579-400o400o1-50fd1692-adc9-430e-9e44-88407a31b701.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        881416
      ],
      "fullName": "David De Carvalho",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c6761e22-8b14-473d-83db-7168e840e2cc",
      "firstName": "Emeric",
      "lastName": "Martineau",
      "bio": null,
      "tagLine": "Crédit Agricole Technologie & Service ",
      "profilePicture": "https://sessionize.com/image/81dd-400o400o1-W2ezmfWzxkdFh7Pfyerte4.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        834143
      ],
      "fullName": "Emeric Martineau",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c32ca426-2fdb-44c3-9fd6-7706f7720e77",
      "firstName": "Emmanuel",
      "lastName": "Legros",
      "bio": null,
      "tagLine": "Decathlon Digital, Senior Software Engineer",
      "profilePicture": "https://sessionize.com/image/3f10-400o400o1-s7fEzH8rB6m7AyN8yxko6a.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883827
      ],
      "fullName": "Emmanuel Legros",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "19d8ff26-d4a1-4a0c-bd0e-33946f4e3772",
      "firstName": "Emmanuel",
      "lastName": "Quincerot",
      "bio": null,
      "tagLine": "Développeur chez Doctolib",
      "profilePicture": "https://sessionize.com/image/9262-400o400o1-PtXPeMFAtZnUoNeVmwX8Jb.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        891492
      ],
      "fullName": "Emmanuel Quincerot",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "ab594bc0-70e0-4637-a9cc-2b839d2995af",
      "firstName": "Emmanuelle",
      "lastName": "Aboaf",
      "bio": null,
      "tagLine": "Fullstack Angular .NET chez SHODO",
      "profilePicture": "https://sessionize.com/image/433f-400o400o1-TknoSaLhLts3hAmiW2Q5zt.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        821780
      ],
      "fullName": "Emmanuelle Aboaf",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8852b645-beb0-4433-85f1-4a85c989a1ea",
      "firstName": "Enora",
      "lastName": "Landurein",
      "bio": null,
      "tagLine": "Ingénieure Simulation, Sopra Steria ",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        889886
      ],
      "fullName": "Enora Landurein",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "6da05a26-7eb6-4244-abba-350669a6cd11",
      "firstName": "Eric",
      "lastName": "Siber",
      "bio": null,
      "tagLine": "#Formateur #Auditeur #Coéquipier Agile Java Craftsman (AgileDev & HackYourJob)",
      "profilePicture": "https://sessionize.com/image/25f9-400o400o1-9nZfwBWx5SsGz4W6us4tg5.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        869677
      ],
      "fullName": "Eric Siber",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "d5411057-c78c-4144-97f5-20d81354268b",
      "firstName": "Estéban",
      "lastName": "Soubiran",
      "bio": null,
      "tagLine": "Développeur web full-stack chez Maia Space",
      "profilePicture": "https://sessionize.com/image/1ed3-400o400o1-HKgRXQY6Jpmjg8yfLSB3Zv.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879525,
        879524
      ],
      "fullName": "Estéban Soubiran",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "424a78bd-3b54-4063-8892-9a920fc3b044",
      "firstName": "Fabien",
      "lastName": "Hiegel",
      "bio": null,
      "tagLine": "Tech Coach | Shodo Nantes",
      "profilePicture": "https://sessionize.com/image/96f9-400o400o1-Tr7tqUqzAumNarjaXqcWcJ.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893359
      ],
      "fullName": "Fabien Hiegel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0bef80c5-06bc-419d-98ab-dfe40311fb64",
      "firstName": "François",
      "lastName": "Dubrez",
      "bio": null,
      "tagLine": "Humble développeur chez @maxdsfrance",
      "profilePicture": "https://sessionize.com/image/e505-400o400o1-DdUczbte3uUs322HZAuXGX.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893018
      ],
      "fullName": "François Dubrez",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "62a808c7-fc60-4861-a67a-0faf19b410fd",
      "firstName": "François-Xavier",
      "lastName": "Lair",
      "bio": null,
      "tagLine": "Onepoint, DevFront expert accessibilité",
      "profilePicture": "https://sessionize.com/image/21a9-400o400o1-nGn5SbDvNXuCZ5YFwHMaBX.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        845703
      ],
      "fullName": "François-Xavier Lair",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "cf1c7638-d416-4fcb-800a-f364f419dfaa",
      "firstName": "Gaël",
      "lastName": "Salaün",
      "bio": null,
      "tagLine": "Développeur  / Organisateur d'événements",
      "profilePicture": "https://sessionize.com/image/2fd0-400o400o1-Eux73rXZ91bSs2pwW1wRBx.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        875686
      ],
      "fullName": "Gaël Salaün",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f4d763bf-5395-4cb6-a1fc-9be2c6f40534",
      "firstName": "Gaëtan",
      "lastName": "Eleouet",
      "bio": null,
      "tagLine": "Ingénieur Software-Engineering, Expert Java @meritis",
      "profilePicture": "https://sessionize.com/image/81be-400o400o1-WwcbJkwDUaQAiGwjJ7mmtH.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        889033
      ],
      "fullName": "Gaëtan Eleouet",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8df53dbf-7f6d-4ab5-ac1d-e3eae87af671",
      "firstName": "Gaston",
      "lastName": "Gary",
      "bio": null,
      "tagLine": "Développeur python ",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892932
      ],
      "fullName": "Gaston Gary",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "aebf1399-c9c0-4dd7-a7c2-a3a65b71eed1",
      "firstName": "Gregory",
      "lastName": "Houllier",
      "bio": null,
      "tagLine": "Senior Software Engineer at Swile",
      "profilePicture": "https://sessionize.com/image/7e7f-400o400o1-Xsgrp5MpJVHG8THY2ffrw5.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893371
      ],
      "fullName": "Gregory Houllier",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c0d9a6de-346a-4cc1-9fac-4f5080d25699",
      "firstName": "Guillaume",
      "lastName": "Wolf",
      "bio": null,
      "tagLine": "Green IT Trainer and Consultant",
      "profilePicture": "https://sessionize.com/image/e094-400o400o1-4PH2fej3h5rw5gnD5BkmAr.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        838146
      ],
      "fullName": "Guillaume Wolf",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "947143cb-b22d-4c97-903c-d0cc05b5eb8b",
      "firstName": "Gwendal",
      "lastName": "Leclerc",
      "bio": null,
      "tagLine": "OVHcloud, Developer at Domain Team",
      "profilePicture": "https://sessionize.com/image/3a9a-400o400o1-XJckExJ9GWvAeiqAfBe1Mi.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        885103
      ],
      "fullName": "Gwendal Leclerc",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "20ac8a46-1f84-4873-81fa-5907968cc03e",
      "firstName": "Hafsa",
      "lastName": "El Maizi",
      "bio": null,
      "tagLine": "Développeuse agile",
      "profilePicture": "https://sessionize.com/image/4e3d-400o400o1-KqUVTBa31hJDE232K8TKjp.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        843830
      ],
      "fullName": "Hafsa El Maizi",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "cffb1609-ea23-4fc2-9dfa-eb96e60f68c9",
      "firstName": "Harold",
      "lastName": "Favereau",
      "bio": null,
      "tagLine": "Développeur Full-stack",
      "profilePicture": "https://sessionize.com/image/329b-400o400o1-QuLNF6i1ukFqKasjudxjyC.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        881405
      ],
      "fullName": "Harold Favereau",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b75872d2-4d09-4ff5-81d3-e213f04a62cc",
      "firstName": "Héloïse",
      "lastName": "Dano",
      "bio": null,
      "tagLine": "ecologeek",
      "profilePicture": "https://sessionize.com/image/c2bd-400o400o1-d2-4d09-4ff5-81d3-e213f04a62cc.4be0d54c-68b1-4640-94c6-383ccfb7e64c.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        889929,
        889943
      ],
      "fullName": "Héloïse Dano",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "92a512c4-d0da-434e-b61d-8ff3c20bcce9",
      "firstName": "Henri",
      "lastName": "Gauffriau",
      "bio": null,
      "tagLine": "onepoint",
      "profilePicture": "https://sessionize.com/image/596e-400o400o1-UmbgJRB3KWjhT4qYRFFkJX.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        845703
      ],
      "fullName": "Henri Gauffriau",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e4973b28-502d-44b2-bff4-ca25f11b5c38",
      "firstName": "Inigo",
      "lastName": "Mediavilla Saiz",
      "bio": null,
      "tagLine": "Software Engineer",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        891492
      ],
      "fullName": "Inigo Mediavilla Saiz",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a73a5394-e90a-4d3d-bb13-dfd2b0fcb50b",
      "firstName": "Ivan",
      "lastName": "Béthus",
      "bio": null,
      "tagLine": "onepoint - Lead tech",
      "profilePicture": "https://sessionize.com/image/f099-400o400o1-N4FGkwct3jNUtDrbqgUVnk.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        863307
      ],
      "fullName": "Ivan Béthus",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "43bec2b4-a111-4260-b735-9f21eb6b63cf",
      "firstName": "Jean",
      "lastName": "Paliès",
      "bio": null,
      "tagLine": "Freelance software crafter",
      "profilePicture": "https://sessionize.com/image/5d87-400o400o1-HwfBiWTFBSTMAYcZ1gFhfb.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        826347
      ],
      "fullName": "Jean Paliès",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c03ddc8d-accb-4939-bc0a-b54d69f0e1f9",
      "firstName": "Jean-baptiste",
      "lastName": "Joffre",
      "bio": null,
      "tagLine": "Lead Tech - freelance",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892405
      ],
      "fullName": "Jean-baptiste Joffre",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "619dcf9a-1762-4492-850c-78dc1bfe7f48",
      "firstName": "Jérémy",
      "lastName": "Chauvin",
      "bio": null,
      "tagLine": "Developpeur",
      "profilePicture": "https://sessionize.com/image/7436-400o400o1-SPmSC93pPfYk4Uetx4EkjK.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        838332
      ],
      "fullName": "Jérémy Chauvin",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a634e6f1-4c3f-482f-93e1-22008d97e0eb",
      "firstName": "Joffrey",
      "lastName": "Bétourné",
      "bio": null,
      "tagLine": "Développeur full stack chez Enovacom",
      "profilePicture": "https://sessionize.com/image/7269-400o400o1-EbXQcj3pt8Ymzb1NPvnCgS.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        890806
      ],
      "fullName": "Joffrey Bétourné",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b1974f5a-0a03-4079-abae-0f87145fb355",
      "firstName": "Julien",
      "lastName": "Haumont",
      "bio": null,
      "tagLine": "SRE at BlaBlaCar",
      "profilePicture": "https://sessionize.com/image/7969-400o400o1-B2ZtTrQL9eUSREaVrX8Gyz.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        834143
      ],
      "fullName": "Julien Haumont",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "83bf795b-c16c-4db3-909c-02197d773093",
      "firstName": "Julien",
      "lastName": "Sulpis",
      "bio": null,
      "tagLine": "Tech Lead front-end @Zenika",
      "profilePicture": "https://sessionize.com/image/2c67-400o400o1-7PwAWaDz8JckJJjTt4oXZv.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        825531
      ],
      "fullName": "Julien Sulpis",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "bb3d9d1b-57f8-4e44-b487-a6e1492dd5d9",
      "firstName": "Julien",
      "lastName": "Topçu",
      "bio": null,
      "tagLine": "Tech Coach @ Shodo",
      "profilePicture": "https://sessionize.com/image/e31d-400o400o1-1b-57f8-4e44-b487-a6e1492dd5d9.d768854a-603f-4104-ae25-25c1d9f53eb8.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        832863
      ],
      "fullName": "Julien Topçu",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "5ab0d7c3-da8a-4adf-9e13-58aaa7a9fa32",
      "firstName": "Juliette",
      "lastName": "de Rancourt",
      "bio": null,
      "tagLine": "Software engineer at SHODO",
      "profilePicture": "https://sessionize.com/image/ef95-400o400o1-MRsavm8DusvDn9sxHnjz33.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        889757
      ],
      "fullName": "Juliette de Rancourt",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "107ca0a9-fade-4f1f-940d-01ec9967ee87",
      "firstName": "Luc",
      "lastName": "Sorel-Giffo",
      "bio": null,
      "tagLine": "See you sun, tech lead Python",
      "profilePicture": "https://sessionize.com/image/708a-400o400o1-7Rj4bkFvq6wkqAGZ2uReY.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892932
      ],
      "fullName": "Luc Sorel-Giffo",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f24b40fe-f430-46df-be2e-5fd2ee3d3b83",
      "firstName": "Lucas",
      "lastName": "Sécurin",
      "bio": null,
      "tagLine": "Développeur d'outils de détection de phishing",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        911393
      ],
      "fullName": "Lucas Sécurin",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "3cef0ae9-f716-42f4-9a90-02ced19310d7",
      "firstName": "Ludovic",
      "lastName": "Boutros",
      "bio": null,
      "tagLine": "Senior Solution Architect @ Confluent",
      "profilePicture": "https://sessionize.com/image/be71-400o400o1-MQv3HKZHQ6F33SpL3ZNmHT.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882454
      ],
      "fullName": "Ludovic Boutros",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "09ba1352-1b84-4ecf-9216-26ec8c345d2d",
      "firstName": "Manon",
      "lastName": "Carbonnel",
      "bio": null,
      "tagLine": "Développeuse et intégratrice web",
      "profilePicture": "https://sessionize.com/image/238d-400o400o1-97DpFrcdUDwM3d5iHhtBHi.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883823,
        875686
      ],
      "fullName": "Manon Carbonnel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "585544af-3f57-498c-b005-b5059bc5d595",
      "firstName": "Marie",
      "lastName": "Gigon",
      "bio": null,
      "tagLine": "Product Owner et manager chez Zenika",
      "profilePicture": "https://sessionize.com/image/fb4b-400o400o1-hENNFnEtjqDSbZL59DBbKw.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879938
      ],
      "fullName": "Marie Gigon",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "2e34a8ec-f173-4561-ad6e-0504cd1804a7",
      "firstName": "Marie",
      "lastName": "Viley",
      "bio": null,
      "tagLine": "Directrice d'agence chez Zenika Nantes",
      "profilePicture": "https://sessionize.com/image/865a-400o400o1-0614b306-c973-4cb7-a982-2ec24d0858d7.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        887174,
        887177
      ],
      "fullName": "Marie Viley",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "66462b24-0915-46c5-a5f2-834493f12c6c",
      "firstName": "Mathieu",
      "lastName": "Durand",
      "bio": null,
      "tagLine": "Liksi",
      "profilePicture": "https://sessionize.com/image/5d69-400o400o1-VJB41AQTfsjX7SH3LhBVFd.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        881309,
        889055
      ],
      "fullName": "Mathieu Durand",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "6029450b-fe28-4177-87fe-5c05c4bd5378",
      "firstName": "Maxime",
      "lastName": "Maigret",
      "bio": null,
      "tagLine": "Developpeur",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882931
      ],
      "fullName": "Maxime Maigret",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e6528c62-4131-49a4-b5e3-86c083cccc51",
      "firstName": "Maxime",
      "lastName": "Odye",
      "bio": null,
      "tagLine": "Consultant & Co-fondateur de Code with us",
      "profilePicture": "https://sessionize.com/image/65df-400o400o1-TuTuyxkpA88GV9Y6tMj3oA.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882411
      ],
      "fullName": "Maxime Odye",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f7977f6a-ca50-40c6-b54f-b55db26cb0dd",
      "firstName": "Maxime",
      "lastName": "Reynier",
      "bio": null,
      "tagLine": "Software Architect at Onepoint Bretagne",
      "profilePicture": "https://sessionize.com/image/3db0-400o400o1-UKQh5nUsQdVFjwVBmSShMG.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879867
      ],
      "fullName": "Maxime Reynier",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "548a46a5-9467-4102-9b42-aea93b54e8ef",
      "firstName": "Mehdi",
      "lastName": "Chilla",
      "bio": null,
      "tagLine": "IMA engineering manager",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892405
      ],
      "fullName": "Mehdi Chilla",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "57a0073c-0819-4cbd-ab19-d461605bb965",
      "firstName": "Mickaël",
      "lastName": "Barroux",
      "bio": null,
      "tagLine": "Co-fondateur chez Code with us. Consultant fullstack",
      "profilePicture": "https://sessionize.com/image/01f9-400o400o1-JvHcT4er1ZBfESraDJ53cF.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        856962
      ],
      "fullName": "Mickaël Barroux",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "3de0afa9-fb28-44cc-9492-131b07680cee",
      "firstName": "Milan",
      "lastName": "Jakobi",
      "bio": null,
      "tagLine": "Software Engineer - Thales",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        856457
      ],
      "fullName": "Milan Jakobi",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "cb7ebb0e-3ef1-4d2c-8a2b-96d38131a3e8",
      "firstName": "Nailya",
      "lastName": "Bogrova",
      "bio": null,
      "tagLine": "Développeuse back-end",
      "profilePicture": "https://sessionize.com/image/58e1-400o400o1-Uzs5f3ufSHbzUtPNBGN2EU.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        828525
      ],
      "fullName": "Nailya Bogrova",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "07cd0dc2-1db7-48e4-adb7-4f295d13c3ae",
      "firstName": "Nathan",
      "lastName": "Castelein",
      "bio": null,
      "tagLine": "Co-fondateur Shodo Lille / Développeur sénior",
      "profilePicture": "https://sessionize.com/image/d0d9-400o400o1-aXikhYCFCuSbwVv4joAAWA.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        871686,
        871684
      ],
      "fullName": "Nathan Castelein",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "cef8c142-9b42-4d0a-b2dd-8fe32628f003",
      "firstName": "Nicolas",
      "lastName": "Bouron",
      "bio": null,
      "tagLine": "Zenika, Consultant Formateur DevOps/Cloud",
      "profilePicture": "https://sessionize.com/image/0d6d-400o400o1-Pvq1jQwqqxn6QXAKq3HgRy.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879095
      ],
      "fullName": "Nicolas Bouron",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "df701232-56b1-4367-b009-d733c289dafe",
      "firstName": "Nicolas",
      "lastName": "Giraud",
      "bio": null,
      "tagLine": "Lead Tech",
      "profilePicture": "https://sessionize.com/image/5baf-400o400o1-a635a143-9934-46bb-966c-460355a8a2c5.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893338
      ],
      "fullName": "Nicolas Giraud",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a93932b4-8308-4fba-b918-04467f3ca1b5",
      "firstName": "Nicolas",
      "lastName": "Ledez",
      "bio": null,
      "tagLine": "Devops guru @ CGWire",
      "profilePicture": "https://sessionize.com/image/676e-400o400o1-DuqeMkm76i3NqTf2r4n7aD.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892551,
        892554
      ],
      "fullName": "Nicolas Ledez",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f3202151-93c0-41d1-8b02-4926f4adbe94",
      "firstName": "Nicolas",
      "lastName": "Leport",
      "bio": null,
      "tagLine": "Consultant @Zenika",
      "profilePicture": "https://sessionize.com/image/5310-400o400o1-HrFxUNZ22xYNnX9KytuzNS.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879938
      ],
      "fullName": "Nicolas Leport",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "294d6181-500c-4b0f-b609-e0a506ac3077",
      "firstName": "Nicolas",
      "lastName": "Pennec",
      "bio": null,
      "tagLine": "Tech Lead / Fullstack Web Developer",
      "profilePicture": "https://sessionize.com/image/8a80-400o400o1-RmiYnit3QfCZEG3rxJFgE2.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893423
      ],
      "fullName": "Nicolas Pennec",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e2d688bf-bd80-4227-937e-a38b9cc3a7ae",
      "firstName": "Olivier",
      "lastName": "Bourgain",
      "bio": null,
      "tagLine": "software architect @Mirakl",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883234
      ],
      "fullName": "Olivier Bourgain",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "2cfe92bd-2140-4072-956d-73502aaeb90d",
      "firstName": "Olivier",
      "lastName": "Cloirec",
      "bio": null,
      "tagLine": "Cloud Builder chez WeScale",
      "profilePicture": "https://sessionize.com/image/4602-400o400o1-X36YUmSxGVJJ4sa1JBqCum.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893365
      ],
      "fullName": "Olivier Cloirec",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "725af93f-5681-41af-acb9-80d7dbcd8c4e",
      "firstName": "Patrice",
      "lastName": "Corteel",
      "bio": null,
      "tagLine": "Néosoft, CTO",
      "profilePicture": "https://sessionize.com/image/dd68-400o400o1-LySUQdLWa1UYdBbpMEwmJ1.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        881204
      ],
      "fullName": "Patrice Corteel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "89cd5e0b-53e2-4f40-ae73-febf913ffd14",
      "firstName": "Paul",
      "lastName": "Roye",
      "bio": null,
      "tagLine": "Tech Lead Backend",
      "profilePicture": "https://sessionize.com/image/ced5-400o400o1-R24PaRYR53R2mP6VqzJyb7.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        885442
      ],
      "fullName": "Paul Roye",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b55331e8-3151-4604-9350-64d63a1693b3",
      "firstName": "Pierre",
      "lastName": "Chesneau",
      "bio": null,
      "tagLine": "Architecte Logiciel & Responsable du build Azure @ Bleu",
      "profilePicture": "https://sessionize.com/image/aa62-400o400o1-9UR9WxJK3upwhALewADge2.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        857012
      ],
      "fullName": "Pierre Chesneau",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c0b9c265-b20a-4522-80e1-9a069d0c3c92",
      "firstName": "Pierre",
      "lastName": "Fervel",
      "bio": null,
      "tagLine": "Max Digital Services",
      "profilePicture": "https://sessionize.com/image/b784-400o400o1-whjVTRPgo5Roiw3vY6w1Qh.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        885510
      ],
      "fullName": "Pierre Fervel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e2b571e2-472e-42a1-9a1c-b3b9f542824f",
      "firstName": "Pierre",
      "lastName": "Rineau",
      "bio": null,
      "tagLine": "Software Engineer",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883212
      ],
      "fullName": "Pierre Rineau",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "32398022-78ba-4385-8c4f-db0f8adf3395",
      "firstName": "Raphaël",
      "lastName": "Luta",
      "bio": null,
      "tagLine": "Aptiwan",
      "profilePicture": "https://sessionize.com/image/a287-400o400o1-pSQHEoSMTvNLuKrpBmLK7d.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        882291
      ],
      "fullName": "Raphaël Luta",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "d8ecbdb8-a0df-4345-82e5-6df992636dc1",
      "firstName": "Romain",
      "lastName": "Blazeix",
      "bio": null,
      "tagLine": "Software engineer - Orange",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        874517
      ],
      "fullName": "Romain Blazeix",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "97bdf918-611b-4b36-bcf9-386f681602ba",
      "firstName": "Samuel",
      "lastName": "Lefebvre",
      "bio": null,
      "tagLine": "Tech lead at Shodo",
      "profilePicture": "https://sessionize.com/image/c26f-400o400o1-Ehbn5An1vGED9yYHP9hqQN.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        831585
      ],
      "fullName": "Samuel Lefebvre",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "d3e04b6b-b82e-40dd-b811-343fb0867746",
      "firstName": "Sebastien",
      "lastName": "Baguet",
      "bio": null,
      "tagLine": "Purecontrol, Lead infrastructure",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        892932
      ],
      "fullName": "Sebastien Baguet",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "1f221109-c45a-4149-8770-4610c595d52e",
      "firstName": "Sébastien",
      "lastName": "Bertrand",
      "bio": null,
      "tagLine": "Onepoint, Lead Tech Java",
      "profilePicture": "https://sessionize.com/image/2678-400o400o1-3ApPQg9yPPvrqvV6fyWmn1.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        871972
      ],
      "fullName": "Sébastien Bertrand",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a1a3a044-9414-4cc9-a12d-600d60bf0492",
      "firstName": "Sébastien",
      "lastName": "Buchoux",
      "bio": null,
      "tagLine": "Onepoint",
      "profilePicture": "https://sessionize.com/image/1195-400o400o1-JVEyo4NNSK81Pjbc1EF1VB.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        852137,
        852130
      ],
      "fullName": "Sébastien Buchoux",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f0679a02-6e5e-4a58-9f1e-322ed6d69ff0",
      "firstName": "Sébastien",
      "lastName": "Lecacheur",
      "bio": null,
      "tagLine": "Odigo, architecte",
      "profilePicture": "https://sessionize.com/image/a166-400o400o1-BAVKQ2xjVFVsVZFKjgqxeu.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        881810,
        881814
      ],
      "fullName": "Sébastien Lecacheur",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c7aad32d-e553-4cb4-889c-57cec629c798",
      "firstName": "Séguillon",
      "lastName": "Joël",
      "bio": null,
      "tagLine": "Freelance Devops",
      "profilePicture": "https://sessionize.com/image/8e6d-400o400o1-KNYwkEmniuB3SJHaPwk1H.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893286
      ],
      "fullName": "Séguillon Joël",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "124037c0-913b-4e2c-9fe8-9795990aa7ea",
      "firstName": "Simon",
      "lastName": "Mellerin",
      "bio": null,
      "tagLine": "Artisan du web chez Makina Corpus",
      "profilePicture": "https://sessionize.com/image/6e0b-400o400o1-HT4LjsLvqLziCMQYGvwuPY.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883212
      ],
      "fullName": "Simon Mellerin",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "be291234-34e1-424f-8b4a-528ffd6c5338",
      "firstName": "Sonia",
      "lastName": "Seddiki",
      "bio": null,
      "tagLine": "Cybersecurity Enthusiast | CTF Player",
      "profilePicture": "https://sessionize.com/image/cc4a-400o400o1-WTdq9aQxZxJeKZgQXZsuv4.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        828529,
        828525
      ],
      "fullName": "Sonia Seddiki",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c40b8778-e2a5-4824-a755-72ceaa12070d",
      "firstName": "Stéphane",
      "lastName": "Trebel",
      "bio": null,
      "tagLine": "Permacodeur chez WeScale",
      "profilePicture": "https://sessionize.com/image/a6be-400o400o1-fnqEYNZ3tQ6s64qHhDetG3.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        860353
      ],
      "fullName": "Stéphane Trebel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "619ba5cd-a12a-4526-9f1a-7b9dd816d6a3",
      "firstName": "Sylvain",
      "lastName": "Decout",
      "bio": null,
      "tagLine": "Coding architect @Shodo",
      "profilePicture": "https://sessionize.com/image/54eb-400o400o1-DBkSeeptTaUkjWt2TUnEZs.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        831585
      ],
      "fullName": "Sylvain Decout",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "60ee88c6-3fbd-4467-8388-dcb3069e6bc1",
      "firstName": "Thibaut",
      "lastName": "Cantet",
      "bio": null,
      "tagLine": "Nésoft, software developer",
      "profilePicture": "https://sessionize.com/image/b91c-400o400o1-QEgWaQotzuTLVAKQwKHKKX.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        835967
      ],
      "fullName": "Thibaut Cantet",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "1b42c774-b49f-4975-ade3-bdd4bb6e0f93",
      "firstName": "Thomas",
      "lastName": "Blaisot",
      "bio": null,
      "tagLine": "Lead Tech chez onepoint",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893338
      ],
      "fullName": "Thomas Blaisot",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e1e57fb8-830f-4542-b811-47c847e4a0b9",
      "firstName": "Thomas",
      "lastName": "Pierrain",
      "bio": null,
      "tagLine": "Use case driven",
      "profilePicture": "https://sessionize.com/image/2cb5-400o400o1-b8-830f-4542-b811-47c847e4a0b9.0ab7b331-0545-44b7-ac29-da528c15ec81.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        832863
      ],
      "fullName": "Thomas Pierrain",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "bc34fdc8-be25-4c32-ae1d-9fd6f1905b02",
      "firstName": "Thomas",
      "lastName": "Piscitelli",
      "bio": null,
      "tagLine": "Liksi",
      "profilePicture": "https://sessionize.com/image/07b9-400o400o1-GTgK9yTSbpBF2WocTr9SaF.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        879244,
        879240
      ],
      "fullName": "Thomas Piscitelli",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a077b0b1-30b9-42b2-aabb-cf207b0ad01b",
      "firstName": "Thomas",
      "lastName": "Ployon",
      "bio": null,
      "tagLine": "Co-fondateur @Shodo-Rennes",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883823
      ],
      "fullName": "Thomas Ployon",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "50118cb3-17eb-4e55-a910-a94a5f83c28d",
      "firstName": "Tristan",
      "lastName": "Denmat",
      "bio": null,
      "tagLine": "Architecte logiciel - LIKSI",
      "profilePicture": "https://sessionize.com/image/8fef-400o400o1-JkBJidrJ6vA2qAqd8FQd1c.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        890887
      ],
      "fullName": "Tristan Denmat",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "89ef7dc8-3f4e-4680-b71f-b1ec0c5ad6e2",
      "firstName": "William",
      "lastName": "Bartlett",
      "bio": null,
      "tagLine": "Coach Agile",
      "profilePicture": "https://sessionize.com/image/dc3f-400o400o1-JESyazdrPjSzquSvrjp9Mk.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        883709,
        883713
      ],
      "fullName": "William Bartlett",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "5675dfb0-14be-4f96-ba1c-f36276ab030a",
      "firstName": "Yann",
      "lastName": "Bouvet",
      "bio": null,
      "tagLine": "Développeur Fullstack, Shodo Lyon",
      "profilePicture": "https://sessionize.com/image/d9e7-400o400o1-D4nfLHXh8Ch9fCzrNZytxX.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        838332
      ],
      "fullName": "Yann Bouvet",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "88f16687-0ac9-4bb0-8c3d-72818ee7e5e6",
      "firstName": "Yann",
      "lastName": "Schepens",
      "bio": null,
      "tagLine": "Lead Tech @ Onepoint",
      "profilePicture": "https://sessionize.com/image/c4e8-400o400o1-9r7oZhKEXJfYvVLhfx8oVx.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        893338
      ],
      "fullName": "Yann Schepens",
      "categoryItems": [],
      "questionAnswers": []
    }
  ],
  "questions": [],
  "categories": [
    {
      "id": 90809,
      "title": "Format",
      "items": [
        {
          "id": 325282,
          "name": "Conférence (55 min)",
          "sort": 1
        },
        {
          "id": 325283,
          "name": "Université (2h, Mercredi)",
          "sort": 2
        },
        {
          "id": 325284,
          "name": "Tool in action (25 min)",
          "sort": 3
        },
        {
          "id": 325285,
          "name": "Quicky (15 min)",
          "sort": 4
        }
      ],
      "sort": 0,
      "type": "session"
    },
    {
      "id": 90810,
      "title": "Thème",
      "items": [
        {
          "id": 325286,
          "name": "Web",
          "sort": 1
        },
        {
          "id": 325287,
          "name": "Méthodologie",
          "sort": 2
        },
        {
          "id": 325288,
          "name": "Data",
          "sort": 3
        },
        {
          "id": 325289,
          "name": "Architecture",
          "sort": 4
        },
        {
          "id": 325290,
          "name": "Développement",
          "sort": 5
        },
        {
          "id": 325291,
          "name": "IoT Embarqué",
          "sort": 6
        },
        {
          "id": 325293,
          "name": "Mobile",
          "sort": 7
        },
        {
          "id": 325294,
          "name": "IA",
          "sort": 8
        },
        {
          "id": 325292,
          "name": "Autre...",
          "sort": 9
        },
        {
          "id": 325295,
          "name": "Écoconception",
          "sort": 10
        },
        {
          "id": 325297,
          "name": "DevOps",
          "sort": 11
        },
        {
          "id": 325296,
          "name": "Sécurité",
          "sort": 12
        }
      ],
      "sort": 1,
      "type": "session"
    },
    {
      "id": 90811,
      "title": "Niveau",
      "items": [
        {
          "id": 325298,
          "name": "Introduction",
          "sort": 1
        },
        {
          "id": 325299,
          "name": "Standard",
          "sort": 2
        },
        {
          "id": 325300,
          "name": "Avancé",
          "sort": 3
        }
      ],
      "sort": 2,
      "type": "session"
    }
  ],
  "rooms": [
    {
      "id": 57577,
      "name": "Amphi A",
      "sort": 0
    },
    {
      "id": 57578,
      "name": "Amphi B",
      "sort": 1
    },
    {
      "id": 57579,
      "name": "Amphi C",
      "sort": 2
    },
    {
      "id": 65425,
      "name": "Amphi D",
      "sort": 4
    },
    {
      "id": 65426,
      "name": "Amphi E",
      "sort": 5
    }
  ]
}